<?xml version="1.0"?>
<GCC_XML version="0.9.0" cvs_revision="1.136">

  </Enumeration>
  <Typedef id="_3351" name="thread_id_t" type="_3350" context="_1" location="f284:79" file="f284" line="79"/>
  <Enumeration id="_3352" name="task_thread_id_t" context="_1" location="f284:82" file="f284" line="82">
    <EnumValue name="TASK_TIMER_THREAD" init="1"/>
    <EnumValue name="TASK_L2L1_THREAD" init="2"/>
    <EnumValue name="TASK_BM_THREAD" init="3"/>
    <EnumValue name="TASK_PHY_ENB_THREAD" init="2"/>
    <EnumValue name="TASK_MAC_ENB_THREAD" init="2"/>
    <EnumValue name="TASK_RLC_ENB_THREAD" init="2"/>
    <EnumValue name="TASK_PDCP_ENB_THREAD" init="2"/>
    <EnumValue name="TASK_RRC_ENB_THREAD" init="4"/>
    <EnumValue name="TASK_RRC_ENB_NB_IoT_THREAD" init="5"/>
    <EnumValue name="TASK_RAL_ENB_THREAD" init="6"/>
    <EnumValue name="TASK_UDP_THREAD" init="7"/>
    <EnumValue name="TASK_GTPV1_U_THREAD" init="8"/>
    <EnumValue name="TASK_S1AP_THREAD" init="9"/>
    <EnumValue name="TASK_X2AP_THREAD" init="10"/>
    <EnumValue name="TASK_SCTP_THREAD" init="11"/>
    <EnumValue name="TASK_ENB_APP_THREAD" init="12"/>
    <EnumValue name="TASK_FLEXRAN_AGENT_THREAD" init="13"/>
    <EnumValue name="TASK_PHY_UE_THREAD" init="2"/>
    <EnumValue name="TASK_MAC_UE_THREAD" init="2"/>
    <EnumValue name="TASK_RLC_UE_THREAD" init="2"/>
    <EnumValue name="TASK_PDCP_UE_THREAD" init="2"/>
    <EnumValue name="TASK_RRC_UE_THREAD" init="14"/>
    <EnumValue name="TASK_NAS_UE_THREAD" init="15"/>
    <EnumValue name="TASK_RAL_UE_THREAD" init="16"/>
    <EnumValue name="TASK_MSC_THREAD" init="17"/>
  </Enumeration>
  <Typedef id="_3353" name="task_thread_id_t" type="_3352" context="_1" location="f284:88" file="f284" line="88"/>
  <Enumeration id="_3354" name="task_id_t" context="_1" location="f284:91" file="f284" line="91">
    <EnumValue name="TASK_UNKNOWN" init="0"/>
    <EnumValue name="TASK_TIMER" init="1"/>
    <EnumValue name="TASK_L2L1" init="2"/>
    <EnumValue name="TASK_BM" init="3"/>
    <EnumValue name="TASK_PHY_ENB" init="4"/>
    <EnumValue name="TASK_MAC_ENB" init="5"/>
    <EnumValue name="TASK_RLC_ENB" init="6"/>
    <EnumValue name="TASK_PDCP_ENB" init="7"/>
    <EnumValue name="TASK_RRC_ENB" init="8"/>
    <EnumValue name="TASK_RRC_ENB_NB_IoT" init="9"/>
    <EnumValue name="TASK_RAL_ENB" init="10"/>
    <EnumValue name="TASK_UDP" init="11"/>
    <EnumValue name="TASK_GTPV1_U" init="12"/>
    <EnumValue name="TASK_S1AP" init="13"/>
    <EnumValue name="TASK_X2AP" init="14"/>
    <EnumValue name="TASK_SCTP" init="15"/>
    <EnumValue name="TASK_ENB_APP" init="16"/>
    <EnumValue name="TASK_FLEXRAN_AGENT" init="17"/>
    <EnumValue name="TASK_PHY_UE" init="18"/>
    <EnumValue name="TASK_MAC_UE" init="19"/>
    <EnumValue name="TASK_RLC_UE" init="20"/>
    <EnumValue name="TASK_PDCP_UE" init="21"/>
    <EnumValue name="TASK_RRC_UE" init="22"/>
    <EnumValue name="TASK_NAS_UE" init="23"/>
    <EnumValue name="TASK_RAL_UE" init="24"/>
    <EnumValue name="TASK_MSC" init="25"/>
    <EnumValue name="TASK_MAX" init="26"/>
    <EnumValue name="TASK_FIRST" init="1"/>
  </Enumeration>
  <Typedef id="_3355" name="task_id_t" type="_3354" context="_1" location="f284:102" file="f284" line="102"/>
  <Union id="_3356" name="msg_s" context="_1" location="f284:104" file="f284" line="104" members="_7500 _7501 _7502 _7503 _7504 _7505 _7506 _7507 _7508 _7509 _7510 _7511 _7512 _7513 _7514 _7515 _7516 _7517 _7518 _7519 _7520 _7521 _7522 _7523 _7524 _7525 _7526 _7527 _7528 _7529 _7530 _7531 _7532 _7533 _7534 _7535 _7536 _7537 _7538 _7539 _7540 _7541 _7542 _7543 _7544 _7545 _7546 _7547 _7548 _7549 _7550 _7551 _7552 _7553 _7554 _7555 _7556 _7557 _7558 _7559 _7560 _7561 _7562 _7563 _7564 _7565 _7566 _7567 _7568 _7569 _7570 _7571 _7572 _7573 _7574 _7575 _7576 _7577 _7578 _7579 _7580 _7581 _7582 _7583 _7584 _7585 _7586 _7587 _7588 _7589 _7590 _7591 _7592 _7593 _7594 _7595 _7596 _7597 _7598 _7599 _7600 _7601 _7602 _7603 _7604 _7605 _7606 _7607 _7608 _7609 _7610 _7611 _7612 _7613 _7614 _7615 _7616 _7617 _7618 _7619 _7620 _7621 _7622 _7623 _7624 _7625 _7626 _7627 _7628 _7629 _7630 _7631 _7632 _7633 _7634 _7635 _7636 _7637" size="16768" align="64"/>
  <Typedef id="_3357" name="msg_t" type="_3356" context="_1" location="f284:108" file="f284" line="108"/>
  <Typedef id="_3358" name="MessageHeaderSize" type="_10" context="_1" location="f284:110" file="f284" line="110"/>
  <Struct id="_3359" name="itti_lte_time_s" context="_1" location="f284:112" file="f284" line="112" members="_7638 _7639" size="64" align="32"/>
  <Typedef id="_3360" name="itti_lte_time_t" type="_3359" context="_1" location="f284:115" file="f284" line="115"/>
  <Struct id="_3361" name="MessageHeader_s" context="_1" location="f284:120" file="f284" line="120" members="_7640 _7641 _7642 _7643 _7644 _7645" size="192" align="32"/>
  <Typedef id="_3362" name="MessageHeader" type="_3361" context="_1" location="f284:130" file="f284" line="130"/>
  <Struct id="_3363" name="MessageDef_s" context="_1" location="f284:137" file="f284" line="137" members="_7646 _7647" size="16960" align="8"/>
  <Typedef id="_3364" name="MessageDef" type="_3363" context="_1" location="f284:140" file="f284" line="140"/>
  <FundamentalType id="_3365" name="__int128" size="128" align="128"/>
  <FundamentalType id="_3366" name="unsigned __int128" size="128" align="128"/>
  <ArrayType id="_3367" min="0" max="0" type="_7648"/>
  <FundamentalType id="_3368" name="signed char" size="8" align="8"/>
  <FundamentalType id="_3369" name="short int" size="16" align="16"/>
  <FundamentalType id="_3370" name="int" size="32" align="32"/>
  <CvQualifiedType id="_3370v" type="_3370" volatile="1"/>
  <FundamentalType id="_3371" name="long int" size="64" align="64"/>
  <FundamentalType id="_3372" name="unsigned char" size="8" align="8"/>
  <FundamentalType id="_3373" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_3374" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_3375" name="long unsigned int" size="64" align="64"/>
  <Field id="_3376" name="message_size" type="_11" context="_35" access="public" location="f2:69" file="f2" line="69" offset="0"/>
  <Field id="_3377" name="message_type" type="_34" context="_35" access="public" location="f2:70" file="f2" line="70" offset="32"/>
  <Field id="_3378" name="message_number_char" type="_7649" context="_37" access="public" location="f2:74" file="f2" line="74" offset="0"/>
  <Field id="_3379" name="module_id" type="_44" context="_95" access="public" location="f3:222" file="f3" line="222" offset="0"/>
  <Field id="_3380" name="enb_flag" type="_52" context="_95" access="public" location="f3:223" file="f3" line="223" offset="8"/>
  <Field id="_3381" name="instance" type="_94" context="_95" access="public" location="f3:224" file="f3" line="224" offset="16"/>
  <Field id="_3382" name="rnti" type="_86" context="_95" access="public" location="f3:225" file="f3" line="225" offset="32"/>
  <Field id="_3383" name="frame" type="_41" context="_95" access="public" location="f3:226" file="f3" line="226" offset="64"/>
  <Field id="_3384" name="subframe" type="_43" context="_95" access="public" location="f3:227" file="f3" line="227" offset="96"/>
  <Field id="_3385" name="eNB_index" type="_46" context="_95" access="public" location="f3:228" file="f3" line="228" offset="128"/>
  <Field id="_3386" name="configured" type="_39" context="_95" access="public" location="f3:229" file="f3" line="229" offset="136"/>
  <Field id="_3387" name="size" type="_11" context="_99" access="public" location="f4:36" file="f4" line="36" offset="0"/>
  <Field id="_3388" name="text" type="_7650" context="_99" access="public" location="f4:37" file="f4" line="37" offset="32"/>
  <Field id="_3389" name="arg" type="_5091" context="_101" access="public" location="f5:31" file="f5" line="31" offset="0"/>
  <Field id="_3390" name="timer_id" type="_3371" context="_101" access="public" location="f5:32" file="f5" line="32" offset="64"/>
  <Field id="_3391" name="phy_id" type="_10" context="_106" access="public" location="f7:89" file="f7" line="89" offset="0"/>
  <Field id="_3392" name="message_id" type="_10" context="_106" access="public" location="f7:90" file="f7" line="90" offset="16"/>
  <Field id="_3393" name="message_length" type="_10" context="_106" access="public" location="f7:91" file="f7" line="91" offset="32"/>
  <Field id="_3394" name="spare" type="_10" context="_106" access="public" location="f7:92" file="f7" line="92" offset="48"/>
  <Field id="_3395" name="phy_id" type="_10" context="_108" access="public" location="f7:96" file="f7" line="96" offset="0"/>
  <Field id="_3396" name="message_id" type="_10" context="_108" access="public" location="f7:97" file="f7" line="97" offset="16"/>
  <Field id="_3397" name="message_length" type="_10" context="_108" access="public" location="f7:98" file="f7" line="98" offset="32"/>
  <Field id="_3398" name="m_segment_sequence" type="_10" context="_108" access="public" location="f7:99" file="f7" line="99" offset="48"/>
  <Field id="_3399" name="checksum" type="_11" context="_108" access="public" location="f7:100" file="f7" line="100" offset="64"/>
  <Field id="_3400" name="transmit_timestamp" type="_11" context="_108" access="public" location="f7:101" file="f7" line="101" offset="96"/>
  <Field id="_3401" name="tag" type="_10" context="_110" access="public" location="f7:114" file="f7" line="114" offset="0"/>
  <Field id="_3402" name="length" type="_10" context="_110" access="public" location="f7:115" file="f7" line="115" offset="16"/>
  <PointerType id="_3403" type="_111"/>
  <Field id="_3404" name="tl" type="_111" context="_151" access="public" location="f7:385" file="f7" line="385" offset="0"/>
  <Field id="_3405" name="length" type="_11" context="_151" access="public" location="f7:386" file="f7" line="386" offset="32"/>
  <Field id="_3406" name="value" type="_7651" context="_151" access="public" location="f7:387" file="f7" line="387" offset="64"/>
  <PointerType id="_3407" type="_7652c"/>
  <CvQualifiedType id="_3407r" type="_3407" restrict="1"/>
  <CvQualifiedType id="_3407c" type="_3407" const="1"/>
  <Field id="_3408" name="tl" type="_111" context="_154" access="public" location="f7:396" file="f7" line="396" offset="0"/>
  <Field id="_3409" name="nfapi_sync_mode" type="_9" context="_154" access="public" location="f7:397" file="f7" line="397" offset="32"/>
  <Field id="_3410" name="location_mode" type="_9" context="_154" access="public" location="f7:398" file="f7" line="398" offset="40"/>
  <Field id="_3411" name="location_coordinates_length" type="_10" context="_154" access="public" location="f7:399" file="f7" line="399" offset="48"/>
  <Field id="_3412" name="location_coordinates" type="_7653" context="_154" access="public" location="f7:400" file="f7" line="400" offset="64"/>
  <Field id="_3413" name="dl_config_timing" type="_11" context="_154" access="public" location="f7:401" file="f7" line="401" offset="192"/>
  <Field id="_3414" name="tx_timing" type="_11" context="_154" access="public" location="f7:402" file="f7" line="402" offset="224"/>
  <Field id="_3415" name="ul_config_timing" type="_11" context="_154" access="public" location="f7:403" file="f7" line="403" offset="256"/>
  <Field id="_3416" name="hi_dci0_timing" type="_11" context="_154" access="public" location="f7:404" file="f7" line="404" offset="288"/>
  <Field id="_3417" name="maximum_number_phys" type="_10" context="_154" access="public" location="f7:405" file="f7" line="405" offset="320"/>
  <Field id="_3418" name="maximum_total_bandwidth" type="_10" context="_154" access="public" location="f7:406" file="f7" line="406" offset="336"/>
  <Field id="_3419" name="maximum_total_number_dl_layers" type="_9" context="_154" access="public" location="f7:407" file="f7" line="407" offset="352"/>
  <Field id="_3420" name="maximum_total_number_ul_layers" type="_9" context="_154" access="public" location="f7:408" file="f7" line="408" offset="360"/>
  <Field id="_3421" name="shared_bands" type="_9" context="_154" access="public" location="f7:409" file="f7" line="409" offset="368"/>
  <Field id="_3422" name="shared_pa" type="_9" context="_154" access="public" location="f7:410" file="f7" line="410" offset="376"/>
  <Field id="_3423" name="maximum_total_power" type="_6" context="_154" access="public" location="f7:411" file="f7" line="411" offset="384"/>
  <Field id="_3424" name="oui" type="_7654" context="_154" access="public" location="f7:412" file="f7" line="412" offset="400"/>
  <Field id="_3425" name="rf_config_index" type="_10" context="_156" access="public" location="f7:421" file="f7" line="421" offset="0"/>
  <Field id="_3426" name="phy_config_index" type="_10" context="_158" access="public" location="f7:425" file="f7" line="425" offset="0"/>
  <Field id="_3427" name="number_of_rfs" type="_10" context="_158" access="public" location="f7:426" file="f7" line="426" offset="16"/>
  <Field id="_3428" name="rf_config" type="_7655" context="_158" access="public" location="f7:427" file="f7" line="427" offset="32"/>
  <Field id="_3429" name="number_of_rf_exclusions" type="_10" context="_158" access="public" location="f7:428" file="f7" line="428" offset="112"/>
  <Field id="_3430" name="excluded_rf_config" type="_7655" context="_158" access="public" location="f7:429" file="f7" line="429" offset="128"/>
  <Field id="_3431" name="downlink_channel_bandwidth_supported" type="_10" context="_158" access="public" location="f7:430" file="f7" line="430" offset="208"/>
  <Field id="_3432" name="uplink_channel_bandwidth_supported" type="_10" context="_158" access="public" location="f7:431" file="f7" line="431" offset="224"/>
  <Field id="_3433" name="number_of_dl_layers_supported" type="_9" context="_158" access="public" location="f7:432" file="f7" line="432" offset="240"/>
  <Field id="_3434" name="number_of_ul_layers_supported" type="_9" context="_158" access="public" location="f7:433" file="f7" line="433" offset="248"/>
  <Field id="_3435" name="maximum_3gpp_release_supported" type="_10" context="_158" access="public" location="f7:434" file="f7" line="434" offset="256"/>
  <Field id="_3436" name="nmm_modes_supported" type="_9" context="_158" access="public" location="f7:435" file="f7" line="435" offset="272"/>
  <Field id="_3437" name="tl" type="_111" context="_160" access="public" location="f7:440" file="f7" line="440" offset="0"/>
  <Field id="_3438" name="number_of_phys" type="_10" context="_160" access="public" location="f7:441" file="f7" line="441" offset="32"/>
  <Field id="_3439" name="phy" type="_7656" context="_160" access="public" location="f7:442" file="f7" line="442" offset="48"/>
  <Field id="_3440" name="phy_config_index" type="_10" context="_162" access="public" location="f7:447" file="f7" line="447" offset="0"/>
  <Field id="_3441" name="transmission_mode_7_supported" type="_10" context="_162" access="public" location="f7:448" file="f7" line="448" offset="16"/>
  <Field id="_3442" name="transmission_mode_8_supported" type="_10" context="_162" access="public" location="f7:449" file="f7" line="449" offset="32"/>
  <Field id="_3443" name="two_antenna_ports_for_pucch" type="_10" context="_162" access="public" location="f7:450" file="f7" line="450" offset="48"/>
  <Field id="_3444" name="transmission_mode_9_supported" type="_10" context="_162" access="public" location="f7:451" file="f7" line="451" offset="64"/>
  <Field id="_3445" name="simultaneous_pucch_pusch" type="_10" context="_162" access="public" location="f7:452" file="f7" line="452" offset="80"/>
  <Field id="_3446" name="four_layer_tx_with_tm3_and_tm4" type="_10" context="_162" access="public" location="f7:453" file="f7" line="453" offset="96"/>
  <Field id="_3447" name="tl" type="_111" context="_164" access="public" location="f7:457" file="f7" line="457" offset="0"/>
  <Field id="_3448" name="number_of_phys" type="_10" context="_164" access="public" location="f7:458" file="f7" line="458" offset="32"/>
  <Field id="_3449" name="phy" type="_7657" context="_164" access="public" location="f7:459" file="f7" line="459" offset="48"/>
  <Field id="_3450" name="phy_config_index" type="_10" context="_166" access="public" location="f7:464" file="f7" line="464" offset="0"/>
  <Field id="_3451" name="edpcch_supported" type="_10" context="_166" access="public" location="f7:465" file="f7" line="465" offset="16"/>
  <Field id="_3452" name="multi_ack_csi_reporting" type="_10" context="_166" access="public" location="f7:466" file="f7" line="466" offset="32"/>
  <Field id="_3453" name="pucch_tx_diversity" type="_10" context="_166" access="public" location="f7:467" file="f7" line="467" offset="48"/>
  <Field id="_3454" name="ul_comp_supported" type="_10" context="_166" access="public" location="f7:468" file="f7" line="468" offset="64"/>
  <Field id="_3455" name="transmission_mode_5_supported" type="_10" context="_166" access="public" location="f7:469" file="f7" line="469" offset="80"/>
  <Field id="_3456" name="tl" type="_111" context="_168" access="public" location="f7:473" file="f7" line="473" offset="0"/>
  <Field id="_3457" name="number_of_phys" type="_10" context="_168" access="public" location="f7:474" file="f7" line="474" offset="32"/>
  <Field id="_3458" name="phy" type="_7658" context="_168" access="public" location="f7:475" file="f7" line="475" offset="48"/>
  <Field id="_3459" name="phy_config_index" type="_10" context="_170" access="public" location="f7:481" file="f7" line="481" offset="0"/>
  <Field id="_3460" name="csi_subframe_set" type="_10" context="_170" access="public" location="f7:482" file="f7" line="482" offset="16"/>
  <Field id="_3461" name="enhanced_4tx_codebook" type="_10" context="_170" access="public" location="f7:483" file="f7" line="483" offset="32"/>
  <Field id="_3462" name="drs_supported" type="_10" context="_170" access="public" location="f7:484" file="f7" line="484" offset="48"/>
  <Field id="_3463" name="ul_64qam_supported" type="_10" context="_170" access="public" location="f7:485" file="f7" line="485" offset="64"/>
  <Field id="_3464" name="transmission_mode_10_supported" type="_10" context="_170" access="public" location="f7:486" file="f7" line="486" offset="80"/>
  <Field id="_3465" name="alternative_bts_indices" type="_10" context="_170" access="public" location="f7:487" file="f7" line="487" offset="96"/>
  <Field id="_3466" name="tl" type="_111" context="_172" access="public" location="f7:491" file="f7" line="491" offset="0"/>
  <Field id="_3467" name="number_of_phys" type="_10" context="_172" access="public" location="f7:492" file="f7" line="492" offset="32"/>
  <Field id="_3468" name="phy" type="_7659" context="_172" access="public" location="f7:493" file="f7" line="493" offset="48"/>
  <Field id="_3469" name="phy_config_index" type="_10" context="_174" access="public" location="f7:498" file="f7" line="498" offset="0"/>
  <Field id="_3470" name="pucch_format4_supported" type="_10" context="_174" access="public" location="f7:499" file="f7" line="499" offset="16"/>
  <Field id="_3471" name="pucch_format5_supported" type="_10" context="_174" access="public" location="f7:500" file="f7" line="500" offset="32"/>
  <Field id="_3472" name="more_than_5_ca_support" type="_10" context="_174" access="public" location="f7:501" file="f7" line="501" offset="48"/>
  <Field id="_3473" name="laa_supported" type="_10" context="_174" access="public" location="f7:502" file="f7" line="502" offset="64"/>
  <Field id="_3474" name="laa_ending_in_dwpts_supported" type="_10" context="_174" access="public" location="f7:503" file="f7" line="503" offset="80"/>
  <Field id="_3475" name="laa_starting_in_second_slot_supported" type="_10" context="_174" access="public" location="f7:504" file="f7" line="504" offset="96"/>
  <Field id="_3476" name="beamforming_supported" type="_10" context="_174" access="public" location="f7:505" file="f7" line="505" offset="112"/>
  <Field id="_3477" name="csi_rs_enhancement_supported" type="_10" context="_174" access="public" location="f7:506" file="f7" line="506" offset="128"/>
  <Field id="_3478" name="drms_enhancement_supported" type="_10" context="_174" access="public" location="f7:507" file="f7" line="507" offset="144"/>
  <Field id="_3479" name="srs_enhancement_supported" type="_10" context="_174" access="public" location="f7:508" file="f7" line="508" offset="160"/>
  <Field id="_3480" name="tl" type="_111" context="_176" access="public" location="f7:512" file="f7" line="512" offset="0"/>
  <Field id="_3481" name="number_of_phys" type="_10" context="_176" access="public" location="f7:513" file="f7" line="513" offset="32"/>
  <Field id="_3482" name="phy" type="_7660" context="_176" access="public" location="f7:514" file="f7" line="514" offset="48"/>
  <Field id="_3483" name="phy_config_index" type="_10" context="_178" access="public" location="f7:519" file="f7" line="519" offset="0"/>
  <Field id="_3484" name="number_of_rfs" type="_10" context="_178" access="public" location="f7:520" file="f7" line="520" offset="16"/>
  <Field id="_3485" name="rf_config" type="_7655" context="_178" access="public" location="f7:521" file="f7" line="521" offset="32"/>
  <Field id="_3486" name="number_of_rf_exclusions" type="_10" context="_178" access="public" location="f7:522" file="f7" line="522" offset="112"/>
  <Field id="_3487" name="excluded_rf_config" type="_7655" context="_178" access="public" location="f7:523" file="f7" line="523" offset="128"/>
  <Field id="_3488" name="number_of_dl_layers_supported" type="_9" context="_178" access="public" location="f7:524" file="f7" line="524" offset="208"/>
  <Field id="_3489" name="number_of_ul_layers_supported" type="_9" context="_178" access="public" location="f7:525" file="f7" line="525" offset="216"/>
  <Field id="_3490" name="maximum_3gpp_release_supported" type="_10" context="_178" access="public" location="f7:526" file="f7" line="526" offset="224"/>
  <Field id="_3491" name="nmm_modes_supported" type="_9" context="_178" access="public" location="f7:527" file="f7" line="527" offset="240"/>
  <Field id="_3492" name="tl" type="_111" context="_180" access="public" location="f7:531" file="f7" line="531" offset="0"/>
  <Field id="_3493" name="number_of_phys" type="_10" context="_180" access="public" location="f7:532" file="f7" line="532" offset="32"/>
  <Field id="_3494" name="phy" type="_7661" context="_180" access="public" location="f7:533" file="f7" line="533" offset="48"/>
  <Field id="_3495" name="rf_config_index" type="_10" context="_182" access="public" location="f7:540" file="f7" line="540" offset="0"/>
  <Field id="_3496" name="band" type="_10" context="_182" access="public" location="f7:541" file="f7" line="541" offset="16"/>
  <Field id="_3497" name="maximum_transmit_power" type="_6" context="_182" access="public" location="f7:542" file="f7" line="542" offset="32"/>
  <Field id="_3498" name="minimum_transmit_power" type="_6" context="_182" access="public" location="f7:543" file="f7" line="543" offset="48"/>
  <Field id="_3499" name="number_of_antennas_suppported" type="_9" context="_182" access="public" location="f7:544" file="f7" line="544" offset="64"/>
  <Field id="_3500" name="minimum_downlink_frequency" type="_11" context="_182" access="public" location="f7:545" file="f7" line="545" offset="96"/>
  <Field id="_3501" name="maximum_downlink_frequency" type="_11" context="_182" access="public" location="f7:546" file="f7" line="546" offset="128"/>
  <Field id="_3502" name="minimum_uplink_frequency" type="_11" context="_182" access="public" location="f7:547" file="f7" line="547" offset="160"/>
  <Field id="_3503" name="maximum_uplink_frequency" type="_11" context="_182" access="public" location="f7:548" file="f7" line="548" offset="192"/>
  <Field id="_3504" name="tl" type="_111" context="_184" access="public" location="f7:552" file="f7" line="552" offset="0"/>
  <Field id="_3505" name="number_of_rfs" type="_10" context="_184" access="public" location="f7:553" file="f7" line="553" offset="32"/>
  <Field id="_3506" name="rf" type="_7662" context="_184" access="public" location="f7:554" file="f7" line="554" offset="64"/>
  <Field id="_3507" name="phy_id" type="_10" context="_186" access="public" location="f7:559" file="f7" line="559" offset="0"/>
  <Field id="_3508" name="phy_config_index" type="_10" context="_186" access="public" location="f7:560" file="f7" line="560" offset="16"/>
  <Field id="_3509" name="rf_config_index" type="_10" context="_186" access="public" location="f7:561" file="f7" line="561" offset="32"/>
  <Field id="_3510" name="tl" type="_111" context="_188" access="public" location="f7:565" file="f7" line="565" offset="0"/>
  <Field id="_3511" name="number_phy_rf_config_info" type="_10" context="_188" access="public" location="f7:566" file="f7" line="566" offset="32"/>
  <Field id="_3512" name="phy_rf_config" type="_7663" context="_188" access="public" location="f7:567" file="f7" line="567" offset="48"/>
  <Field id="_3513" name="tl" type="_111" context="_190" access="public" location="f7:573" file="f7" line="573" offset="0"/>
  <Field id="_3514" name="value" type="_10" context="_190" access="public" location="f7:574" file="f7" line="574" offset="32"/>
  <Field id="_3515" name="tl" type="_111" context="_192" access="public" location="f7:578" file="f7" line="578" offset="0"/>
  <Field id="_3516" name="value" type="_6" context="_192" access="public" location="f7:579" file="f7" line="579" offset="32"/>
  <Field id="_3517" name="tl" type="_111" context="_194" access="public" location="f7:583" file="f7" line="583" offset="0"/>
  <Field id="_3518" name="value" type="_9" context="_194" access="public" location="f7:584" file="f7" line="584" offset="32"/>
  <Field id="_3519" name="phy_state" type="_191" context="_196" access="public" location="f7:588" file="f7" line="588" offset="0"/>
  <Field id="_3520" name="dl_bandwidth_support" type="_191" context="_198" access="public" location="f7:594" file="f7" line="594" offset="0"/>
  <Field id="_3521" name="ul_bandwidth_support" type="_191" context="_198" access="public" location="f7:595" file="f7" line="595" offset="48"/>
  <Field id="_3522" name="dl_modulation_support" type="_191" context="_198" access="public" location="f7:596" file="f7" line="596" offset="96"/>
  <Field id="_3523" name="ul_modulation_support" type="_191" context="_198" access="public" location="f7:597" file="f7" line="597" offset="144"/>
  <Field id="_3524" name="phy_antenna_capability" type="_191" context="_198" access="public" location="f7:598" file="f7" line="598" offset="192"/>
  <Field id="_3525" name="release_capability" type="_191" context="_198" access="public" location="f7:599" file="f7" line="599" offset="240"/>
  <Field id="_3526" name="mbsfn_capability" type="_191" context="_198" access="public" location="f7:600" file="f7" line="600" offset="288"/>
  <Field id="_3527" name="data_report_mode" type="_191" context="_200" access="public" location="f7:613" file="f7" line="613" offset="0"/>
  <Field id="_3528" name="sfnsf" type="_191" context="_200" access="public" location="f7:614" file="f7" line="614" offset="48"/>
  <Field id="_3529" name="duplex_mode" type="_191" context="_202" access="public" location="f7:622" file="f7" line="622" offset="0"/>
  <Field id="_3530" name="pcfich_power_offset" type="_191" context="_202" access="public" location="f7:623" file="f7" line="623" offset="48"/>
  <Field id="_3531" name="pb" type="_191" context="_202" access="public" location="f7:624" file="f7" line="624" offset="96"/>
  <Field id="_3532" name="dl_cyclic_prefix_type" type="_191" context="_202" access="public" location="f7:625" file="f7" line="625" offset="144"/>
  <Field id="_3533" name="ul_cyclic_prefix_type" type="_191" context="_202" access="public" location="f7:626" file="f7" line="626" offset="192"/>
  <Field id="_3534" name="dl_channel_bandwidth" type="_191" context="_204" access="public" location="f7:636" file="f7" line="636" offset="0"/>
  <Field id="_3535" name="ul_channel_bandwidth" type="_191" context="_204" access="public" location="f7:637" file="f7" line="637" offset="48"/>
  <Field id="_3536" name="reference_signal_power" type="_191" context="_204" access="public" location="f7:638" file="f7" line="638" offset="96"/>
  <Field id="_3537" name="tx_antenna_ports" type="_191" context="_204" access="public" location="f7:639" file="f7" line="639" offset="144"/>
  <Field id="_3538" name="rx_antenna_ports" type="_191" context="_204" access="public" location="f7:640" file="f7" line="640" offset="192"/>
  <Field id="_3539" name="phich_resource" type="_191" context="_206" access="public" location="f7:650" file="f7" line="650" offset="0"/>
  <Field id="_3540" name="phich_duration" type="_191" context="_206" access="public" location="f7:651" file="f7" line="651" offset="48"/>
  <Field id="_3541" name="phich_power_offset" type="_191" context="_206" access="public" location="f7:652" file="f7" line="652" offset="96"/>
  <Field id="_3542" name="primary_synchronization_signal_epre_eprers" type="_191" context="_208" access="public" location="f7:660" file="f7" line="660" offset="0"/>
  <Field id="_3543" name="secondary_synchronization_signal_epre_eprers" type="_191" context="_208" access="public" location="f7:661" file="f7" line="661" offset="48"/>
  <Field id="_3544" name="physical_cell_id" type="_191" context="_208" access="public" location="f7:662" file="f7" line="662" offset="96"/>
  <Field id="_3545" name="configuration_index" type="_191" context="_210" access="public" location="f7:670" file="f7" line="670" offset="0"/>
  <Field id="_3546" name="root_sequence_index" type="_191" context="_210" access="public" location="f7:671" file="f7" line="671" offset="48"/>
  <Field id="_3547" name="zero_correlation_zone_configuration" type="_191" context="_210" access="public" location="f7:672" file="f7" line="672" offset="96"/>
  <Field id="_3548" name="high_speed_flag" type="_191" context="_210" access="public" location="f7:673" file="f7" line="673" offset="144"/>
  <Field id="_3549" name="frequency_offset" type="_191" context="_210" access="public" location="f7:674" file="f7" line="674" offset="192"/>
  <Field id="_3550" name="hopping_mode" type="_191" context="_212" access="public" location="f7:684" file="f7" line="684" offset="0"/>
  <Field id="_3551" name="hopping_offset" type="_191" context="_212" access="public" location="f7:685" file="f7" line="685" offset="48"/>
  <Field id="_3552" name="number_of_subbands" type="_191" context="_212" access="public" location="f7:686" file="f7" line="686" offset="96"/>
  <Field id="_3553" name="delta_pucch_shift" type="_191" context="_214" access="public" location="f7:694" file="f7" line="694" offset="0"/>
  <Field id="_3554" name="n_cqi_rb" type="_191" context="_214" access="public" location="f7:695" file="f7" line="695" offset="48"/>
  <Field id="_3555" name="n_an_cs" type="_191" context="_214" access="public" location="f7:696" file="f7" line="696" offset="96"/>
  <Field id="_3556" name="n1_pucch_an" type="_191" context="_214" access="public" location="f7:697" file="f7" line="697" offset="144"/>
  <Field id="_3557" name="bandwidth_configuration" type="_191" context="_216" access="public" location="f7:706" file="f7" line="706" offset="0"/>
  <Field id="_3558" name="max_up_pts" type="_191" context="_216" access="public" location="f7:707" file="f7" line="707" offset="48"/>
  <Field id="_3559" name="srs_subframe_configuration" type="_191" context="_216" access="public" location="f7:708" file="f7" line="708" offset="96"/>
  <Field id="_3560" name="srs_acknack_srs_simultaneous_transmission" type="_191" context="_216" access="public" location="f7:709" file="f7" line="709" offset="144"/>
  <Field id="_3561" name="uplink_rs_hopping" type="_191" context="_218" access="public" location="f7:718" file="f7" line="718" offset="0"/>
  <Field id="_3562" name="group_assignment" type="_191" context="_218" access="public" location="f7:719" file="f7" line="719" offset="48"/>
  <Field id="_3563" name="cyclic_shift_1_for_drms" type="_191" context="_218" access="public" location="f7:720" file="f7" line="720" offset="96"/>
  <Field id="_3564" name="ed_threshold_lbt_pdsch" type="_191" context="_220" access="public" location="f7:729" file="f7" line="729" offset="0"/>
  <Field id="_3565" name="ed_threshold_lbt_drs" type="_191" context="_220" access="public" location="f7:730" file="f7" line="730" offset="48"/>
  <Field id="_3566" name="pd_threshold" type="_191" context="_220" access="public" location="f7:731" file="f7" line="731" offset="96"/>
  <Field id="_3567" name="multi_carrier_type" type="_191" context="_220" access="public" location="f7:732" file="f7" line="732" offset="144"/>
  <Field id="_3568" name="multi_carrier_tx" type="_191" context="_220" access="public" location="f7:733" file="f7" line="733" offset="192"/>
  <Field id="_3569" name="multi_carrier_freeze" type="_191" context="_220" access="public" location="f7:734" file="f7" line="734" offset="240"/>
  <Field id="_3570" name="tx_antenna_ports_drs" type="_191" context="_220" access="public" location="f7:735" file="f7" line="735" offset="288"/>
  <Field id="_3571" name="tx_power_drs" type="_191" context="_220" access="public" location="f7:736" file="f7" line="736" offset="336"/>
  <Field id="_3572" name="pbch_repetitions_enable_r13" type="_191" context="_222" access="public" location="f7:750" file="f7" line="750" offset="0"/>
  <Field id="_3573" name="prach_catm_root_sequence_index" type="_191" context="_222" access="public" location="f7:751" file="f7" line="751" offset="48"/>
  <Field id="_3574" name="prach_catm_zero_correlation_zone_configuration" type="_191" context="_222" access="public" location="f7:752" file="f7" line="752" offset="96"/>
  <Field id="_3575" name="prach_catm_high_speed_flag" type="_191" context="_222" access="public" location="f7:753" file="f7" line="753" offset="144"/>
  <Field id="_3576" name="prach_ce_level_0_enable" type="_191" context="_222" access="public" location="f7:754" file="f7" line="754" offset="192"/>
  <Field id="_3577" name="prach_ce_level_0_configuration_index" type="_191" context="_222" access="public" location="f7:755" file="f7" line="755" offset="240"/>
  <Field id="_3578" name="prach_ce_level_0_frequency_offset" type="_191" context="_222" access="public" location="f7:756" file="f7" line="756" offset="288"/>
  <Field id="_3579" name="prach_ce_level_0_number_of_repetitions_per_attempt" type="_191" context="_222" access="public" location="f7:757" file="f7" line="757" offset="336"/>
  <Field id="_3580" name="prach_ce_level_0_starting_subframe_periodicity" type="_191" context="_222" access="public" location="f7:758" file="f7" line="758" offset="384"/>
  <Field id="_3581" name="prach_ce_level_0_hopping_enable" type="_191" context="_222" access="public" location="f7:759" file="f7" line="759" offset="432"/>
  <Field id="_3582" name="prach_ce_level_0_hopping_offset" type="_191" context="_222" access="public" location="f7:760" file="f7" line="760" offset="480"/>
  <Field id="_3583" name="prach_ce_level_1_enable" type="_191" context="_222" access="public" location="f7:761" file="f7" line="761" offset="528"/>
  <Field id="_3584" name="prach_ce_level_1_configuration_index" type="_191" context="_222" access="public" location="f7:762" file="f7" line="762" offset="576"/>
  <Field id="_3585" name="prach_ce_level_1_frequency_offset" type="_191" context="_222" access="public" location="f7:763" file="f7" line="763" offset="624"/>
  <Field id="_3586" name="prach_ce_level_1_number_of_repetitions_per_attempt" type="_191" context="_222" access="public" location="f7:764" file="f7" line="764" offset="672"/>
  <Field id="_3587" name="prach_ce_level_1_starting_subframe_periodicity" type="_191" context="_222" access="public" location="f7:765" file="f7" line="765" offset="720"/>
  <Field id="_3588" name="prach_ce_level_1_hopping_enable" type="_191" context="_222" access="public" location="f7:766" file="f7" line="766" offset="768"/>
  <Field id="_3589" name="prach_ce_level_1_hopping_offset" type="_191" context="_222" access="public" location="f7:767" file="f7" line="767" offset="816"/>
  <Field id="_3590" name="prach_ce_level_2_enable" type="_191" context="_222" access="public" location="f7:768" file="f7" line="768" offset="864"/>
  <Field id="_3591" name="prach_ce_level_2_configuration_index" type="_191" context="_222" access="public" location="f7:769" file="f7" line="769" offset="912"/>
  <Field id="_3592" name="prach_ce_level_2_frequency_offset" type="_191" context="_222" access="public" location="f7:770" file="f7" line="770" offset="960"/>
  <Field id="_3593" name="prach_ce_level_2_number_of_repetitions_per_attempt" type="_191" context="_222" access="public" location="f7:771" file="f7" line="771" offset="1008"/>
  <Field id="_3594" name="prach_ce_level_2_starting_subframe_periodicity" type="_191" context="_222" access="public" location="f7:772" file="f7" line="772" offset="1056"/>
  <Field id="_3595" name="prach_ce_level_2_hopping_enable" type="_191" context="_222" access="public" location="f7:773" file="f7" line="773" offset="1104"/>
  <Field id="_3596" name="prach_ce_level_2_hopping_offset" type="_191" context="_222" access="public" location="f7:774" file="f7" line="774" offset="1152"/>
  <Field id="_3597" name="prach_ce_level_3_enable" type="_191" context="_222" access="public" location="f7:775" file="f7" line="775" offset="1200"/>
  <Field id="_3598" name="prach_ce_level_3_configuration_index" type="_191" context="_222" access="public" location="f7:776" file="f7" line="776" offset="1248"/>
  <Field id="_3599" name="prach_ce_level_3_frequency_offset" type="_191" context="_222" access="public" location="f7:777" file="f7" line="777" offset="1296"/>
  <Field id="_3600" name="prach_ce_level_3_number_of_repetitions_per_attempt" type="_191" context="_222" access="public" location="f7:778" file="f7" line="778" offset="1344"/>
  <Field id="_3601" name="prach_ce_level_3_starting_subframe_periodicity" type="_191" context="_222" access="public" location="f7:779" file="f7" line="779" offset="1392"/>
  <Field id="_3602" name="prach_ce_level_3_hopping_enable" type="_191" context="_222" access="public" location="f7:780" file="f7" line="780" offset="1440"/>
  <Field id="_3603" name="prach_ce_level_3_hopping_offset" type="_191" context="_222" access="public" location="f7:781" file="f7" line="781" offset="1488"/>
  <Field id="_3604" name="pucch_interval_ulhoppingconfigcommonmodea" type="_191" context="_222" access="public" location="f7:782" file="f7" line="782" offset="1536"/>
  <Field id="_3605" name="pucch_interval_ulhoppingconfigcommonmodeb" type="_191" context="_222" access="public" location="f7:783" file="f7" line="783" offset="1584"/>
  <Field id="_3606" name="operating_mode" type="_191" context="_224" access="public" location="f7:822" file="f7" line="822" offset="0"/>
  <Field id="_3607" name="anchor" type="_191" context="_224" access="public" location="f7:823" file="f7" line="823" offset="48"/>
  <Field id="_3608" name="prb_index" type="_191" context="_224" access="public" location="f7:824" file="f7" line="824" offset="96"/>
  <Field id="_3609" name="control_region_size" type="_191" context="_224" access="public" location="f7:825" file="f7" line="825" offset="144"/>
  <Field id="_3610" name="assumed_crs_aps" type="_191" context="_224" access="public" location="f7:826" file="f7" line="826" offset="192"/>
  <Field id="_3611" name="nprach_config_0_enabled" type="_191" context="_224" access="public" location="f7:827" file="f7" line="827" offset="240"/>
  <Field id="_3612" name="nprach_config_0_sf_periodicity" type="_191" context="_224" access="public" location="f7:828" file="f7" line="828" offset="288"/>
  <Field id="_3613" name="nprach_config_0_start_time" type="_191" context="_224" access="public" location="f7:829" file="f7" line="829" offset="336"/>
  <Field id="_3614" name="nprach_config_0_subcarrier_offset" type="_191" context="_224" access="public" location="f7:830" file="f7" line="830" offset="384"/>
  <Field id="_3615" name="nprach_config_0_number_of_subcarriers" type="_191" context="_224" access="public" location="f7:831" file="f7" line="831" offset="432"/>
  <Field id="_3616" name="nprach_config_0_cp_length" type="_191" context="_224" access="public" location="f7:832" file="f7" line="832" offset="480"/>
  <Field id="_3617" name="nprach_config_0_number_of_repetitions_per_attempt" type="_191" context="_224" access="public" location="f7:833" file="f7" line="833" offset="528"/>
  <Field id="_3618" name="nprach_config_1_enabled" type="_191" context="_224" access="public" location="f7:834" file="f7" line="834" offset="576"/>
  <Field id="_3619" name="nprach_config_1_sf_periodicity" type="_191" context="_224" access="public" location="f7:835" file="f7" line="835" offset="624"/>
  <Field id="_3620" name="nprach_config_1_start_time" type="_191" context="_224" access="public" location="f7:836" file="f7" line="836" offset="672"/>
  <Field id="_3621" name="nprach_config_1_subcarrier_offset" type="_191" context="_224" access="public" location="f7:837" file="f7" line="837" offset="720"/>
  <Field id="_3622" name="nprach_config_1_number_of_subcarriers" type="_191" context="_224" access="public" location="f7:838" file="f7" line="838" offset="768"/>
  <Field id="_3623" name="nprach_config_1_cp_length" type="_191" context="_224" access="public" location="f7:839" file="f7" line="839" offset="816"/>
  <Field id="_3624" name="nprach_config_1_number_of_repetitions_per_attempt" type="_191" context="_224" access="public" location="f7:840" file="f7" line="840" offset="864"/>
  <Field id="_3625" name="nprach_config_2_enabled" type="_191" context="_224" access="public" location="f7:841" file="f7" line="841" offset="912"/>
  <Field id="_3626" name="nprach_config_2_sf_periodicity" type="_191" context="_224" access="public" location="f7:842" file="f7" line="842" offset="960"/>
  <Field id="_3627" name="nprach_config_2_start_time" type="_191" context="_224" access="public" location="f7:843" file="f7" line="843" offset="1008"/>
  <Field id="_3628" name="nprach_config_2_subcarrier_offset" type="_191" context="_224" access="public" location="f7:844" file="f7" line="844" offset="1056"/>
  <Field id="_3629" name="nprach_config_2_number_of_subcarriers" type="_191" context="_224" access="public" location="f7:845" file="f7" line="845" offset="1104"/>
  <Field id="_3630" name="nprach_config_2_cp_length" type="_191" context="_224" access="public" location="f7:846" file="f7" line="846" offset="1152"/>
  <Field id="_3631" name="nprach_config_2_number_of_repetitions_per_attempt" type="_191" context="_224" access="public" location="f7:847" file="f7" line="847" offset="1200"/>
  <Field id="_3632" name="three_tone_base_sequence" type="_191" context="_224" access="public" location="f7:848" file="f7" line="848" offset="1248"/>
  <Field id="_3633" name="six_tone_base_sequence" type="_191" context="_224" access="public" location="f7:849" file="f7" line="849" offset="1296"/>
  <Field id="_3634" name="twelve_tone_base_sequence" type="_191" context="_224" access="public" location="f7:850" file="f7" line="850" offset="1344"/>
  <Field id="_3635" name="three_tone_cyclic_shift" type="_191" context="_224" access="public" location="f7:851" file="f7" line="851" offset="1392"/>
  <Field id="_3636" name="six_tone_cyclic_shift" type="_191" context="_224" access="public" location="f7:852" file="f7" line="852" offset="1440"/>
  <Field id="_3637" name="dl_gap_config_enable" type="_191" context="_224" access="public" location="f7:853" file="f7" line="853" offset="1488"/>
  <Field id="_3638" name="dl_gap_threshold" type="_191" context="_224" access="public" location="f7:854" file="f7" line="854" offset="1536"/>
  <Field id="_3639" name="dl_gap_periodicity" type="_191" context="_224" access="public" location="f7:855" file="f7" line="855" offset="1584"/>
  <Field id="_3640" name="dl_gap_duration_coefficient" type="_191" context="_224" access="public" location="f7:856" file="f7" line="856" offset="1632"/>
  <Field id="_3641" name="laa_support" type="_191" context="_226" access="public" location="f7:896" file="f7" line="896" offset="0"/>
  <Field id="_3642" name="pd_sensing_lbt_support" type="_191" context="_226" access="public" location="f7:897" file="f7" line="897" offset="48"/>
  <Field id="_3643" name="multi_carrier_lbt_support" type="_191" context="_226" access="public" location="f7:898" file="f7" line="898" offset="96"/>
  <Field id="_3644" name="partial_sf_support" type="_191" context="_226" access="public" location="f7:899" file="f7" line="899" offset="144"/>
  <Field id="_3645" name="nb_iot_support" type="_191" context="_228" access="public" location="f7:908" file="f7" line="908" offset="0"/>
  <Field id="_3646" name="nb_iot_operating_mode_capability" type="_191" context="_228" access="public" location="f7:909" file="f7" line="909" offset="48"/>
  <Field id="_3647" name="subframe_assignment" type="_191" context="_230" access="public" location="f7:916" file="f7" line="916" offset="0"/>
  <Field id="_3648" name="special_subframe_patterns" type="_191" context="_230" access="public" location="f7:917" file="f7" line="917" offset="48"/>
  <Field id="_3649" name="tl" type="_111" context="_232" access="public" location="f7:924" file="f7" line="924" offset="0"/>
  <Field id="_3650" name="number_rf_bands" type="_10" context="_232" access="public" location="f7:925" file="f7" line="925" offset="32"/>
  <Field id="_3651" name="rf_band" type="_7664" context="_232" access="public" location="f7:926" file="f7" line="926" offset="48"/>
  <Field id="_3652" name="tl" type="_111" context="_236" access="public" location="f7:942" file="f7" line="942" offset="0"/>
  <Field id="_3653" name="type" type="_9" context="_236" access="public" location="f7:943" file="f7" line="943" offset="32"/>
  <Union id="_3654" name="" context="_236" access="public" location="f7:944" file="f7" line="944" members="_7665 _7666" size="128" align="8"/>
  <Field id="_3655" name="u" type="_3654" context="_236" access="public" location="f7:947" file="f7" line="947" offset="40"/>
  <Field id="_3656" name="tl" type="_111" context="_238" access="public" location="f7:951" file="f7" line="951" offset="0"/>
  <Field id="_3657" name="address" type="_7667" context="_238" access="public" location="f7:952" file="f7" line="952" offset="32"/>
  <Field id="_3658" name="tl" type="_111" context="_240" access="public" location="f7:956" file="f7" line="956" offset="0"/>
  <Field id="_3659" name="address" type="_7653" context="_240" access="public" location="f7:957" file="f7" line="957" offset="32"/>
  <Field id="_3660" name="tl" type="_111" context="_242" access="public" location="f7:963" file="f7" line="963" offset="0"/>
  <Field id="_3661" name="number_of_rf_bands" type="_10" context="_242" access="public" location="f7:964" file="f7" line="964" offset="32"/>
  <Field id="_3662" name="bands" type="_7668" context="_242" access="public" location="f7:965" file="f7" line="965" offset="48"/>
  <Field id="_3663" name="p7_vnf_address_ipv4" type="_239" context="_244" access="public" location="f7:972" file="f7" line="972" offset="0"/>
  <Field id="_3664" name="p7_vnf_address_ipv6" type="_241" context="_244" access="public" location="f7:973" file="f7" line="973" offset="64"/>
  <Field id="_3665" name="p7_vnf_port" type="_191" context="_244" access="public" location="f7:974" file="f7" line="974" offset="224"/>
  <Field id="_3666" name="p7_pnf_address_ipv4" type="_239" context="_244" access="public" location="f7:976" file="f7" line="976" offset="272"/>
  <Field id="_3667" name="p7_pnf_address_ipv6" type="_241" context="_244" access="public" location="f7:977" file="f7" line="977" offset="336"/>
  <Field id="_3668" name="p7_pnf_port" type="_191" context="_244" access="public" location="f7:978" file="f7" line="978" offset="496"/>
  <Field id="_3669" name="dl_ue_per_sf" type="_195" context="_244" access="public" location="f7:981" file="f7" line="981" offset="544"/>
  <Field id="_3670" name="ul_ue_per_sf" type="_195" context="_244" access="public" location="f7:982" file="f7" line="982" offset="592"/>
  <Field id="_3671" name="rf_bands" type="_233" context="_244" access="public" location="f7:985" file="f7" line="985" offset="640"/>
  <Field id="_3672" name="timing_window" type="_195" context="_244" access="public" location="f7:988" file="f7" line="988" offset="944"/>
  <Field id="_3673" name="timing_info_mode" type="_195" context="_244" access="public" location="f7:989" file="f7" line="989" offset="992"/>
  <Field id="_3674" name="timing_info_period" type="_195" context="_244" access="public" location="f7:990" file="f7" line="990" offset="1040"/>
  <Field id="_3675" name="max_transmit_power" type="_191" context="_244" access="public" location="f7:993" file="f7" line="993" offset="1088"/>
  <Field id="_3676" name="earfcn" type="_191" context="_244" access="public" location="f7:994" file="f7" line="994" offset="1136"/>
  <Field id="_3677" name="nmm_gsm_frequency_bands" type="_243" context="_244" access="public" location="f7:996" file="f7" line="996" offset="1184"/>
  <Field id="_3678" name="nmm_umts_frequency_bands" type="_243" context="_244" access="public" location="f7:997" file="f7" line="997" offset="1744"/>
  <Field id="_3679" name="nmm_lte_frequency_bands" type="_243" context="_244" access="public" location="f7:998" file="f7" line="998" offset="2304"/>
  <Field id="_3680" name="nmm_uplink_rssi_supported" type="_195" context="_244" access="public" location="f7:999" file="f7" line="999" offset="2864"/>
  <Field id="_3681" name="header" type="_107" context="_246" access="public" location="f7:1026" file="f7" line="1026" offset="0"/>
  <Field id="_3682" name="vendor_extension" type="_112" context="_246" access="public" location="f7:1027" file="f7" line="1027" offset="64"/>
  <Field id="_3683" name="header" type="_107" context="_248" access="public" location="f7:1031" file="f7" line="1031" offset="0"/>
  <Field id="_3684" name="error_code" type="_11" context="_248" access="public" location="f7:1032" file="f7" line="1032" offset="64"/>
  <Field id="_3685" name="pnf_param_general" type="_155" context="_248" access="public" location="f7:1033" file="f7" line="1033" offset="96"/>
  <Field id="_3686" name="pnf_phy" type="_161" context="_248" access="public" location="f7:1034" file="f7" line="1034" offset="544"/>
  <Field id="_3687" name="pnf_rf" type="_185" context="_248" access="public" location="f7:1035" file="f7" line="1035" offset="2048"/>
  <Field id="_3688" name="pnf_phy_rel10" type="_165" context="_248" access="public" location="f7:1036" file="f7" line="1036" offset="3232"/>
  <Field id="_3689" name="pnf_phy_rel11" type="_169" context="_248" access="public" location="f7:1037" file="f7" line="1037" offset="3840"/>
  <Field id="_3690" name="pnf_phy_rel12" type="_173" context="_248" access="public" location="f7:1038" file="f7" line="1038" offset="4368"/>
  <Field id="_3691" name="pnf_phy_rel13" type="_177" context="_248" access="public" location="f7:1039" file="f7" line="1039" offset="4976"/>
  <Field id="_3692" name="pnf_phy_rel13_nb_iot" type="_181" context="_248" access="public" location="f7:1040" file="f7" line="1040" offset="5904"/>
  <Field id="_3693" name="vendor_extension" type="_112" context="_248" access="public" location="f7:1041" file="f7" line="1041" offset="7232"/>
  <Field id="_3694" name="header" type="_107" context="_250" access="public" location="f7:1045" file="f7" line="1045" offset="0"/>
  <Field id="_3695" name="pnf_phy_rf_config" type="_189" context="_250" access="public" location="f7:1046" file="f7" line="1046" offset="64"/>
  <Field id="_3696" name="vendor_extension" type="_112" context="_250" access="public" location="f7:1047" file="f7" line="1047" offset="256"/>
  <Field id="_3697" name="header" type="_107" context="_252" access="public" location="f7:1051" file="f7" line="1051" offset="0"/>
  <Field id="_3698" name="error_code" type="_11" context="_252" access="public" location="f7:1052" file="f7" line="1052" offset="64"/>
  <Field id="_3699" name="vendor_extension" type="_112" context="_252" access="public" location="f7:1053" file="f7" line="1053" offset="128"/>
  <Field id="_3700" name="header" type="_107" context="_254" access="public" location="f7:1057" file="f7" line="1057" offset="0"/>
  <Field id="_3701" name="vendor_extension" type="_112" context="_254" access="public" location="f7:1058" file="f7" line="1058" offset="64"/>
  <Field id="_3702" name="header" type="_107" context="_256" access="public" location="f7:1062" file="f7" line="1062" offset="0"/>
  <Field id="_3703" name="error_code" type="_11" context="_256" access="public" location="f7:1063" file="f7" line="1063" offset="64"/>
  <Field id="_3704" name="vendor_extension" type="_112" context="_256" access="public" location="f7:1064" file="f7" line="1064" offset="128"/>
  <Field id="_3705" name="header" type="_107" context="_258" access="public" location="f7:1068" file="f7" line="1068" offset="0"/>
  <Field id="_3706" name="vendor_extension" type="_112" context="_258" access="public" location="f7:1069" file="f7" line="1069" offset="64"/>
  <Field id="_3707" name="header" type="_107" context="_260" access="public" location="f7:1073" file="f7" line="1073" offset="0"/>
  <Field id="_3708" name="error_code" type="_11" context="_260" access="public" location="f7:1074" file="f7" line="1074" offset="64"/>
  <Field id="_3709" name="vendor_extension" type="_112" context="_260" access="public" location="f7:1075" file="f7" line="1075" offset="128"/>
  <Field id="_3710" name="header" type="_107" context="_262" access="public" location="f7:1079" file="f7" line="1079" offset="0"/>
  <Field id="_3711" name="vendor_extension" type="_112" context="_262" access="public" location="f7:1080" file="f7" line="1080" offset="64"/>
  <Field id="_3712" name="header" type="_107" context="_264" access="public" location="f7:1084" file="f7" line="1084" offset="0"/>
  <Field id="_3713" name="error_code" type="_9" context="_264" access="public" location="f7:1085" file="f7" line="1085" offset="64"/>
  <Field id="_3714" name="num_tlv" type="_9" context="_264" access="public" location="f7:1086" file="f7" line="1086" offset="72"/>
  <Field id="_3715" name="l1_status" type="_197" context="_264" access="public" location="f7:1088" file="f7" line="1088" offset="80"/>
  <Field id="_3716" name="phy_capabilities" type="_199" context="_264" access="public" location="f7:1089" file="f7" line="1089" offset="128"/>
  <Field id="_3717" name="laa_capability" type="_227" context="_264" access="public" location="f7:1090" file="f7" line="1090" offset="464"/>
  <Field id="_3718" name="nb_iot_capability" type="_229" context="_264" access="public" location="f7:1091" file="f7" line="1091" offset="656"/>
  <Field id="_3719" name="subframe_config" type="_203" context="_264" access="public" location="f7:1093" file="f7" line="1093" offset="752"/>
  <Field id="_3720" name="rf_config" type="_205" context="_264" access="public" location="f7:1094" file="f7" line="1094" offset="992"/>
  <Field id="_3721" name="phich_config" type="_207" context="_264" access="public" location="f7:1095" file="f7" line="1095" offset="1232"/>
  <Field id="_3722" name="sch_config" type="_209" context="_264" access="public" location="f7:1096" file="f7" line="1096" offset="1376"/>
  <Field id="_3723" name="prach_config" type="_211" context="_264" access="public" location="f7:1097" file="f7" line="1097" offset="1520"/>
  <Field id="_3724" name="pusch_config" type="_213" context="_264" access="public" location="f7:1098" file="f7" line="1098" offset="1760"/>
  <Field id="_3725" name="pucch_config" type="_215" context="_264" access="public" location="f7:1099" file="f7" line="1099" offset="1904"/>
  <Field id="_3726" name="srs_config" type="_217" context="_264" access="public" location="f7:1100" file="f7" line="1100" offset="2096"/>
  <Field id="_3727" name="uplink_reference_signal_config" type="_219" context="_264" access="public" location="f7:1101" file="f7" line="1101" offset="2288"/>
  <Field id="_3728" name="tdd_frame_structure_config" type="_231" context="_264" access="public" location="f7:1102" file="f7" line="1102" offset="2432"/>
  <Field id="_3729" name="l23_config" type="_201" context="_264" access="public" location="f7:1103" file="f7" line="1103" offset="2528"/>
  <Field id="_3730" name="nb_iot_config" type="_225" context="_264" access="public" location="f7:1104" file="f7" line="1104" offset="2624"/>
  <Field id="_3731" name="nfapi_config" type="_245" context="_264" access="public" location="f7:1107" file="f7" line="1107" offset="4304"/>
  <Field id="_3732" name="vendor_extension" type="_112" context="_264" access="public" location="f7:1108" file="f7" line="1108" offset="7232"/>
  <Field id="_3733" name="header" type="_107" context="_266" access="public" location="f7:1112" file="f7" line="1112" offset="0"/>
  <Field id="_3734" name="num_tlv" type="_9" context="_266" access="public" location="f7:1113" file="f7" line="1113" offset="64"/>
  <Field id="_3735" name="subframe_config" type="_203" context="_266" access="public" location="f7:1114" file="f7" line="1114" offset="80"/>
  <Field id="_3736" name="rf_config" type="_205" context="_266" access="public" location="f7:1115" file="f7" line="1115" offset="320"/>
  <Field id="_3737" name="phich_config" type="_207" context="_266" access="public" location="f7:1116" file="f7" line="1116" offset="560"/>
  <Field id="_3738" name="sch_config" type="_209" context="_266" access="public" location="f7:1117" file="f7" line="1117" offset="704"/>
  <Field id="_3739" name="prach_config" type="_211" context="_266" access="public" location="f7:1118" file="f7" line="1118" offset="848"/>
  <Field id="_3740" name="pusch_config" type="_213" context="_266" access="public" location="f7:1119" file="f7" line="1119" offset="1088"/>
  <Field id="_3741" name="pucch_config" type="_215" context="_266" access="public" location="f7:1120" file="f7" line="1120" offset="1232"/>
  <Field id="_3742" name="srs_config" type="_217" context="_266" access="public" location="f7:1121" file="f7" line="1121" offset="1424"/>
  <Field id="_3743" name="uplink_reference_signal_config" type="_219" context="_266" access="public" location="f7:1122" file="f7" line="1122" offset="1616"/>
  <Field id="_3744" name="laa_config" type="_221" context="_266" access="public" location="f7:1123" file="f7" line="1123" offset="1760"/>
  <Field id="_3745" name="emtc_config" type="_223" context="_266" access="public" location="f7:1124" file="f7" line="1124" offset="2144"/>
  <Field id="_3746" name="tdd_frame_structure_config" type="_231" context="_266" access="public" location="f7:1125" file="f7" line="1125" offset="3776"/>
  <Field id="_3747" name="l23_config" type="_201" context="_266" access="public" location="f7:1126" file="f7" line="1126" offset="3872"/>
  <Field id="_3748" name="nb_iot_config" type="_225" context="_266" access="public" location="f7:1127" file="f7" line="1127" offset="3968"/>
  <Field id="_3749" name="nfapi_config" type="_245" context="_266" access="public" location="f7:1130" file="f7" line="1130" offset="5648"/>
  <Field id="_3750" name="vendor_extension" type="_112" context="_266" access="public" location="f7:1132" file="f7" line="1132" offset="8576"/>
  <Field id="_3751" name="header" type="_107" context="_268" access="public" location="f7:1136" file="f7" line="1136" offset="0"/>
  <Field id="_3752" name="error_code" type="_11" context="_268" access="public" location="f7:1137" file="f7" line="1137" offset="64"/>
  <Field id="_3753" name="vendor_extension" type="_112" context="_268" access="public" location="f7:1138" file="f7" line="1138" offset="128"/>
  <Field id="_3754" name="header" type="_107" context="_270" access="public" location="f7:1142" file="f7" line="1142" offset="0"/>
  <Field id="_3755" name="vendor_extension" type="_112" context="_270" access="public" location="f7:1143" file="f7" line="1143" offset="64"/>
  <Field id="_3756" name="header" type="_107" context="_272" access="public" location="f7:1147" file="f7" line="1147" offset="0"/>
  <Field id="_3757" name="error_code" type="_11" context="_272" access="public" location="f7:1148" file="f7" line="1148" offset="64"/>
  <Field id="_3758" name="vendor_extension" type="_112" context="_272" access="public" location="f7:1149" file="f7" line="1149" offset="128"/>
  <Field id="_3759" name="header" type="_107" context="_274" access="public" location="f7:1153" file="f7" line="1153" offset="0"/>
  <Field id="_3760" name="vendor_extension" type="_112" context="_274" access="public" location="f7:1154" file="f7" line="1154" offset="64"/>
  <Field id="_3761" name="header" type="_107" context="_276" access="public" location="f7:1158" file="f7" line="1158" offset="0"/>
  <Field id="_3762" name="error_code" type="_11" context="_276" access="public" location="f7:1159" file="f7" line="1159" offset="64"/>
  <Field id="_3763" name="vendor_extension" type="_112" context="_276" access="public" location="f7:1160" file="f7" line="1160" offset="128"/>
  <Field id="_3764" name="header" type="_107" context="_278" access="public" location="f7:1164" file="f7" line="1164" offset="0"/>
  <Field id="_3765" name="dl_rs_tx_power" type="_191" context="_278" access="public" location="f7:1165" file="f7" line="1165" offset="64"/>
  <Field id="_3766" name="received_interference_power" type="_191" context="_278" access="public" location="f7:1166" file="f7" line="1166" offset="112"/>
  <Field id="_3767" name="thermal_noise_power" type="_191" context="_278" access="public" location="f7:1167" file="f7" line="1167" offset="160"/>
  <Field id="_3768" name="vendor_extension" type="_112" context="_278" access="public" location="f7:1168" file="f7" line="1168" offset="256"/>
  <Field id="_3769" name="tl" type="_111" context="_280" access="public" location="f7:1178" file="f7" line="1178" offset="0"/>
  <Field id="_3770" name="number_of_resource_blocks" type="_10" context="_280" access="public" location="f7:1179" file="f7" line="1179" offset="32"/>
  <Field id="_3771" name="received_interference_power" type="_7669" context="_280" access="public" location="f7:1180" file="f7" line="1180" offset="48"/>
  <Field id="_3772" name="header" type="_107" context="_282" access="public" location="f7:1184" file="f7" line="1184" offset="0"/>
  <Field id="_3773" name="error_code" type="_11" context="_282" access="public" location="f7:1185" file="f7" line="1185" offset="64"/>
  <Field id="_3774" name="dl_rs_tx_power_measurement" type="_193" context="_282" access="public" location="f7:1186" file="f7" line="1186" offset="96"/>
  <Field id="_3775" name="received_interference_power_measurement" type="_281" context="_282" access="public" location="f7:1187" file="f7" line="1187" offset="144"/>
  <Field id="_3776" name="thermal_noise_power_measurement" type="_193" context="_282" access="public" location="f7:1188" file="f7" line="1188" offset="1792"/>
  <Field id="_3777" name="vendor_extension" type="_112" context="_282" access="public" location="f7:1189" file="f7" line="1189" offset="1856"/>
  <Field id="_3778" name="tl" type="_111" context="_284" access="public" location="f7:1198" file="f7" line="1198" offset="0"/>
  <Field id="_3779" name="dci_format" type="_9" context="_284" access="public" location="f7:1199" file="f7" line="1199" offset="32"/>
  <Field id="_3780" name="cce_idx" type="_9" context="_284" access="public" location="f7:1200" file="f7" line="1200" offset="40"/>
  <Field id="_3781" name="aggregation_level" type="_9" context="_284" access="public" location="f7:1201" file="f7" line="1201" offset="48"/>
  <Field id="_3782" name="rnti" type="_10" context="_284" access="public" location="f7:1202" file="f7" line="1202" offset="64"/>
  <Field id="_3783" name="resource_allocation_type" type="_9" context="_284" access="public" location="f7:1203" file="f7" line="1203" offset="80"/>
  <Field id="_3784" name="virtual_resource_block_assignment_flag" type="_9" context="_284" access="public" location="f7:1204" file="f7" line="1204" offset="88"/>
  <Field id="_3785" name="resource_block_coding" type="_11" context="_284" access="public" location="f7:1205" file="f7" line="1205" offset="96"/>
  <Field id="_3786" name="mcs_1" type="_9" context="_284" access="public" location="f7:1206" file="f7" line="1206" offset="128"/>
  <Field id="_3787" name="redundancy_version_1" type="_9" context="_284" access="public" location="f7:1207" file="f7" line="1207" offset="136"/>
  <Field id="_3788" name="new_data_indicator_1" type="_9" context="_284" access="public" location="f7:1208" file="f7" line="1208" offset="144"/>
  <Field id="_3789" name="transport_block_to_codeword_swap_flag" type="_9" context="_284" access="public" location="f7:1209" file="f7" line="1209" offset="152"/>
  <Field id="_3790" name="mcs_2" type="_9" context="_284" access="public" location="f7:1210" file="f7" line="1210" offset="160"/>
  <Field id="_3791" name="redundancy_version_2" type="_9" context="_284" access="public" location="f7:1211" file="f7" line="1211" offset="168"/>
  <Field id="_3792" name="new_data_indicator_2" type="_9" context="_284" access="public" location="f7:1212" file="f7" line="1212" offset="176"/>
  <Field id="_3793" name="harq_process" type="_9" context="_284" access="public" location="f7:1213" file="f7" line="1213" offset="184"/>
  <Field id="_3794" name="tpmi" type="_9" context="_284" access="public" location="f7:1214" file="f7" line="1214" offset="192"/>
  <Field id="_3795" name="pmi" type="_9" context="_284" access="public" location="f7:1215" file="f7" line="1215" offset="200"/>
  <Field id="_3796" name="precoding_information" type="_9" context="_284" access="public" location="f7:1216" file="f7" line="1216" offset="208"/>
  <Field id="_3797" name="tpc" type="_9" context="_284" access="public" location="f7:1217" file="f7" line="1217" offset="216"/>
  <Field id="_3798" name="downlink_assignment_index" type="_9" context="_284" access="public" location="f7:1218" file="f7" line="1218" offset="224"/>
  <Field id="_3799" name="ngap" type="_9" context="_284" access="public" location="f7:1219" file="f7" line="1219" offset="232"/>
  <Field id="_3800" name="transport_block_size_index" type="_9" context="_284" access="public" location="f7:1220" file="f7" line="1220" offset="240"/>
  <Field id="_3801" name="downlink_power_offset" type="_9" context="_284" access="public" location="f7:1221" file="f7" line="1221" offset="248"/>
  <Field id="_3802" name="allocate_prach_flag" type="_9" context="_284" access="public" location="f7:1222" file="f7" line="1222" offset="256"/>
  <Field id="_3803" name="preamble_index" type="_9" context="_284" access="public" location="f7:1223" file="f7" line="1223" offset="264"/>
  <Field id="_3804" name="prach_mask_index" type="_9" context="_284" access="public" location="f7:1224" file="f7" line="1224" offset="272"/>
  <Field id="_3805" name="rnti_type" type="_9" context="_284" access="public" location="f7:1225" file="f7" line="1225" offset="280"/>
  <Field id="_3806" name="transmission_power" type="_10" context="_284" access="public" location="f7:1226" file="f7" line="1226" offset="288"/>
  <Field id="_3807" name="tl" type="_111" context="_286" access="public" location="f7:1231" file="f7" line="1231" offset="0"/>
  <Field id="_3808" name="mcch_flag" type="_9" context="_286" access="public" location="f7:1232" file="f7" line="1232" offset="32"/>
  <Field id="_3809" name="mcch_change_notification" type="_9" context="_286" access="public" location="f7:1233" file="f7" line="1233" offset="40"/>
  <Field id="_3810" name="scrambling_identity" type="_9" context="_286" access="public" location="f7:1234" file="f7" line="1234" offset="48"/>
  <Field id="_3811" name="tl" type="_111" context="_288" access="public" location="f7:1239" file="f7" line="1239" offset="0"/>
  <Field id="_3812" name="cross_carrier_scheduling_flag" type="_9" context="_288" access="public" location="f7:1240" file="f7" line="1240" offset="32"/>
  <Field id="_3813" name="carrier_indicator" type="_9" context="_288" access="public" location="f7:1241" file="f7" line="1241" offset="40"/>
  <Field id="_3814" name="srs_flag" type="_9" context="_288" access="public" location="f7:1242" file="f7" line="1242" offset="48"/>
  <Field id="_3815" name="srs_request" type="_9" context="_288" access="public" location="f7:1243" file="f7" line="1243" offset="56"/>
  <Field id="_3816" name="antenna_ports_scrambling_and_layers" type="_9" context="_288" access="public" location="f7:1244" file="f7" line="1244" offset="64"/>
  <Field id="_3817" name="total_dci_length_including_padding" type="_9" context="_288" access="public" location="f7:1245" file="f7" line="1245" offset="72"/>
  <Field id="_3818" name="n_dl_rb" type="_9" context="_288" access="public" location="f7:1246" file="f7" line="1246" offset="80"/>
  <Field id="_3819" name="tl" type="_111" context="_290" access="public" location="f7:1252" file="f7" line="1252" offset="0"/>
  <Field id="_3820" name="harq_ack_resource_offset" type="_9" context="_290" access="public" location="f7:1253" file="f7" line="1253" offset="32"/>
  <Field id="_3821" name="pdsch_re_mapping_quasi_co_location_indicator" type="_9" context="_290" access="public" location="f7:1254" file="f7" line="1254" offset="40"/>
  <Field id="_3822" name="tl" type="_111" context="_292" access="public" location="f7:1262" file="f7" line="1262" offset="0"/>
  <Field id="_3823" name="primary_cell_type" type="_9" context="_292" access="public" location="f7:1263" file="f7" line="1263" offset="32"/>
  <Field id="_3824" name="ul_dl_configuration_flag" type="_9" context="_292" access="public" location="f7:1264" file="f7" line="1264" offset="40"/>
  <Field id="_3825" name="number_ul_dl_configurations" type="_9" context="_292" access="public" location="f7:1265" file="f7" line="1265" offset="48"/>
  <Field id="_3826" name="ul_dl_configuration_indication" type="_7670" context="_292" access="public" location="f7:1266" file="f7" line="1266" offset="56"/>
  <Field id="_3827" name="subband_index" type="_9" context="_294" access="public" location="f7:1274" file="f7" line="1274" offset="0"/>
  <Field id="_3828" name="scheduled_ues" type="_9" context="_294" access="public" location="f7:1275" file="f7" line="1275" offset="8"/>
  <Field id="_3829" name="precoding_value" type="_7671" context="_294" access="public" location="f7:1276" file="f7" line="1276" offset="16"/>
  <Field id="_3830" name="num_prb_per_subband" type="_9" context="_296" access="public" location="f7:1280" file="f7" line="1280" offset="0"/>
  <Field id="_3831" name="number_of_subbands" type="_9" context="_296" access="public" location="f7:1281" file="f7" line="1281" offset="8"/>
  <Field id="_3832" name="num_antennas" type="_9" context="_296" access="public" location="f7:1282" file="f7" line="1282" offset="16"/>
  <Field id="_3833" name="subband_info" type="_7672" context="_296" access="public" location="f7:1283" file="f7" line="1283" offset="32"/>
  <Field id="_3834" name="tl" type="_111" context="_298" access="public" location="f7:1287" file="f7" line="1287" offset="0"/>
  <Field id="_3835" name="laa_end_partial_sf_flag" type="_9" context="_298" access="public" location="f7:1288" file="f7" line="1288" offset="32"/>
  <Field id="_3836" name="laa_end_partial_sf_configuration" type="_9" context="_298" access="public" location="f7:1289" file="f7" line="1289" offset="40"/>
  <Field id="_3837" name="initial_lbt_sf" type="_9" context="_298" access="public" location="f7:1290" file="f7" line="1290" offset="48"/>
  <Field id="_3838" name="codebook_size_determination" type="_9" context="_298" access="public" location="f7:1291" file="f7" line="1291" offset="56"/>
  <Field id="_3839" name="drms_table_flag" type="_9" context="_298" access="public" location="f7:1292" file="f7" line="1292" offset="64"/>
  <Field id="_3840" name="tpm_struct_flag" type="_9" context="_298" access="public" location="f7:1293" file="f7" line="1293" offset="72"/>
  <Field id="_3841" name="tpm" type="_297" context="_298" access="public" location="f7:1294" file="f7" line="1294" offset="80"/>
  <Field id="_3842" name="dci_dl_pdu_rel8" type="_285" context="_300" access="public" location="f7:1300" file="f7" line="1300" offset="0"/>
  <Field id="_3843" name="dci_dl_pdu_rel9" type="_287" context="_300" access="public" location="f7:1301" file="f7" line="1301" offset="320"/>
  <Field id="_3844" name="dci_dl_pdu_rel10" type="_289" context="_300" access="public" location="f7:1302" file="f7" line="1302" offset="384"/>
  <Field id="_3845" name="dci_dl_pdu_rel11" type="_291" context="_300" access="public" location="f7:1303" file="f7" line="1303" offset="480"/>
  <Field id="_3846" name="dci_dl_pdu_rel12" type="_293" context="_300" access="public" location="f7:1304" file="f7" line="1304" offset="528"/>
  <Field id="_3847" name="dci_dl_pdu_rel13" type="_299" context="_300" access="public" location="f7:1305" file="f7" line="1305" offset="624"/>
  <Field id="_3848" name="tl" type="_111" context="_302" access="public" location="f7:1309" file="f7" line="1309" offset="0"/>
  <Field id="_3849" name="length" type="_10" context="_302" access="public" location="f7:1310" file="f7" line="1310" offset="32"/>
  <Field id="_3850" name="pdu_index" type="_10" context="_302" access="public" location="f7:1311" file="f7" line="1311" offset="48"/>
  <Field id="_3851" name="transmission_power" type="_10" context="_302" access="public" location="f7:1312" file="f7" line="1312" offset="64"/>
  <Field id="_3852" name="bch_pdu_rel8" type="_303" context="_304" access="public" location="f7:1317" file="f7" line="1317" offset="0"/>
  <Field id="_3853" name="tl" type="_111" context="_306" access="public" location="f7:1321" file="f7" line="1321" offset="0"/>
  <Field id="_3854" name="length" type="_10" context="_306" access="public" location="f7:1322" file="f7" line="1322" offset="32"/>
  <Field id="_3855" name="pdu_index" type="_10" context="_306" access="public" location="f7:1323" file="f7" line="1323" offset="48"/>
  <Field id="_3856" name="rnti" type="_10" context="_306" access="public" location="f7:1324" file="f7" line="1324" offset="64"/>
  <Field id="_3857" name="resource_allocation_type" type="_9" context="_306" access="public" location="f7:1325" file="f7" line="1325" offset="80"/>
  <Field id="_3858" name="resource_block_coding" type="_11" context="_306" access="public" location="f7:1326" file="f7" line="1326" offset="96"/>
  <Field id="_3859" name="modulation" type="_9" context="_306" access="public" location="f7:1327" file="f7" line="1327" offset="128"/>
  <Field id="_3860" name="transmission_power" type="_10" context="_306" access="public" location="f7:1328" file="f7" line="1328" offset="144"/>
  <Field id="_3861" name="mbsfn_area_id" type="_10" context="_306" access="public" location="f7:1329" file="f7" line="1329" offset="160"/>
  <Field id="_3862" name="mch_pdu_rel8" type="_307" context="_308" access="public" location="f7:1334" file="f7" line="1334" offset="0"/>
  <Field id="_3863" name="subband_index" type="_9" context="_310" access="public" location="f7:1339" file="f7" line="1339" offset="0"/>
  <Field id="_3864" name="num_antennas" type="_9" context="_310" access="public" location="f7:1340" file="f7" line="1340" offset="8"/>
  <Field id="_3865" name="bf_value" type="_7673" context="_310" access="public" location="f7:1341" file="f7" line="1341" offset="16"/>
  <Field id="_3866" name="tl" type="_111" context="_312" access="public" location="f7:1345" file="f7" line="1345" offset="0"/>
  <Field id="_3867" name="length" type="_10" context="_312" access="public" location="f7:1346" file="f7" line="1346" offset="32"/>
  <Field id="_3868" name="pdu_index" type="_10" context="_312" access="public" location="f7:1347" file="f7" line="1347" offset="48"/>
  <Field id="_3869" name="rnti" type="_10" context="_312" access="public" location="f7:1348" file="f7" line="1348" offset="64"/>
  <Field id="_3870" name="resource_allocation_type" type="_9" context="_312" access="public" location="f7:1349" file="f7" line="1349" offset="80"/>
  <Field id="_3871" name="virtual_resource_block_assignment_flag" type="_9" context="_312" access="public" location="f7:1350" file="f7" line="1350" offset="88"/>
  <Field id="_3872" name="resource_block_coding" type="_11" context="_312" access="public" location="f7:1351" file="f7" line="1351" offset="96"/>
  <Field id="_3873" name="modulation" type="_9" context="_312" access="public" location="f7:1352" file="f7" line="1352" offset="128"/>
  <Field id="_3874" name="redundancy_version" type="_9" context="_312" access="public" location="f7:1353" file="f7" line="1353" offset="136"/>
  <Field id="_3875" name="transport_blocks" type="_9" context="_312" access="public" location="f7:1354" file="f7" line="1354" offset="144"/>
  <Field id="_3876" name="transport_block_to_codeword_swap_flag" type="_9" context="_312" access="public" location="f7:1355" file="f7" line="1355" offset="152"/>
  <Field id="_3877" name="transmission_scheme" type="_9" context="_312" access="public" location="f7:1356" file="f7" line="1356" offset="160"/>
  <Field id="_3878" name="number_of_layers" type="_9" context="_312" access="public" location="f7:1357" file="f7" line="1357" offset="168"/>
  <Field id="_3879" name="number_of_subbands" type="_9" context="_312" access="public" location="f7:1358" file="f7" line="1358" offset="176"/>
  <Field id="_3880" name="codebook_index" type="_7674" context="_312" access="public" location="f7:1359" file="f7" line="1359" offset="184"/>
  <Field id="_3881" name="ue_category_capacity" type="_9" context="_312" access="public" location="f7:1360" file="f7" line="1360" offset="288"/>
  <Field id="_3882" name="pa" type="_9" context="_312" access="public" location="f7:1361" file="f7" line="1361" offset="296"/>
  <Field id="_3883" name="delta_power_offset_index" type="_9" context="_312" access="public" location="f7:1362" file="f7" line="1362" offset="304"/>
  <Field id="_3884" name="ngap" type="_9" context="_312" access="public" location="f7:1363" file="f7" line="1363" offset="312"/>
  <Field id="_3885" name="nprb" type="_9" context="_312" access="public" location="f7:1364" file="f7" line="1364" offset="320"/>
  <Field id="_3886" name="transmission_mode" type="_9" context="_312" access="public" location="f7:1365" file="f7" line="1365" offset="328"/>
  <Field id="_3887" name="num_bf_prb_per_subband" type="_9" context="_312" access="public" location="f7:1366" file="f7" line="1366" offset="336"/>
  <Field id="_3888" name="num_bf_vector" type="_9" context="_312" access="public" location="f7:1367" file="f7" line="1367" offset="344"/>
  <Field id="_3889" name="bf_vector" type="_7675" context="_312" access="public" location="f7:1368" file="f7" line="1368" offset="352"/>
  <Field id="_3890" name="tl" type="_111" context="_314" access="public" location="f7:1373" file="f7" line="1373" offset="0"/>
  <Field id="_3891" name="nscid" type="_9" context="_314" access="public" location="f7:1374" file="f7" line="1374" offset="32"/>
  <Field id="_3892" name="tl" type="_111" context="_316" access="public" location="f7:1379" file="f7" line="1379" offset="0"/>
  <Field id="_3893" name="csi_rs_flag" type="_9" context="_316" access="public" location="f7:1380" file="f7" line="1380" offset="32"/>
  <Field id="_3894" name="csi_rs_resource_config_r10" type="_9" context="_316" access="public" location="f7:1381" file="f7" line="1381" offset="40"/>
  <Field id="_3895" name="csi_rs_zero_tx_power_resource_config_bitmap_r10" type="_10" context="_316" access="public" location="f7:1382" file="f7" line="1382" offset="48"/>
  <Field id="_3896" name="csi_rs_number_nzp_configuration" type="_9" context="_316" access="public" location="f7:1383" file="f7" line="1383" offset="64"/>
  <Field id="_3897" name="csi_rs_resource_config" type="_7667" context="_316" access="public" location="f7:1384" file="f7" line="1384" offset="72"/>
  <Field id="_3898" name="pdsch_start" type="_9" context="_316" access="public" location="f7:1385" file="f7" line="1385" offset="104"/>
  <Field id="_3899" name="tl" type="_111" context="_318" access="public" location="f7:1390" file="f7" line="1390" offset="0"/>
  <Field id="_3900" name="drms_config_flag" type="_9" context="_318" access="public" location="f7:1391" file="f7" line="1391" offset="32"/>
  <Field id="_3901" name="drms_scrambling" type="_10" context="_318" access="public" location="f7:1392" file="f7" line="1392" offset="48"/>
  <Field id="_3902" name="csi_config_flag" type="_9" context="_318" access="public" location="f7:1393" file="f7" line="1393" offset="64"/>
  <Field id="_3903" name="csi_scrambling" type="_10" context="_318" access="public" location="f7:1394" file="f7" line="1394" offset="80"/>
  <Field id="_3904" name="pdsch_re_mapping_flag" type="_9" context="_318" access="public" location="f7:1395" file="f7" line="1395" offset="96"/>
  <Field id="_3905" name="pdsch_re_mapping_atenna_ports" type="_9" context="_318" access="public" location="f7:1396" file="f7" line="1396" offset="104"/>
  <Field id="_3906" name="pdsch_re_mapping_freq_shift" type="_9" context="_318" access="public" location="f7:1397" file="f7" line="1397" offset="112"/>
  <Field id="_3907" name="tl" type="_111" context="_320" access="public" location="f7:1402" file="f7" line="1402" offset="0"/>
  <Field id="_3908" name="altcqi_table_r12" type="_9" context="_320" access="public" location="f7:1403" file="f7" line="1403" offset="32"/>
  <Field id="_3909" name="maxlayers" type="_9" context="_320" access="public" location="f7:1404" file="f7" line="1404" offset="40"/>
  <Field id="_3910" name="n_dl_harq" type="_9" context="_320" access="public" location="f7:1405" file="f7" line="1405" offset="48"/>
  <Field id="_3911" name="tl" type="_111" context="_322" access="public" location="f7:1410" file="f7" line="1410" offset="0"/>
  <Field id="_3912" name="dwpts_symbols" type="_9" context="_322" access="public" location="f7:1411" file="f7" line="1411" offset="32"/>
  <Field id="_3913" name="initial_lbt_sf" type="_9" context="_322" access="public" location="f7:1412" file="f7" line="1412" offset="40"/>
  <Field id="_3914" name="ue_type" type="_9" context="_322" access="public" location="f7:1413" file="f7" line="1413" offset="48"/>
  <Field id="_3915" name="pdsch_payload_type" type="_9" context="_322" access="public" location="f7:1414" file="f7" line="1414" offset="56"/>
  <Field id="_3916" name="initial_transmission_sf_io" type="_10" context="_322" access="public" location="f7:1415" file="f7" line="1415" offset="64"/>
  <Field id="_3917" name="drms_table_flag" type="_9" context="_322" access="public" location="f7:1416" file="f7" line="1416" offset="80"/>
  <Field id="_3918" name="dlsch_pdu_rel8" type="_313" context="_324" access="public" location="f7:1421" file="f7" line="1421" offset="0"/>
  <Field id="_3919" name="dlsch_pdu_rel9" type="_315" context="_324" access="public" location="f7:1422" file="f7" line="1422" offset="1504"/>
  <Field id="_3920" name="dlsch_pdu_rel10" type="_317" context="_324" access="public" location="f7:1423" file="f7" line="1423" offset="1552"/>
  <Field id="_3921" name="dlsch_pdu_rel11" type="_319" context="_324" access="public" location="f7:1424" file="f7" line="1424" offset="1664"/>
  <Field id="_3922" name="dlsch_pdu_rel12" type="_321" context="_324" access="public" location="f7:1425" file="f7" line="1425" offset="1792"/>
  <Field id="_3923" name="dlsch_pdu_rel13" type="_323" context="_324" access="public" location="f7:1426" file="f7" line="1426" offset="1856"/>
  <Field id="_3924" name="tl" type="_111" context="_326" access="public" location="f7:1430" file="f7" line="1430" offset="0"/>
  <Field id="_3925" name="length" type="_10" context="_326" access="public" location="f7:1431" file="f7" line="1431" offset="32"/>
  <Field id="_3926" name="pdu_index" type="_10" context="_326" access="public" location="f7:1432" file="f7" line="1432" offset="48"/>
  <Field id="_3927" name="p_rnti" type="_10" context="_326" access="public" location="f7:1433" file="f7" line="1433" offset="64"/>
  <Field id="_3928" name="resource_allocation_type" type="_9" context="_326" access="public" location="f7:1434" file="f7" line="1434" offset="80"/>
  <Field id="_3929" name="virtual_resource_block_assignment_flag" type="_9" context="_326" access="public" location="f7:1435" file="f7" line="1435" offset="88"/>
  <Field id="_3930" name="resource_block_coding" type="_11" context="_326" access="public" location="f7:1436" file="f7" line="1436" offset="96"/>
  <Field id="_3931" name="mcs" type="_9" context="_326" access="public" location="f7:1437" file="f7" line="1437" offset="128"/>
  <Field id="_3932" name="redundancy_version" type="_9" context="_326" access="public" location="f7:1438" file="f7" line="1438" offset="136"/>
  <Field id="_3933" name="number_of_transport_blocks" type="_9" context="_326" access="public" location="f7:1439" file="f7" line="1439" offset="144"/>
  <Field id="_3934" name="transport_block_to_codeword_swap_flag" type="_9" context="_326" access="public" location="f7:1440" file="f7" line="1440" offset="152"/>
  <Field id="_3935" name="transmission_scheme" type="_9" context="_326" access="public" location="f7:1441" file="f7" line="1441" offset="160"/>
  <Field id="_3936" name="number_of_layers" type="_9" context="_326" access="public" location="f7:1442" file="f7" line="1442" offset="168"/>
  <Field id="_3937" name="codebook_index" type="_9" context="_326" access="public" location="f7:1443" file="f7" line="1443" offset="176"/>
  <Field id="_3938" name="ue_category_capacity" type="_9" context="_326" access="public" location="f7:1444" file="f7" line="1444" offset="184"/>
  <Field id="_3939" name="pa" type="_9" context="_326" access="public" location="f7:1445" file="f7" line="1445" offset="192"/>
  <Field id="_3940" name="transmission_power" type="_10" context="_326" access="public" location="f7:1446" file="f7" line="1446" offset="208"/>
  <Field id="_3941" name="nprb" type="_9" context="_326" access="public" location="f7:1447" file="f7" line="1447" offset="224"/>
  <Field id="_3942" name="ngap" type="_9" context="_326" access="public" location="f7:1448" file="f7" line="1448" offset="232"/>
  <Field id="_3943" name="tl" type="_111" context="_328" access="public" location="f7:1453" file="f7" line="1453" offset="0"/>
  <Field id="_3944" name="ue_mode" type="_9" context="_328" access="public" location="f7:1454" file="f7" line="1454" offset="32"/>
  <Field id="_3945" name="initial_transmission_sf_io" type="_10" context="_328" access="public" location="f7:1455" file="f7" line="1455" offset="48"/>
  <Field id="_3946" name="pch_pdu_rel8" type="_327" context="_330" access="public" location="f7:1460" file="f7" line="1460" offset="0"/>
  <Field id="_3947" name="pch_pdu_rel13" type="_329" context="_330" access="public" location="f7:1461" file="f7" line="1461" offset="256"/>
  <Field id="_3948" name="tl" type="_111" context="_332" access="public" location="f7:1465" file="f7" line="1465" offset="0"/>
  <Field id="_3949" name="transmission_power" type="_10" context="_332" access="public" location="f7:1466" file="f7" line="1466" offset="32"/>
  <Field id="_3950" name="prs_bandwidth" type="_9" context="_332" access="public" location="f7:1467" file="f7" line="1467" offset="48"/>
  <Field id="_3951" name="prs_cyclic_prefix_type" type="_9" context="_332" access="public" location="f7:1468" file="f7" line="1468" offset="56"/>
  <Field id="_3952" name="prs_muting" type="_9" context="_332" access="public" location="f7:1469" file="f7" line="1469" offset="64"/>
  <Field id="_3953" name="prs_pdu_rel9" type="_333" context="_334" access="public" location="f7:1474" file="f7" line="1474" offset="0"/>
  <Field id="_3954" name="tl" type="_111" context="_336" access="public" location="f7:1478" file="f7" line="1478" offset="0"/>
  <Field id="_3955" name="csi_rs_antenna_port_count_r10" type="_9" context="_336" access="public" location="f7:1479" file="f7" line="1479" offset="32"/>
  <Field id="_3956" name="csi_rs_resource_config_r10" type="_9" context="_336" access="public" location="f7:1480" file="f7" line="1480" offset="40"/>
  <Field id="_3957" name="transmission_power" type="_10" context="_336" access="public" location="f7:1481" file="f7" line="1481" offset="48"/>
  <Field id="_3958" name="csi_rs_zero_tx_power_resource_config_bitmap_r10" type="_10" context="_336" access="public" location="f7:1482" file="f7" line="1482" offset="64"/>
  <Field id="_3959" name="csi_rs_number_of_nzp_configuration" type="_9" context="_336" access="public" location="f7:1483" file="f7" line="1483" offset="80"/>
  <Field id="_3960" name="csi_rs_resource_config" type="_7667" context="_336" access="public" location="f7:1484" file="f7" line="1484" offset="88"/>
  <Field id="_3961" name="tl" type="_111" context="_338" access="public" location="f7:1489" file="f7" line="1489" offset="0"/>
  <Field id="_3962" name="csi_rs_class" type="_9" context="_338" access="public" location="f7:1490" file="f7" line="1490" offset="32"/>
  <Field id="_3963" name="cdm_type" type="_9" context="_338" access="public" location="f7:1491" file="f7" line="1491" offset="40"/>
  <Field id="_3964" name="num_bf_vector" type="_9" context="_338" access="public" location="f7:1492" file="f7" line="1492" offset="48"/>
  <Struct id="_3965" name="" context="_338" access="public" location="f7:1493" file="f7" line="1493" members="_7676 _7677" size="144" align="16"/>
  <Field id="_3966" name="bf_vector" type="_7678" context="_338" access="public" location="f7:1496" file="f7" line="1496" offset="64"/>
  <Field id="_3967" name="csi_rs_pdu_rel10" type="_337" context="_340" access="public" location="f7:1502" file="f7" line="1502" offset="0"/>
  <Field id="_3968" name="csi_rs_pdu_rel13" type="_339" context="_340" access="public" location="f7:1503" file="f7" line="1503" offset="128"/>
  <Field id="_3969" name="tl" type="_111" context="_342" access="public" location="f7:1514" file="f7" line="1514" offset="0"/>
  <Field id="_3970" name="epdcch_resource_assignment_flag" type="_9" context="_342" access="public" location="f7:1515" file="f7" line="1515" offset="32"/>
  <Field id="_3971" name="epdcch_id" type="_10" context="_342" access="public" location="f7:1516" file="f7" line="1516" offset="48"/>
  <Field id="_3972" name="epdcch_start_symbol" type="_9" context="_342" access="public" location="f7:1517" file="f7" line="1517" offset="64"/>
  <Field id="_3973" name="epdcch_num_prb" type="_9" context="_342" access="public" location="f7:1518" file="f7" line="1518" offset="72"/>
  <Field id="_3974" name="epdcch_prb_index" type="_7679" context="_342" access="public" location="f7:1519" file="f7" line="1519" offset="80"/>
  <Field id="_3975" name="bf_vector" type="_311" context="_342" access="public" location="f7:1520" file="f7" line="1520" offset="144"/>
  <Field id="_3976" name="tl" type="_111" context="_344" access="public" location="f7:1525" file="f7" line="1525" offset="0"/>
  <Field id="_3977" name="dwpts_symbols" type="_9" context="_344" access="public" location="f7:1526" file="f7" line="1526" offset="32"/>
  <Field id="_3978" name="initial_lbt_sf" type="_9" context="_344" access="public" location="f7:1527" file="f7" line="1527" offset="40"/>
  <Field id="_3979" name="epdcch_pdu_rel8" type="_285" context="_346" access="public" location="f7:1532" file="f7" line="1532" offset="0"/>
  <Field id="_3980" name="epdcch_pdu_rel9" type="_287" context="_346" access="public" location="f7:1533" file="f7" line="1533" offset="320"/>
  <Field id="_3981" name="epdcch_pdu_rel10" type="_289" context="_346" access="public" location="f7:1534" file="f7" line="1534" offset="384"/>
  <Field id="_3982" name="epdcch_pdu_rel11" type="_291" context="_346" access="public" location="f7:1535" file="f7" line="1535" offset="480"/>
  <Field id="_3983" name="epdcch_pdu_rel12" type="_293" context="_346" access="public" location="f7:1536" file="f7" line="1536" offset="528"/>
  <Field id="_3984" name="epdcch_pdu_rel13" type="_299" context="_346" access="public" location="f7:1537" file="f7" line="1537" offset="624"/>
  <Field id="_3985" name="epdcch_params_rel11" type="_343" context="_346" access="public" location="f7:1538" file="f7" line="1538" offset="14256"/>
  <Field id="_3986" name="epdcch_params_rel13" type="_345" context="_346" access="public" location="f7:1539" file="f7" line="1539" offset="14544"/>
  <Field id="_3987" name="tl" type="_111" context="_348" access="public" location="f7:1544" file="f7" line="1544" offset="0"/>
  <Field id="_3988" name="mpdcch_narrow_band" type="_9" context="_348" access="public" location="f7:1545" file="f7" line="1545" offset="32"/>
  <Field id="_3989" name="number_of_prb_pairs" type="_9" context="_348" access="public" location="f7:1546" file="f7" line="1546" offset="40"/>
  <Field id="_3990" name="resource_block_assignment" type="_9" context="_348" access="public" location="f7:1547" file="f7" line="1547" offset="48"/>
  <Field id="_3991" name="mpdcch_tansmission_type" type="_9" context="_348" access="public" location="f7:1548" file="f7" line="1548" offset="56"/>
  <Field id="_3992" name="start_symbol" type="_9" context="_348" access="public" location="f7:1549" file="f7" line="1549" offset="64"/>
  <Field id="_3993" name="ecce_index" type="_9" context="_348" access="public" location="f7:1550" file="f7" line="1550" offset="72"/>
  <Field id="_3994" name="aggregation_level" type="_9" context="_348" access="public" location="f7:1551" file="f7" line="1551" offset="80"/>
  <Field id="_3995" name="rnti_type" type="_9" context="_348" access="public" location="f7:1552" file="f7" line="1552" offset="88"/>
  <Field id="_3996" name="rnti" type="_10" context="_348" access="public" location="f7:1553" file="f7" line="1553" offset="96"/>
  <Field id="_3997" name="ce_mode" type="_9" context="_348" access="public" location="f7:1554" file="f7" line="1554" offset="112"/>
  <Field id="_3998" name="drms_scrambling_init" type="_10" context="_348" access="public" location="f7:1555" file="f7" line="1555" offset="128"/>
  <Field id="_3999" name="initial_transmission_sf_io" type="_10" context="_348" access="public" location="f7:1556" file="f7" line="1556" offset="144"/>
  <Field id="_4000" name="transmission_power" type="_10" context="_348" access="public" location="f7:1557" file="f7" line="1557" offset="160"/>
  <Field id="_4001" name="dci_format" type="_9" context="_348" access="public" location="f7:1558" file="f7" line="1558" offset="176"/>
  <Field id="_4002" name="resource_block_coding" type="_10" context="_348" access="public" location="f7:1559" file="f7" line="1559" offset="192"/>
  <Field id="_4003" name="mcs" type="_9" context="_348" access="public" location="f7:1560" file="f7" line="1560" offset="208"/>
  <Field id="_4004" name="pdsch_reptition_levels" type="_9" context="_348" access="public" location="f7:1561" file="f7" line="1561" offset="216"/>
  <Field id="_4005" name="redundancy_version" type="_9" context="_348" access="public" location="f7:1562" file="f7" line="1562" offset="224"/>
  <Field id="_4006" name="new_data_indicator" type="_9" context="_348" access="public" location="f7:1563" file="f7" line="1563" offset="232"/>
  <Field id="_4007" name="harq_process" type="_9" context="_348" access="public" location="f7:1564" file="f7" line="1564" offset="240"/>
  <Field id="_4008" name="tpmi_length" type="_9" context="_348" access="public" location="f7:1565" file="f7" line="1565" offset="248"/>
  <Field id="_4009" name="tpmi" type="_9" context="_348" access="public" location="f7:1566" file="f7" line="1566" offset="256"/>
  <Field id="_4010" name="pmi_flag" type="_9" context="_348" access="public" location="f7:1567" file="f7" line="1567" offset="264"/>
  <Field id="_4011" name="pmi" type="_9" context="_348" access="public" location="f7:1568" file="f7" line="1568" offset="272"/>
  <Field id="_4012" name="harq_resource_offset" type="_9" context="_348" access="public" location="f7:1569" file="f7" line="1569" offset="280"/>
  <Field id="_4013" name="dci_subframe_repetition_number" type="_9" context="_348" access="public" location="f7:1570" file="f7" line="1570" offset="288"/>
  <Field id="_4014" name="tpc" type="_9" context="_348" access="public" location="f7:1571" file="f7" line="1571" offset="296"/>
  <Field id="_4015" name="downlink_assignment_index_length" type="_9" context="_348" access="public" location="f7:1572" file="f7" line="1572" offset="304"/>
  <Field id="_4016" name="downlink_assignment_index" type="_9" context="_348" access="public" location="f7:1573" file="f7" line="1573" offset="312"/>
  <Field id="_4017" name="allocate_prach_flag" type="_9" context="_348" access="public" location="f7:1574" file="f7" line="1574" offset="320"/>
  <Field id="_4018" name="preamble_index" type="_9" context="_348" access="public" location="f7:1575" file="f7" line="1575" offset="328"/>
  <Field id="_4019" name="prach_mask_index" type="_9" context="_348" access="public" location="f7:1576" file="f7" line="1576" offset="336"/>
  <Field id="_4020" name="starting_ce_level" type="_9" context="_348" access="public" location="f7:1577" file="f7" line="1577" offset="344"/>
  <Field id="_4021" name="srs_request" type="_9" context="_348" access="public" location="f7:1578" file="f7" line="1578" offset="352"/>
  <Field id="_4022" name="antenna_ports_and_scrambling_identity_flag" type="_9" context="_348" access="public" location="f7:1579" file="f7" line="1579" offset="360"/>
  <Field id="_4023" name="antenna_ports_and_scrambling_identity" type="_9" context="_348" access="public" location="f7:1580" file="f7" line="1580" offset="368"/>
  <Field id="_4024" name="frequency_hopping_enabled_flag" type="_9" context="_348" access="public" location="f7:1581" file="f7" line="1581" offset="376"/>
  <Field id="_4025" name="paging_direct_indication_differentiation_flag" type="_9" context="_348" access="public" location="f7:1582" file="f7" line="1582" offset="384"/>
  <Field id="_4026" name="direct_indication" type="_9" context="_348" access="public" location="f7:1583" file="f7" line="1583" offset="392"/>
  <Field id="_4027" name="total_dci_length_including_padding" type="_9" context="_348" access="public" location="f7:1584" file="f7" line="1584" offset="400"/>
  <Field id="_4028" name="number_of_tx_antenna_ports" type="_9" context="_348" access="public" location="f7:1585" file="f7" line="1585" offset="408"/>
  <Field id="_4029" name="precoding_value" type="_7673" context="_348" access="public" location="f7:1586" file="f7" line="1586" offset="416"/>
  <Field id="_4030" name="mpdcch_pdu_rel13" type="_349" context="_350" access="public" location="f7:1592" file="f7" line="1592" offset="0"/>
  <Field id="_4031" name="tl" type="_111" context="_352" access="public" location="f7:1596" file="f7" line="1596" offset="0"/>
  <Field id="_4032" name="length" type="_10" context="_352" access="public" location="f7:1597" file="f7" line="1597" offset="32"/>
  <Field id="_4033" name="pdu_index" type="_10" context="_352" access="public" location="f7:1598" file="f7" line="1598" offset="48"/>
  <Field id="_4034" name="transmission_power" type="_10" context="_352" access="public" location="f7:1599" file="f7" line="1599" offset="64"/>
  <Field id="_4035" name="hyper_sfn_2_lsbs" type="_10" context="_352" access="public" location="f7:1600" file="f7" line="1600" offset="80"/>
  <Field id="_4036" name="nbch_pdu_rel13" type="_353" context="_354" access="public" location="f7:1606" file="f7" line="1606" offset="0"/>
  <Field id="_4037" name="tl" type="_111" context="_356" access="public" location="f7:1610" file="f7" line="1610" offset="0"/>
  <Field id="_4038" name="length" type="_10" context="_356" access="public" location="f7:1611" file="f7" line="1611" offset="32"/>
  <Field id="_4039" name="pdu_index" type="_10" context="_356" access="public" location="f7:1612" file="f7" line="1612" offset="48"/>
  <Field id="_4040" name="ncce_index" type="_9" context="_356" access="public" location="f7:1613" file="f7" line="1613" offset="64"/>
  <Field id="_4041" name="aggregation_level" type="_9" context="_356" access="public" location="f7:1614" file="f7" line="1614" offset="72"/>
  <Field id="_4042" name="start_symbol" type="_9" context="_356" access="public" location="f7:1615" file="f7" line="1615" offset="80"/>
  <Field id="_4043" name="rnti_type" type="_9" context="_356" access="public" location="f7:1616" file="f7" line="1616" offset="88"/>
  <Field id="_4044" name="rnti" type="_10" context="_356" access="public" location="f7:1617" file="f7" line="1617" offset="96"/>
  <Field id="_4045" name="scrambling_reinitialization_batch_index" type="_9" context="_356" access="public" location="f7:1618" file="f7" line="1618" offset="112"/>
  <Field id="_4046" name="nrs_antenna_ports_assumed_by_the_ue" type="_9" context="_356" access="public" location="f7:1619" file="f7" line="1619" offset="120"/>
  <Field id="_4047" name="dci_format" type="_9" context="_356" access="public" location="f7:1620" file="f7" line="1620" offset="128"/>
  <Field id="_4048" name="scheduling_delay" type="_9" context="_356" access="public" location="f7:1621" file="f7" line="1621" offset="136"/>
  <Field id="_4049" name="resource_assignment" type="_9" context="_356" access="public" location="f7:1622" file="f7" line="1622" offset="144"/>
  <Field id="_4050" name="repetition_number" type="_9" context="_356" access="public" location="f7:1623" file="f7" line="1623" offset="152"/>
  <Field id="_4051" name="mcs" type="_9" context="_356" access="public" location="f7:1624" file="f7" line="1624" offset="160"/>
  <Field id="_4052" name="new_data_indicator" type="_9" context="_356" access="public" location="f7:1625" file="f7" line="1625" offset="168"/>
  <Field id="_4053" name="harq_ack_resource" type="_9" context="_356" access="public" location="f7:1626" file="f7" line="1626" offset="176"/>
  <Field id="_4054" name="npdcch_order_indication" type="_9" context="_356" access="public" location="f7:1627" file="f7" line="1627" offset="184"/>
  <Field id="_4055" name="starting_number_of_nprach_repetitions" type="_9" context="_356" access="public" location="f7:1628" file="f7" line="1628" offset="192"/>
  <Field id="_4056" name="subcarrier_indication_of_nprach" type="_9" context="_356" access="public" location="f7:1629" file="f7" line="1629" offset="200"/>
  <Field id="_4057" name="paging_direct_indication_differentation_flag" type="_9" context="_356" access="public" location="f7:1630" file="f7" line="1630" offset="208"/>
  <Field id="_4058" name="direct_indication" type="_9" context="_356" access="public" location="f7:1631" file="f7" line="1631" offset="216"/>
  <Field id="_4059" name="dci_subframe_repetition_number" type="_9" context="_356" access="public" location="f7:1632" file="f7" line="1632" offset="224"/>
  <Field id="_4060" name="total_dci_length_including_padding" type="_9" context="_356" access="public" location="f7:1633" file="f7" line="1633" offset="232"/>
  <Field id="_4061" name="npdcch_pdu_rel13" type="_357" context="_358" access="public" location="f7:1639" file="f7" line="1639" offset="0"/>
  <Field id="_4062" name="tl" type="_111" context="_360" access="public" location="f7:1643" file="f7" line="1643" offset="0"/>
  <Field id="_4063" name="length" type="_10" context="_360" access="public" location="f7:1644" file="f7" line="1644" offset="32"/>
  <Field id="_4064" name="pdu_index" type="_10" context="_360" access="public" location="f7:1645" file="f7" line="1645" offset="48"/>
  <Field id="_4065" name="start_symbol" type="_9" context="_360" access="public" location="f7:1646" file="f7" line="1646" offset="64"/>
  <Field id="_4066" name="rnti_type" type="_9" context="_360" access="public" location="f7:1647" file="f7" line="1647" offset="72"/>
  <Field id="_4067" name="rnti" type="_10" context="_360" access="public" location="f7:1648" file="f7" line="1648" offset="80"/>
  <Field id="_4068" name="resource_assignment" type="_10" context="_360" access="public" location="f7:1649" file="f7" line="1649" offset="96"/>
  <Field id="_4069" name="repetition_number" type="_10" context="_360" access="public" location="f7:1650" file="f7" line="1650" offset="112"/>
  <Field id="_4070" name="modulation" type="_9" context="_360" access="public" location="f7:1651" file="f7" line="1651" offset="128"/>
  <Field id="_4071" name="number_of_subframes_for_resource_assignment" type="_9" context="_360" access="public" location="f7:1652" file="f7" line="1652" offset="136"/>
  <Field id="_4072" name="scrambling_sequence_initialization_cinit" type="_9" context="_360" access="public" location="f7:1653" file="f7" line="1653" offset="144"/>
  <Field id="_4073" name="sf_idx" type="_10" context="_360" access="public" location="f7:1654" file="f7" line="1654" offset="160"/>
  <Field id="_4074" name="nrs_antenna_ports_assumed_by_the_ue" type="_9" context="_360" access="public" location="f7:1655" file="f7" line="1655" offset="176"/>
  <Field id="_4075" name="ndlsch_pdu_rel13" type="_361" context="_362" access="public" location="f7:1661" file="f7" line="1661" offset="0"/>
  <Field id="_4076" name="pdu_type" type="_9" context="_364" access="public" location="f7:1666" file="f7" line="1666" offset="0"/>
  <Field id="_4077" name="pdu_size" type="_9" context="_364" access="public" location="f7:1667" file="f7" line="1667" offset="8"/>
  <Union id="_4078" context="_364" access="public" location="f7:1668" file="f7" line="1668" members="_7680 _7681 _7682 _7683 _7684 _7685 _7686 _7687 _7688 _7689 _7690 _7691" size="14592" align="32"/>
  <Field id="_4079" name="" type="_4078" context="_364" access="public" location="f7:1668" file="f7" line="1668" offset="32"/>
  <Unimplemented id="_4080" kind="IndirectField"/>
  <Unimplemented id="_4081" kind="IndirectField"/>
  <Unimplemented id="_4082" kind="IndirectField"/>
  <Unimplemented id="_4083" kind="IndirectField"/>
  <Unimplemented id="_4084" kind="IndirectField"/>
  <Unimplemented id="_4085" kind="IndirectField"/>
  <Unimplemented id="_4086" kind="IndirectField"/>
  <Unimplemented id="_4087" kind="IndirectField"/>
  <Unimplemented id="_4088" kind="IndirectField"/>
  <Unimplemented id="_4089" kind="IndirectField"/>
  <Unimplemented id="_4090" kind="IndirectField"/>
  <Unimplemented id="_4091" kind="IndirectField"/>
  <Field id="_4092" name="tl" type="_111" context="_366" access="public" location="f7:1686" file="f7" line="1686" offset="0"/>
  <Field id="_4093" name="number_pdcch_ofdm_symbols" type="_9" context="_366" access="public" location="f7:1687" file="f7" line="1687" offset="32"/>
  <Field id="_4094" name="number_dci" type="_9" context="_366" access="public" location="f7:1688" file="f7" line="1688" offset="40"/>
  <Field id="_4095" name="number_pdu" type="_10" context="_366" access="public" location="f7:1689" file="f7" line="1689" offset="48"/>
  <Field id="_4096" name="number_pdsch_rnti" type="_9" context="_366" access="public" location="f7:1690" file="f7" line="1690" offset="64"/>
  <Field id="_4097" name="transmission_power_pcfich" type="_10" context="_366" access="public" location="f7:1691" file="f7" line="1691" offset="80"/>
  <Field id="_4098" name="dl_config_pdu_list" type="_7692" context="_366" access="public" location="f7:1692" file="f7" line="1692" offset="128"/>
  <Field id="_4099" name="tl" type="_111" context="_368" access="public" location="f7:1697" file="f7" line="1697" offset="0"/>
  <Field id="_4100" name="handle" type="_11" context="_368" access="public" location="f7:1698" file="f7" line="1698" offset="32"/>
  <Field id="_4101" name="size" type="_10" context="_368" access="public" location="f7:1699" file="f7" line="1699" offset="64"/>
  <Field id="_4102" name="rnti" type="_10" context="_368" access="public" location="f7:1700" file="f7" line="1700" offset="80"/>
  <Field id="_4103" name="resource_block_start" type="_9" context="_368" access="public" location="f7:1701" file="f7" line="1701" offset="96"/>
  <Field id="_4104" name="number_of_resource_blocks" type="_9" context="_368" access="public" location="f7:1702" file="f7" line="1702" offset="104"/>
  <Field id="_4105" name="modulation_type" type="_9" context="_368" access="public" location="f7:1703" file="f7" line="1703" offset="112"/>
  <Field id="_4106" name="cyclic_shift_2_for_drms" type="_9" context="_368" access="public" location="f7:1704" file="f7" line="1704" offset="120"/>
  <Field id="_4107" name="frequency_hopping_enabled_flag" type="_9" context="_368" access="public" location="f7:1705" file="f7" line="1705" offset="128"/>
  <Field id="_4108" name="frequency_hopping_bits" type="_9" context="_368" access="public" location="f7:1706" file="f7" line="1706" offset="136"/>
  <Field id="_4109" name="new_data_indication" type="_9" context="_368" access="public" location="f7:1707" file="f7" line="1707" offset="144"/>
  <Field id="_4110" name="redundancy_version" type="_9" context="_368" access="public" location="f7:1708" file="f7" line="1708" offset="152"/>
  <Field id="_4111" name="harq_process_number" type="_9" context="_368" access="public" location="f7:1709" file="f7" line="1709" offset="160"/>
  <Field id="_4112" name="ul_tx_mode" type="_9" context="_368" access="public" location="f7:1710" file="f7" line="1710" offset="168"/>
  <Field id="_4113" name="current_tx_nb" type="_9" context="_368" access="public" location="f7:1711" file="f7" line="1711" offset="176"/>
  <Field id="_4114" name="n_srs" type="_9" context="_368" access="public" location="f7:1712" file="f7" line="1712" offset="184"/>
  <Field id="_4115" name="tl" type="_111" context="_370" access="public" location="f7:1717" file="f7" line="1717" offset="0"/>
  <Field id="_4116" name="resource_allocation_type" type="_9" context="_370" access="public" location="f7:1718" file="f7" line="1718" offset="32"/>
  <Field id="_4117" name="resource_block_coding" type="_11" context="_370" access="public" location="f7:1719" file="f7" line="1719" offset="64"/>
  <Field id="_4118" name="transport_blocks" type="_9" context="_370" access="public" location="f7:1720" file="f7" line="1720" offset="96"/>
  <Field id="_4119" name="transmission_scheme" type="_9" context="_370" access="public" location="f7:1721" file="f7" line="1721" offset="104"/>
  <Field id="_4120" name="number_of_layers" type="_9" context="_370" access="public" location="f7:1722" file="f7" line="1722" offset="112"/>
  <Field id="_4121" name="codebook_index" type="_9" context="_370" access="public" location="f7:1723" file="f7" line="1723" offset="120"/>
  <Field id="_4122" name="disable_sequence_hopping_flag" type="_9" context="_370" access="public" location="f7:1724" file="f7" line="1724" offset="128"/>
  <Field id="_4123" name="tl" type="_111" context="_372" access="public" location="f7:1730" file="f7" line="1730" offset="0"/>
  <Field id="_4124" name="virtual_cell_id_enabled_flag" type="_9" context="_372" access="public" location="f7:1731" file="f7" line="1731" offset="32"/>
  <Field id="_4125" name="npusch_identity" type="_10" context="_372" access="public" location="f7:1732" file="f7" line="1732" offset="48"/>
  <Field id="_4126" name="dmrs_config_flag" type="_9" context="_372" access="public" location="f7:1733" file="f7" line="1733" offset="64"/>
  <Field id="_4127" name="ndmrs_csh_identity" type="_10" context="_372" access="public" location="f7:1734" file="f7" line="1734" offset="80"/>
  <Field id="_4128" name="tl" type="_111" context="_374" access="public" location="f7:1740" file="f7" line="1740" offset="0"/>
  <Field id="_4129" name="ue_type" type="_9" context="_374" access="public" location="f7:1741" file="f7" line="1741" offset="32"/>
  <Field id="_4130" name="total_number_of_repetitions" type="_10" context="_374" access="public" location="f7:1742" file="f7" line="1742" offset="48"/>
  <Field id="_4131" name="repetition_number" type="_10" context="_374" access="public" location="f7:1743" file="f7" line="1743" offset="64"/>
  <Field id="_4132" name="initial_transmission_sf_io" type="_10" context="_374" access="public" location="f7:1744" file="f7" line="1744" offset="80"/>
  <Field id="_4133" name="empty_symbols_due_to_re_tunning" type="_9" context="_374" access="public" location="f7:1745" file="f7" line="1745" offset="96"/>
  <Field id="_4134" name="ulsch_pdu_rel8" type="_369" context="_376" access="public" location="f7:1750" file="f7" line="1750" offset="0"/>
  <Field id="_4135" name="ulsch_pdu_rel10" type="_371" context="_376" access="public" location="f7:1751" file="f7" line="1751" offset="192"/>
  <Field id="_4136" name="ulsch_pdu_rel11" type="_373" context="_376" access="public" location="f7:1752" file="f7" line="1752" offset="352"/>
  <Field id="_4137" name="ulsch_pdu_rel13" type="_375" context="_376" access="public" location="f7:1753" file="f7" line="1753" offset="448"/>
  <Field id="_4138" name="tl" type="_111" context="_378" access="public" location="f7:1757" file="f7" line="1757" offset="0"/>
  <Field id="_4139" name="dl_cqi_pmi_size_rank_1" type="_9" context="_378" access="public" location="f7:1758" file="f7" line="1758" offset="32"/>
  <Field id="_4140" name="dl_cqi_pmi_size_rank_greater_1" type="_9" context="_378" access="public" location="f7:1759" file="f7" line="1759" offset="40"/>
  <Field id="_4141" name="ri_size" type="_9" context="_378" access="public" location="f7:1760" file="f7" line="1760" offset="48"/>
  <Field id="_4142" name="delta_offset_cqi" type="_9" context="_378" access="public" location="f7:1761" file="f7" line="1761" offset="56"/>
  <Field id="_4143" name="delta_offset_ri" type="_9" context="_378" access="public" location="f7:1762" file="f7" line="1762" offset="64"/>
  <Field id="_4144" name="dl_cqi_pmi_ri_size" type="_9" context="_380" access="public" location="f7:1767" file="f7" line="1767" offset="0"/>
  <Field id="_4145" name="control_type" type="_9" context="_380" access="public" location="f7:1768" file="f7" line="1768" offset="8"/>
  <Field id="_4146" name="number_of_cc" type="_9" context="_382" access="public" location="f7:1772" file="f7" line="1772" offset="0"/>
  <Struct id="_4147" name="" context="_382" access="public" location="f7:1773" file="f7" line="1773" members="_7693 _7694" size="72" align="8"/>
  <Field id="_4148" name="cc" type="_7695" context="_382" access="public" location="f7:1776" file="f7" line="1776" offset="8"/>
  <Field id="_4149" name="tl" type="_111" context="_384" access="public" location="f7:1780" file="f7" line="1780" offset="0"/>
  <Field id="_4150" name="report_type" type="_9" context="_384" access="public" location="f7:1781" file="f7" line="1781" offset="32"/>
  <Field id="_4151" name="delta_offset_cqi" type="_9" context="_384" access="public" location="f7:1782" file="f7" line="1782" offset="40"/>
  <Field id="_4152" name="delta_offset_ri" type="_9" context="_384" access="public" location="f7:1783" file="f7" line="1783" offset="48"/>
  <Union id="_4153" context="_384" access="public" location="f7:1784" file="f7" line="1784" members="_7696 _7697" size="80" align="8"/>
  <Field id="_4154" name="" type="_4153" context="_384" access="public" location="f7:1784" file="f7" line="1784" offset="56"/>
  <Unimplemented id="_4155" kind="IndirectField"/>
  <Unimplemented id="_4156" kind="IndirectField"/>
  <Field id="_4157" name="dl_cqi_pmi_ri_size_2" type="_10" context="_386" access="public" location="f7:1792" file="f7" line="1792" offset="0"/>
  <Field id="_4158" name="tl" type="_111" context="_390" access="public" location="f7:1799" file="f7" line="1799" offset="0"/>
  <Field id="_4159" name="report_type" type="_9" context="_390" access="public" location="f7:1800" file="f7" line="1800" offset="32"/>
  <Union id="_4160" context="_390" access="public" location="f7:1801" file="f7" line="1801" members="_7698 _7699" size="16" align="16"/>
  <Field id="_4161" name="" type="_4160" context="_390" access="public" location="f7:1801" file="f7" line="1801" offset="48"/>
  <Unimplemented id="_4162" kind="IndirectField"/>
  <Unimplemented id="_4163" kind="IndirectField"/>
  <Field id="_4164" name="cqi_ri_information_rel8" type="_379" context="_392" access="public" location="f7:1809" file="f7" line="1809" offset="0"/>
  <Field id="_4165" name="cqi_ri_information_rel9" type="_385" context="_392" access="public" location="f7:1810" file="f7" line="1810" offset="80"/>
  <Field id="_4166" name="cqi_ri_information_rel13" type="_391" context="_392" access="public" location="f7:1811" file="f7" line="1811" offset="224"/>
  <Field id="_4167" name="tl" type="_111" context="_394" access="public" location="f7:1815" file="f7" line="1815" offset="0"/>
  <Field id="_4168" name="harq_size" type="_9" context="_394" access="public" location="f7:1816" file="f7" line="1816" offset="32"/>
  <Field id="_4169" name="delta_offset_harq" type="_9" context="_394" access="public" location="f7:1817" file="f7" line="1817" offset="40"/>
  <Field id="_4170" name="ack_nack_mode" type="_9" context="_394" access="public" location="f7:1818" file="f7" line="1818" offset="48"/>
  <Field id="_4171" name="tl" type="_111" context="_396" access="public" location="f7:1823" file="f7" line="1823" offset="0"/>
  <Field id="_4172" name="harq_size_2" type="_10" context="_396" access="public" location="f7:1824" file="f7" line="1824" offset="32"/>
  <Field id="_4173" name="delta_offset_harq_2" type="_9" context="_396" access="public" location="f7:1825" file="f7" line="1825" offset="48"/>
  <Field id="_4174" name="harq_information_rel10" type="_395" context="_398" access="public" location="f7:1830" file="f7" line="1830" offset="0"/>
  <Field id="_4175" name="harq_information_rel13" type="_397" context="_398" access="public" location="f7:1831" file="f7" line="1831" offset="64"/>
  <Field id="_4176" name="tl" type="_111" context="_400" access="public" location="f7:1835" file="f7" line="1835" offset="0"/>
  <Field id="_4177" name="n_srs_initial" type="_9" context="_400" access="public" location="f7:1836" file="f7" line="1836" offset="32"/>
  <Field id="_4178" name="initial_number_of_resource_blocks" type="_9" context="_400" access="public" location="f7:1837" file="f7" line="1837" offset="40"/>
  <Field id="_4179" name="initial_transmission_parameters_rel8" type="_401" context="_402" access="public" location="f7:1842" file="f7" line="1842" offset="0"/>
  <Field id="_4180" name="ulsch_pdu" type="_377" context="_404" access="public" location="f7:1846" file="f7" line="1846" offset="0"/>
  <Field id="_4181" name="cqi_ri_information" type="_393" context="_404" access="public" location="f7:1847" file="f7" line="1847" offset="576"/>
  <Field id="_4182" name="initial_transmission_parameters" type="_403" context="_404" access="public" location="f7:1848" file="f7" line="1848" offset="864"/>
  <Field id="_4183" name="ulsch_pdu" type="_377" context="_406" access="public" location="f7:1852" file="f7" line="1852" offset="0"/>
  <Field id="_4184" name="harq_information" type="_399" context="_406" access="public" location="f7:1853" file="f7" line="1853" offset="576"/>
  <Field id="_4185" name="initial_transmission_parameters" type="_403" context="_406" access="public" location="f7:1854" file="f7" line="1854" offset="704"/>
  <Field id="_4186" name="ulsch_pdu" type="_377" context="_408" access="public" location="f7:1858" file="f7" line="1858" offset="0"/>
  <Field id="_4187" name="cqi_ri_information" type="_393" context="_408" access="public" location="f7:1859" file="f7" line="1859" offset="576"/>
  <Field id="_4188" name="harq_information" type="_399" context="_408" access="public" location="f7:1860" file="f7" line="1860" offset="864"/>
  <Field id="_4189" name="initial_transmission_parameters" type="_403" context="_408" access="public" location="f7:1861" file="f7" line="1861" offset="992"/>
  <Field id="_4190" name="tl" type="_111" context="_410" access="public" location="f7:1866" file="f7" line="1866" offset="0"/>
  <Field id="_4191" name="handle" type="_11" context="_410" access="public" location="f7:1867" file="f7" line="1867" offset="32"/>
  <Field id="_4192" name="rnti" type="_10" context="_410" access="public" location="f7:1868" file="f7" line="1868" offset="64"/>
  <Field id="_4193" name="tl" type="_111" context="_412" access="public" location="f7:1873" file="f7" line="1873" offset="0"/>
  <Field id="_4194" name="virtual_cell_id_enabled_flag" type="_9" context="_412" access="public" location="f7:1874" file="f7" line="1874" offset="32"/>
  <Field id="_4195" name="npusch_identity" type="_10" context="_412" access="public" location="f7:1875" file="f7" line="1875" offset="48"/>
  <Field id="_4196" name="tl" type="_111" context="_414" access="public" location="f7:1881" file="f7" line="1881" offset="0"/>
  <Field id="_4197" name="ue_type" type="_9" context="_414" access="public" location="f7:1882" file="f7" line="1882" offset="32"/>
  <Field id="_4198" name="empty_symbols" type="_9" context="_414" access="public" location="f7:1883" file="f7" line="1883" offset="40"/>
  <Field id="_4199" name="total_number_of_repetitions" type="_10" context="_414" access="public" location="f7:1884" file="f7" line="1884" offset="48"/>
  <Field id="_4200" name="repetition_number" type="_10" context="_414" access="public" location="f7:1885" file="f7" line="1885" offset="64"/>
  <Field id="_4201" name="ue_information_rel8" type="_411" context="_416" access="public" location="f7:1891" file="f7" line="1891" offset="0"/>
  <Field id="_4202" name="ue_information_rel11" type="_413" context="_416" access="public" location="f7:1892" file="f7" line="1892" offset="96"/>
  <Field id="_4203" name="ue_information_rel13" type="_415" context="_416" access="public" location="f7:1893" file="f7" line="1893" offset="160"/>
  <Field id="_4204" name="tl" type="_111" context="_418" access="public" location="f7:1897" file="f7" line="1897" offset="0"/>
  <Field id="_4205" name="pucch_index" type="_10" context="_418" access="public" location="f7:1898" file="f7" line="1898" offset="32"/>
  <Field id="_4206" name="dl_cqi_pmi_size" type="_9" context="_418" access="public" location="f7:1899" file="f7" line="1899" offset="48"/>
  <Field id="_4207" name="tl" type="_111" context="_420" access="public" location="f7:1904" file="f7" line="1904" offset="0"/>
  <Field id="_4208" name="number_of_pucch_resource" type="_9" context="_420" access="public" location="f7:1905" file="f7" line="1905" offset="32"/>
  <Field id="_4209" name="pucch_index_p1" type="_10" context="_420" access="public" location="f7:1906" file="f7" line="1906" offset="48"/>
  <Field id="_4210" name="tl" type="_111" context="_422" access="public" location="f7:1911" file="f7" line="1911" offset="0"/>
  <Field id="_4211" name="csi_mode" type="_9" context="_422" access="public" location="f7:1912" file="f7" line="1912" offset="32"/>
  <Field id="_4212" name="dl_cqi_pmi_size_2" type="_10" context="_422" access="public" location="f7:1913" file="f7" line="1913" offset="48"/>
  <Field id="_4213" name="starting_prb" type="_9" context="_422" access="public" location="f7:1914" file="f7" line="1914" offset="64"/>
  <Field id="_4214" name="n_prb" type="_9" context="_422" access="public" location="f7:1915" file="f7" line="1915" offset="72"/>
  <Field id="_4215" name="cdm_index" type="_9" context="_422" access="public" location="f7:1916" file="f7" line="1916" offset="80"/>
  <Field id="_4216" name="n_srs" type="_9" context="_422" access="public" location="f7:1917" file="f7" line="1917" offset="88"/>
  <Field id="_4217" name="cqi_information_rel8" type="_419" context="_424" access="public" location="f7:1922" file="f7" line="1922" offset="0"/>
  <Field id="_4218" name="cqi_information_rel10" type="_421" context="_424" access="public" location="f7:1923" file="f7" line="1923" offset="64"/>
  <Field id="_4219" name="cqi_information_rel13" type="_423" context="_424" access="public" location="f7:1924" file="f7" line="1924" offset="128"/>
  <Field id="_4220" name="tl" type="_111" context="_426" access="public" location="f7:1928" file="f7" line="1928" offset="0"/>
  <Field id="_4221" name="pucch_index" type="_10" context="_426" access="public" location="f7:1929" file="f7" line="1929" offset="32"/>
  <Field id="_4222" name="tl" type="_111" context="_428" access="public" location="f7:1934" file="f7" line="1934" offset="0"/>
  <Field id="_4223" name="number_of_pucch_resources" type="_9" context="_428" access="public" location="f7:1935" file="f7" line="1935" offset="32"/>
  <Field id="_4224" name="pucch_index_p1" type="_10" context="_428" access="public" location="f7:1936" file="f7" line="1936" offset="48"/>
  <Field id="_4225" name="sr_information_rel8" type="_427" context="_430" access="public" location="f7:1941" file="f7" line="1941" offset="0"/>
  <Field id="_4226" name="sr_information_rel10" type="_429" context="_430" access="public" location="f7:1942" file="f7" line="1942" offset="48"/>
  <Field id="_4227" name="tl" type="_111" context="_432" access="public" location="f7:1946" file="f7" line="1946" offset="0"/>
  <Field id="_4228" name="harq_size" type="_9" context="_432" access="public" location="f7:1947" file="f7" line="1947" offset="32"/>
  <Field id="_4229" name="ack_nack_mode" type="_9" context="_432" access="public" location="f7:1948" file="f7" line="1948" offset="40"/>
  <Field id="_4230" name="number_of_pucch_resources" type="_9" context="_432" access="public" location="f7:1949" file="f7" line="1949" offset="48"/>
  <Field id="_4231" name="n_pucch_1_0" type="_10" context="_432" access="public" location="f7:1950" file="f7" line="1950" offset="64"/>
  <Field id="_4232" name="n_pucch_1_1" type="_10" context="_432" access="public" location="f7:1951" file="f7" line="1951" offset="80"/>
  <Field id="_4233" name="n_pucch_1_2" type="_10" context="_432" access="public" location="f7:1952" file="f7" line="1952" offset="96"/>
  <Field id="_4234" name="n_pucch_1_3" type="_10" context="_432" access="public" location="f7:1953" file="f7" line="1953" offset="112"/>
  <Field id="_4235" name="tl" type="_111" context="_434" access="public" location="f7:1959" file="f7" line="1959" offset="0"/>
  <Field id="_4236" name="n_pucch_1_0" type="_10" context="_434" access="public" location="f7:1960" file="f7" line="1960" offset="32"/>
  <Field id="_4237" name="harq_size" type="_9" context="_434" access="public" location="f7:1961" file="f7" line="1961" offset="48"/>
  <Field id="_4238" name="tl" type="_111" context="_436" access="public" location="f7:1966" file="f7" line="1966" offset="0"/>
  <Field id="_4239" name="harq_size" type="_9" context="_436" access="public" location="f7:1967" file="f7" line="1967" offset="32"/>
  <Field id="_4240" name="ack_nack_mode" type="_9" context="_436" access="public" location="f7:1968" file="f7" line="1968" offset="40"/>
  <Field id="_4241" name="number_of_pucch_resources" type="_9" context="_436" access="public" location="f7:1969" file="f7" line="1969" offset="48"/>
  <Field id="_4242" name="n_pucch_1_0" type="_10" context="_436" access="public" location="f7:1970" file="f7" line="1970" offset="64"/>
  <Field id="_4243" name="n_pucch_1_1" type="_10" context="_436" access="public" location="f7:1971" file="f7" line="1971" offset="80"/>
  <Field id="_4244" name="n_pucch_1_2" type="_10" context="_436" access="public" location="f7:1972" file="f7" line="1972" offset="96"/>
  <Field id="_4245" name="n_pucch_1_3" type="_10" context="_436" access="public" location="f7:1973" file="f7" line="1973" offset="112"/>
  <Field id="_4246" name="tl" type="_111" context="_438" access="public" location="f7:1978" file="f7" line="1978" offset="0"/>
  <Field id="_4247" name="num_ant_ports" type="_9" context="_438" access="public" location="f7:1979" file="f7" line="1979" offset="32"/>
  <Field id="_4248" name="n_pucch_2_0" type="_10" context="_438" access="public" location="f7:1980" file="f7" line="1980" offset="48"/>
  <Field id="_4249" name="n_pucch_2_1" type="_10" context="_438" access="public" location="f7:1981" file="f7" line="1981" offset="64"/>
  <Field id="_4250" name="n_pucch_2_2" type="_10" context="_438" access="public" location="f7:1982" file="f7" line="1982" offset="80"/>
  <Field id="_4251" name="n_pucch_2_3" type="_10" context="_438" access="public" location="f7:1983" file="f7" line="1983" offset="96"/>
  <Field id="_4252" name="tl" type="_111" context="_440" access="public" location="f7:1988" file="f7" line="1988" offset="0"/>
  <Field id="_4253" name="harq_size_2" type="_10" context="_440" access="public" location="f7:1989" file="f7" line="1989" offset="32"/>
  <Field id="_4254" name="starting_prb" type="_9" context="_440" access="public" location="f7:1990" file="f7" line="1990" offset="48"/>
  <Field id="_4255" name="n_prb" type="_9" context="_440" access="public" location="f7:1991" file="f7" line="1991" offset="56"/>
  <Field id="_4256" name="cdm_index" type="_9" context="_440" access="public" location="f7:1992" file="f7" line="1992" offset="64"/>
  <Field id="_4257" name="n_srs" type="_9" context="_440" access="public" location="f7:1993" file="f7" line="1993" offset="72"/>
  <Field id="_4258" name="harq_information_rel10_tdd" type="_433" context="_442" access="public" location="f7:1998" file="f7" line="1998" offset="0"/>
  <Field id="_4259" name="harq_information_rel8_fdd" type="_435" context="_442" access="public" location="f7:1999" file="f7" line="1999" offset="128"/>
  <Field id="_4260" name="harq_information_rel9_fdd" type="_437" context="_442" access="public" location="f7:2000" file="f7" line="2000" offset="192"/>
  <Field id="_4261" name="harq_information_rel11" type="_439" context="_442" access="public" location="f7:2001" file="f7" line="2001" offset="320"/>
  <Field id="_4262" name="harq_information_rel13" type="_441" context="_442" access="public" location="f7:2002" file="f7" line="2002" offset="432"/>
  <Field id="_4263" name="tl" type="_111" context="_444" access="public" location="f7:2006" file="f7" line="2006" offset="0"/>
  <Field id="_4264" name="handle" type="_11" context="_444" access="public" location="f7:2007" file="f7" line="2007" offset="32"/>
  <Field id="_4265" name="size" type="_10" context="_444" access="public" location="f7:2008" file="f7" line="2008" offset="64"/>
  <Field id="_4266" name="rnti" type="_10" context="_444" access="public" location="f7:2009" file="f7" line="2009" offset="80"/>
  <Field id="_4267" name="srs_bandwidth" type="_9" context="_444" access="public" location="f7:2010" file="f7" line="2010" offset="96"/>
  <Field id="_4268" name="frequency_domain_position" type="_9" context="_444" access="public" location="f7:2011" file="f7" line="2011" offset="104"/>
  <Field id="_4269" name="srs_hopping_bandwidth" type="_9" context="_444" access="public" location="f7:2012" file="f7" line="2012" offset="112"/>
  <Field id="_4270" name="transmission_comb" type="_9" context="_444" access="public" location="f7:2013" file="f7" line="2013" offset="120"/>
  <Field id="_4271" name="i_srs" type="_10" context="_444" access="public" location="f7:2014" file="f7" line="2014" offset="128"/>
  <Field id="_4272" name="sounding_reference_cyclic_shift" type="_9" context="_444" access="public" location="f7:2015" file="f7" line="2015" offset="144"/>
  <Field id="_4273" name="tl" type="_111" context="_446" access="public" location="f7:2020" file="f7" line="2020" offset="0"/>
  <Field id="_4274" name="antenna_port" type="_9" context="_446" access="public" location="f7:2021" file="f7" line="2021" offset="32"/>
  <Field id="_4275" name="tl" type="_111" context="_448" access="public" location="f7:2026" file="f7" line="2026" offset="0"/>
  <Field id="_4276" name="number_of_combs" type="_9" context="_448" access="public" location="f7:2027" file="f7" line="2027" offset="32"/>
  <Field id="_4277" name="srs_pdu_rel8" type="_445" context="_450" access="public" location="f7:2032" file="f7" line="2032" offset="0"/>
  <Field id="_4278" name="srs_pdu_rel10" type="_447" context="_450" access="public" location="f7:2033" file="f7" line="2033" offset="160"/>
  <Field id="_4279" name="srs_pdu_rel13" type="_449" context="_450" access="public" location="f7:2034" file="f7" line="2034" offset="208"/>
  <Field id="_4280" name="ue_information" type="_417" context="_452" access="public" location="f7:2038" file="f7" line="2038" offset="0"/>
  <Field id="_4281" name="cqi_information" type="_425" context="_452" access="public" location="f7:2039" file="f7" line="2039" offset="256"/>
  <Field id="_4282" name="ue_information" type="_417" context="_454" access="public" location="f7:2043" file="f7" line="2043" offset="0"/>
  <Field id="_4283" name="sr_information" type="_431" context="_454" access="public" location="f7:2044" file="f7" line="2044" offset="256"/>
  <Field id="_4284" name="ue_information" type="_417" context="_456" access="public" location="f7:2048" file="f7" line="2048" offset="0"/>
  <Field id="_4285" name="harq_information" type="_443" context="_456" access="public" location="f7:2049" file="f7" line="2049" offset="256"/>
  <Field id="_4286" name="ue_information" type="_417" context="_458" access="public" location="f7:2053" file="f7" line="2053" offset="0"/>
  <Field id="_4287" name="sr_information" type="_431" context="_458" access="public" location="f7:2054" file="f7" line="2054" offset="256"/>
  <Field id="_4288" name="harq_information" type="_443" context="_458" access="public" location="f7:2055" file="f7" line="2055" offset="368"/>
  <Field id="_4289" name="ue_information" type="_417" context="_460" access="public" location="f7:2059" file="f7" line="2059" offset="0"/>
  <Field id="_4290" name="cqi_information" type="_425" context="_460" access="public" location="f7:2060" file="f7" line="2060" offset="256"/>
  <Field id="_4291" name="harq_information" type="_443" context="_460" access="public" location="f7:2061" file="f7" line="2061" offset="480"/>
  <Field id="_4292" name="ue_information" type="_417" context="_462" access="public" location="f7:2065" file="f7" line="2065" offset="0"/>
  <Field id="_4293" name="cqi_information" type="_425" context="_462" access="public" location="f7:2066" file="f7" line="2066" offset="256"/>
  <Field id="_4294" name="sr_information" type="_431" context="_462" access="public" location="f7:2067" file="f7" line="2067" offset="480"/>
  <Field id="_4295" name="ue_information" type="_417" context="_464" access="public" location="f7:2071" file="f7" line="2071" offset="0"/>
  <Field id="_4296" name="cqi_information" type="_425" context="_464" access="public" location="f7:2072" file="f7" line="2072" offset="256"/>
  <Field id="_4297" name="sr_information" type="_431" context="_464" access="public" location="f7:2073" file="f7" line="2073" offset="480"/>
  <Field id="_4298" name="harq_information" type="_443" context="_464" access="public" location="f7:2074" file="f7" line="2074" offset="592"/>
  <Field id="_4299" name="ue_information" type="_417" context="_466" access="public" location="f7:2078" file="f7" line="2078" offset="0"/>
  <Field id="_4300" name="ulsch_pdu" type="_377" context="_468" access="public" location="f7:2082" file="f7" line="2082" offset="0"/>
  <Field id="_4301" name="csi_information" type="_425" context="_468" access="public" location="f7:2083" file="f7" line="2083" offset="576"/>
  <Field id="_4302" name="ulsch_pdu" type="_377" context="_470" access="public" location="f7:2087" file="f7" line="2087" offset="0"/>
  <Field id="_4303" name="harq_information" type="_443" context="_470" access="public" location="f7:2088" file="f7" line="2088" offset="576"/>
  <Field id="_4304" name="ulsch_pdu" type="_377" context="_472" access="public" location="f7:2092" file="f7" line="2092" offset="0"/>
  <Field id="_4305" name="csi_information" type="_425" context="_472" access="public" location="f7:2093" file="f7" line="2093" offset="576"/>
  <Field id="_4306" name="harq_information" type="_443" context="_472" access="public" location="f7:2094" file="f7" line="2094" offset="800"/>
  <Field id="_4307" name="tl" type="_111" context="_474" access="public" location="f7:2098" file="f7" line="2098" offset="0"/>
  <Field id="_4308" name="harq_ack_resource" type="_9" context="_474" access="public" location="f7:2099" file="f7" line="2099" offset="32"/>
  <Field id="_4309" name="nb_harq_information_rel13_fdd" type="_475" context="_476" access="public" location="f7:2104" file="f7" line="2104" offset="0"/>
  <Field id="_4310" name="tl" type="_111" context="_478" access="public" location="f7:2108" file="f7" line="2108" offset="0"/>
  <Field id="_4311" name="nulsch_format" type="_9" context="_478" access="public" location="f7:2109" file="f7" line="2109" offset="32"/>
  <Field id="_4312" name="handle" type="_11" context="_478" access="public" location="f7:2110" file="f7" line="2110" offset="64"/>
  <Field id="_4313" name="size" type="_10" context="_478" access="public" location="f7:2111" file="f7" line="2111" offset="96"/>
  <Field id="_4314" name="rnti" type="_10" context="_478" access="public" location="f7:2112" file="f7" line="2112" offset="112"/>
  <Field id="_4315" name="subcarrier_indication" type="_9" context="_478" access="public" location="f7:2113" file="f7" line="2113" offset="128"/>
  <Field id="_4316" name="resource_assignment" type="_9" context="_478" access="public" location="f7:2114" file="f7" line="2114" offset="136"/>
  <Field id="_4317" name="mcs" type="_9" context="_478" access="public" location="f7:2115" file="f7" line="2115" offset="144"/>
  <Field id="_4318" name="redudancy_version" type="_9" context="_478" access="public" location="f7:2116" file="f7" line="2116" offset="152"/>
  <Field id="_4319" name="repetition_number" type="_9" context="_478" access="public" location="f7:2117" file="f7" line="2117" offset="160"/>
  <Field id="_4320" name="new_data_indication" type="_9" context="_478" access="public" location="f7:2118" file="f7" line="2118" offset="168"/>
  <Field id="_4321" name="n_srs" type="_9" context="_478" access="public" location="f7:2119" file="f7" line="2119" offset="176"/>
  <Field id="_4322" name="scrambling_sequence_initialization_cinit" type="_10" context="_478" access="public" location="f7:2120" file="f7" line="2120" offset="192"/>
  <Field id="_4323" name="sf_idx" type="_10" context="_478" access="public" location="f7:2121" file="f7" line="2121" offset="208"/>
  <Field id="_4324" name="ue_information" type="_417" context="_478" access="public" location="f7:2122" file="f7" line="2122" offset="224"/>
  <Field id="_4325" name="nb_harq_information" type="_477" context="_478" access="public" location="f7:2123" file="f7" line="2123" offset="480"/>
  <Field id="_4326" name="nulsch_pdu_rel13" type="_479" context="_480" access="public" location="f7:2128" file="f7" line="2128" offset="0"/>
  <Field id="_4327" name="tl" type="_111" context="_482" access="public" location="f7:2133" file="f7" line="2133" offset="0"/>
  <Field id="_4328" name="nprach_config_0" type="_9" context="_482" access="public" location="f7:2134" file="f7" line="2134" offset="32"/>
  <Field id="_4329" name="nprach_config_1" type="_9" context="_482" access="public" location="f7:2135" file="f7" line="2135" offset="40"/>
  <Field id="_4330" name="nprach_config_2" type="_9" context="_482" access="public" location="f7:2136" file="f7" line="2136" offset="48"/>
  <Field id="_4331" name="nrach_pdu_rel13" type="_483" context="_484" access="public" location="f7:2141" file="f7" line="2141" offset="0"/>
  <Field id="_4332" name="pdu_type" type="_9" context="_486" access="public" location="f7:2145" file="f7" line="2145" offset="0"/>
  <Field id="_4333" name="pdu_size" type="_9" context="_486" access="public" location="f7:2146" file="f7" line="2146" offset="8"/>
  <Union id="_4334" context="_486" access="public" location="f7:2147" file="f7" line="2147" members="_7700 _7701 _7702 _7703 _7704 _7705 _7706 _7707 _7708 _7709 _7710 _7711 _7712 _7713 _7714 _7715 _7716 _7717" size="1312" align="32"/>
  <Field id="_4335" name="" type="_4334" context="_486" access="public" location="f7:2147" file="f7" line="2147" offset="32"/>
  <Unimplemented id="_4336" kind="IndirectField"/>
  <Unimplemented id="_4337" kind="IndirectField"/>
  <Unimplemented id="_4338" kind="IndirectField"/>
  <Unimplemented id="_4339" kind="IndirectField"/>
  <Unimplemented id="_4340" kind="IndirectField"/>
  <Unimplemented id="_4341" kind="IndirectField"/>
  <Unimplemented id="_4342" kind="IndirectField"/>
  <Unimplemented id="_4343" kind="IndirectField"/>
  <Unimplemented id="_4344" kind="IndirectField"/>
  <Unimplemented id="_4345" kind="IndirectField"/>
  <Unimplemented id="_4346" kind="IndirectField"/>
  <Unimplemented id="_4347" kind="IndirectField"/>
  <Unimplemented id="_4348" kind="IndirectField"/>
  <Unimplemented id="_4349" kind="IndirectField"/>
  <Unimplemented id="_4350" kind="IndirectField"/>
  <Unimplemented id="_4351" kind="IndirectField"/>
  <Unimplemented id="_4352" kind="IndirectField"/>
  <Unimplemented id="_4353" kind="IndirectField"/>
  <Field id="_4354" name="tl" type="_111" context="_488" access="public" location="f7:2171" file="f7" line="2171" offset="0"/>
  <Field id="_4355" name="number_of_pdus" type="_9" context="_488" access="public" location="f7:2172" file="f7" line="2172" offset="32"/>
  <Field id="_4356" name="rach_prach_frequency_resources" type="_9" context="_488" access="public" location="f7:2173" file="f7" line="2173" offset="40"/>
  <Field id="_4357" name="srs_present" type="_9" context="_488" access="public" location="f7:2174" file="f7" line="2174" offset="48"/>
  <Field id="_4358" name="ul_config_pdu_list" type="_7718" context="_488" access="public" location="f7:2175" file="f7" line="2175" offset="64"/>
  <Field id="_4359" name="tl" type="_111" context="_490" access="public" location="f7:2180" file="f7" line="2180" offset="0"/>
  <Field id="_4360" name="resource_block_start" type="_9" context="_490" access="public" location="f7:2181" file="f7" line="2181" offset="32"/>
  <Field id="_4361" name="cyclic_shift_2_for_drms" type="_9" context="_490" access="public" location="f7:2182" file="f7" line="2182" offset="40"/>
  <Field id="_4362" name="hi_value" type="_9" context="_490" access="public" location="f7:2183" file="f7" line="2183" offset="48"/>
  <Field id="_4363" name="i_phich" type="_9" context="_490" access="public" location="f7:2184" file="f7" line="2184" offset="56"/>
  <Field id="_4364" name="transmission_power" type="_10" context="_490" access="public" location="f7:2185" file="f7" line="2185" offset="64"/>
  <Field id="_4365" name="tl" type="_111" context="_492" access="public" location="f7:2190" file="f7" line="2190" offset="0"/>
  <Field id="_4366" name="flag_tb2" type="_9" context="_492" access="public" location="f7:2191" file="f7" line="2191" offset="32"/>
  <Field id="_4367" name="hi_value_2" type="_9" context="_492" access="public" location="f7:2192" file="f7" line="2192" offset="40"/>
  <Field id="_4368" name="hi_pdu_rel8" type="_491" context="_494" access="public" location="f7:2197" file="f7" line="2197" offset="0"/>
  <Field id="_4369" name="hi_pdu_rel10" type="_493" context="_494" access="public" location="f7:2198" file="f7" line="2198" offset="80"/>
  <Field id="_4370" name="tl" type="_111" context="_496" access="public" location="f7:2202" file="f7" line="2202" offset="0"/>
  <Field id="_4371" name="dci_format" type="_9" context="_496" access="public" location="f7:2203" file="f7" line="2203" offset="32"/>
  <Field id="_4372" name="cce_index" type="_9" context="_496" access="public" location="f7:2204" file="f7" line="2204" offset="40"/>
  <Field id="_4373" name="aggregation_level" type="_9" context="_496" access="public" location="f7:2205" file="f7" line="2205" offset="48"/>
  <Field id="_4374" name="rnti" type="_10" context="_496" access="public" location="f7:2206" file="f7" line="2206" offset="64"/>
  <Field id="_4375" name="resource_block_start" type="_9" context="_496" access="public" location="f7:2207" file="f7" line="2207" offset="80"/>
  <Field id="_4376" name="number_of_resource_block" type="_9" context="_496" access="public" location="f7:2208" file="f7" line="2208" offset="88"/>
  <Field id="_4377" name="mcs_1" type="_9" context="_496" access="public" location="f7:2209" file="f7" line="2209" offset="96"/>
  <Field id="_4378" name="cyclic_shift_2_for_drms" type="_9" context="_496" access="public" location="f7:2210" file="f7" line="2210" offset="104"/>
  <Field id="_4379" name="frequency_hopping_enabled_flag" type="_9" context="_496" access="public" location="f7:2211" file="f7" line="2211" offset="112"/>
  <Field id="_4380" name="frequency_hopping_bits" type="_9" context="_496" access="public" location="f7:2212" file="f7" line="2212" offset="120"/>
  <Field id="_4381" name="new_data_indication_1" type="_9" context="_496" access="public" location="f7:2213" file="f7" line="2213" offset="128"/>
  <Field id="_4382" name="ue_tx_antenna_seleciton" type="_9" context="_496" access="public" location="f7:2214" file="f7" line="2214" offset="136"/>
  <Field id="_4383" name="tpc" type="_9" context="_496" access="public" location="f7:2215" file="f7" line="2215" offset="144"/>
  <Field id="_4384" name="cqi_csi_request" type="_9" context="_496" access="public" location="f7:2216" file="f7" line="2216" offset="152"/>
  <Field id="_4385" name="ul_index" type="_9" context="_496" access="public" location="f7:2217" file="f7" line="2217" offset="160"/>
  <Field id="_4386" name="dl_assignment_index" type="_9" context="_496" access="public" location="f7:2218" file="f7" line="2218" offset="168"/>
  <Field id="_4387" name="tpc_bitmap" type="_11" context="_496" access="public" location="f7:2219" file="f7" line="2219" offset="192"/>
  <Field id="_4388" name="transmission_power" type="_10" context="_496" access="public" location="f7:2220" file="f7" line="2220" offset="224"/>
  <Field id="_4389" name="tl" type="_111" context="_498" access="public" location="f7:2225" file="f7" line="2225" offset="0"/>
  <Field id="_4390" name="cross_carrier_scheduling_flag" type="_9" context="_498" access="public" location="f7:2226" file="f7" line="2226" offset="32"/>
  <Field id="_4391" name="carrier_indicator" type="_9" context="_498" access="public" location="f7:2227" file="f7" line="2227" offset="40"/>
  <Field id="_4392" name="size_of_cqi_csi_feild" type="_9" context="_498" access="public" location="f7:2228" file="f7" line="2228" offset="48"/>
  <Field id="_4393" name="srs_flag" type="_9" context="_498" access="public" location="f7:2229" file="f7" line="2229" offset="56"/>
  <Field id="_4394" name="srs_request" type="_9" context="_498" access="public" location="f7:2230" file="f7" line="2230" offset="64"/>
  <Field id="_4395" name="resource_allocation_flag" type="_9" context="_498" access="public" location="f7:2231" file="f7" line="2231" offset="72"/>
  <Field id="_4396" name="resource_allocation_type" type="_9" context="_498" access="public" location="f7:2232" file="f7" line="2232" offset="80"/>
  <Field id="_4397" name="resource_block_coding" type="_11" context="_498" access="public" location="f7:2233" file="f7" line="2233" offset="96"/>
  <Field id="_4398" name="mcs_2" type="_9" context="_498" access="public" location="f7:2234" file="f7" line="2234" offset="128"/>
  <Field id="_4399" name="new_data_indication_2" type="_9" context="_498" access="public" location="f7:2235" file="f7" line="2235" offset="136"/>
  <Field id="_4400" name="number_of_antenna_ports" type="_9" context="_498" access="public" location="f7:2236" file="f7" line="2236" offset="144"/>
  <Field id="_4401" name="tpmi" type="_9" context="_498" access="public" location="f7:2237" file="f7" line="2237" offset="152"/>
  <Field id="_4402" name="total_dci_length_including_padding" type="_9" context="_498" access="public" location="f7:2238" file="f7" line="2238" offset="160"/>
  <Field id="_4403" name="n_ul_rb" type="_9" context="_498" access="public" location="f7:2239" file="f7" line="2239" offset="168"/>
  <Field id="_4404" name="tl" type="_111" context="_500" access="public" location="f7:2244" file="f7" line="2244" offset="0"/>
  <Field id="_4405" name="pscch_resource" type="_9" context="_500" access="public" location="f7:2245" file="f7" line="2245" offset="32"/>
  <Field id="_4406" name="time_resource_pattern" type="_9" context="_500" access="public" location="f7:2246" file="f7" line="2246" offset="40"/>
  <Field id="_4407" name="dci_pdu_rel8" type="_497" context="_502" access="public" location="f7:2252" file="f7" line="2252" offset="0"/>
  <Field id="_4408" name="dci_pdu_rel10" type="_499" context="_502" access="public" location="f7:2253" file="f7" line="2253" offset="256"/>
  <Field id="_4409" name="dci_pdu_rel12" type="_501" context="_502" access="public" location="f7:2254" file="f7" line="2254" offset="448"/>
  <Field id="_4410" name="epdcch_dci_pdu_rel8" type="_504" context="_507" access="public" location="f7:2267" file="f7" line="2267" offset="0"/>
  <Field id="_4411" name="epdcch_dci_pdu_rel10" type="_505" context="_507" access="public" location="f7:2268" file="f7" line="2268" offset="256"/>
  <Field id="_4412" name="epdcch_parameters_rel11" type="_506" context="_507" access="public" location="f7:2269" file="f7" line="2269" offset="448"/>
  <Field id="_4413" name="tl" type="_111" context="_509" access="public" location="f7:2274" file="f7" line="2274" offset="0"/>
  <Field id="_4414" name="mpdcch_narrowband" type="_9" context="_509" access="public" location="f7:2275" file="f7" line="2275" offset="32"/>
  <Field id="_4415" name="number_of_prb_pairs" type="_9" context="_509" access="public" location="f7:2276" file="f7" line="2276" offset="40"/>
  <Field id="_4416" name="resource_block_assignment" type="_9" context="_509" access="public" location="f7:2277" file="f7" line="2277" offset="48"/>
  <Field id="_4417" name="mpdcch_transmission_type" type="_9" context="_509" access="public" location="f7:2278" file="f7" line="2278" offset="56"/>
  <Field id="_4418" name="start_symbol" type="_9" context="_509" access="public" location="f7:2279" file="f7" line="2279" offset="64"/>
  <Field id="_4419" name="ecce_index" type="_9" context="_509" access="public" location="f7:2280" file="f7" line="2280" offset="72"/>
  <Field id="_4420" name="aggreagation_level" type="_9" context="_509" access="public" location="f7:2281" file="f7" line="2281" offset="80"/>
  <Field id="_4421" name="rnti_type" type="_9" context="_509" access="public" location="f7:2282" file="f7" line="2282" offset="88"/>
  <Field id="_4422" name="rnti" type="_10" context="_509" access="public" location="f7:2283" file="f7" line="2283" offset="96"/>
  <Field id="_4423" name="ce_mode" type="_9" context="_509" access="public" location="f7:2284" file="f7" line="2284" offset="112"/>
  <Field id="_4424" name="drms_scrambling_init" type="_10" context="_509" access="public" location="f7:2285" file="f7" line="2285" offset="128"/>
  <Field id="_4425" name="initial_transmission_sf_io" type="_10" context="_509" access="public" location="f7:2286" file="f7" line="2286" offset="144"/>
  <Field id="_4426" name="transmission_power" type="_10" context="_509" access="public" location="f7:2287" file="f7" line="2287" offset="160"/>
  <Field id="_4427" name="dci_format" type="_9" context="_509" access="public" location="f7:2288" file="f7" line="2288" offset="176"/>
  <Field id="_4428" name="resource_block_start" type="_9" context="_509" access="public" location="f7:2289" file="f7" line="2289" offset="184"/>
  <Field id="_4429" name="number_of_resource_blocks" type="_9" context="_509" access="public" location="f7:2290" file="f7" line="2290" offset="192"/>
  <Field id="_4430" name="mcs" type="_9" context="_509" access="public" location="f7:2291" file="f7" line="2291" offset="200"/>
  <Field id="_4431" name="pusch_repetition_levels" type="_9" context="_509" access="public" location="f7:2292" file="f7" line="2292" offset="208"/>
  <Field id="_4432" name="frequency_hopping_flag" type="_9" context="_509" access="public" location="f7:2293" file="f7" line="2293" offset="216"/>
  <Field id="_4433" name="new_data_indication" type="_9" context="_509" access="public" location="f7:2294" file="f7" line="2294" offset="224"/>
  <Field id="_4434" name="harq_process" type="_9" context="_509" access="public" location="f7:2295" file="f7" line="2295" offset="232"/>
  <Field id="_4435" name="redudency_version" type="_9" context="_509" access="public" location="f7:2296" file="f7" line="2296" offset="240"/>
  <Field id="_4436" name="tpc" type="_9" context="_509" access="public" location="f7:2297" file="f7" line="2297" offset="248"/>
  <Field id="_4437" name="csi_request" type="_9" context="_509" access="public" location="f7:2298" file="f7" line="2298" offset="256"/>
  <Field id="_4438" name="ul_inex" type="_9" context="_509" access="public" location="f7:2299" file="f7" line="2299" offset="264"/>
  <Field id="_4439" name="dai_presence_flag" type="_9" context="_509" access="public" location="f7:2300" file="f7" line="2300" offset="272"/>
  <Field id="_4440" name="dl_assignment_index" type="_9" context="_509" access="public" location="f7:2301" file="f7" line="2301" offset="280"/>
  <Field id="_4441" name="srs_request" type="_9" context="_509" access="public" location="f7:2302" file="f7" line="2302" offset="288"/>
  <Field id="_4442" name="dci_subframe_repetition_number" type="_9" context="_509" access="public" location="f7:2303" file="f7" line="2303" offset="296"/>
  <Field id="_4443" name="tcp_bitmap" type="_11" context="_509" access="public" location="f7:2304" file="f7" line="2304" offset="320"/>
  <Field id="_4444" name="total_dci_length_include_padding" type="_9" context="_509" access="public" location="f7:2305" file="f7" line="2305" offset="352"/>
  <Field id="_4445" name="number_of_tx_antenna_ports" type="_9" context="_509" access="public" location="f7:2306" file="f7" line="2306" offset="360"/>
  <Field id="_4446" name="precoding_value" type="_7673" context="_509" access="public" location="f7:2307" file="f7" line="2307" offset="368"/>
  <Field id="_4447" name="mpdcch_dci_pdu_rel13" type="_510" context="_511" access="public" location="f7:2312" file="f7" line="2312" offset="0"/>
  <Field id="_4448" name="tl" type="_111" context="_513" access="public" location="f7:2316" file="f7" line="2316" offset="0"/>
  <Field id="_4449" name="ncce_index" type="_9" context="_513" access="public" location="f7:2317" file="f7" line="2317" offset="32"/>
  <Field id="_4450" name="aggregation_level" type="_9" context="_513" access="public" location="f7:2318" file="f7" line="2318" offset="40"/>
  <Field id="_4451" name="start_symbol" type="_9" context="_513" access="public" location="f7:2319" file="f7" line="2319" offset="48"/>
  <Field id="_4452" name="rnti" type="_10" context="_513" access="public" location="f7:2320" file="f7" line="2320" offset="64"/>
  <Field id="_4453" name="scrambling_reinitialization_batch_index" type="_9" context="_513" access="public" location="f7:2321" file="f7" line="2321" offset="80"/>
  <Field id="_4454" name="nrs_antenna_ports_assumed_by_the_ue" type="_9" context="_513" access="public" location="f7:2322" file="f7" line="2322" offset="88"/>
  <Field id="_4455" name="subcarrier_indication" type="_9" context="_513" access="public" location="f7:2323" file="f7" line="2323" offset="96"/>
  <Field id="_4456" name="resource_assignment" type="_9" context="_513" access="public" location="f7:2324" file="f7" line="2324" offset="104"/>
  <Field id="_4457" name="scheduling_delay" type="_9" context="_513" access="public" location="f7:2325" file="f7" line="2325" offset="112"/>
  <Field id="_4458" name="mcs" type="_9" context="_513" access="public" location="f7:2326" file="f7" line="2326" offset="120"/>
  <Field id="_4459" name="redudancy_version" type="_9" context="_513" access="public" location="f7:2327" file="f7" line="2327" offset="128"/>
  <Field id="_4460" name="repetition_number" type="_9" context="_513" access="public" location="f7:2328" file="f7" line="2328" offset="136"/>
  <Field id="_4461" name="new_data_indicator" type="_9" context="_513" access="public" location="f7:2329" file="f7" line="2329" offset="144"/>
  <Field id="_4462" name="dci_subframe_repetition_number" type="_9" context="_513" access="public" location="f7:2330" file="f7" line="2330" offset="152"/>
  <Field id="_4463" name="npdcch_dci_pdu_rel13" type="_514" context="_515" access="public" location="f7:2336" file="f7" line="2336" offset="0"/>
  <Field id="_4464" name="pdu_type" type="_9" context="_517" access="public" location="f7:2340" file="f7" line="2340" offset="0"/>
  <Field id="_4465" name="pdu_size" type="_9" context="_517" access="public" location="f7:2341" file="f7" line="2341" offset="8"/>
  <Union id="_4466" context="_517" access="public" location="f7:2342" file="f7" line="2342" members="_7719 _7720 _7721 _7722 _7723" size="736" align="32"/>
  <Field id="_4467" name="" type="_4466" context="_517" access="public" location="f7:2342" file="f7" line="2342" offset="32"/>
  <Unimplemented id="_4468" kind="IndirectField"/>
  <Unimplemented id="_4469" kind="IndirectField"/>
  <Unimplemented id="_4470" kind="IndirectField"/>
  <Unimplemented id="_4471" kind="IndirectField"/>
  <Unimplemented id="_4472" kind="IndirectField"/>
  <Field id="_4473" name="tl" type="_111" context="_519" access="public" location="f7:2353" file="f7" line="2353" offset="0"/>
  <Field id="_4474" name="sfnsf" type="_10" context="_519" access="public" location="f7:2354" file="f7" line="2354" offset="32"/>
  <Field id="_4475" name="number_of_dci" type="_9" context="_519" access="public" location="f7:2355" file="f7" line="2355" offset="48"/>
  <Field id="_4476" name="number_of_hi" type="_9" context="_519" access="public" location="f7:2356" file="f7" line="2356" offset="56"/>
  <Field id="_4477" name="hi_dci0_pdu_list" type="_7724" context="_519" access="public" location="f7:2357" file="f7" line="2357" offset="64"/>
  <Field id="_4478" name="pdu_length" type="_10" context="_521" access="public" location="f7:2363" file="f7" line="2363" offset="0"/>
  <Field id="_4479" name="pdu_index" type="_10" context="_521" access="public" location="f7:2364" file="f7" line="2364" offset="16"/>
  <Field id="_4480" name="num_segments" type="_9" context="_521" access="public" location="f7:2365" file="f7" line="2365" offset="32"/>
  <Struct id="_4481" name="" context="_521" access="public" location="f7:2366" file="f7" line="2366" members="_7725 _7726" size="128" align="64"/>
  <Field id="_4482" name="segments" type="_7727" context="_521" access="public" location="f7:2369" file="f7" line="2369" offset="64"/>
  <Field id="_4483" name="tl" type="_111" context="_523" access="public" location="f7:2374" file="f7" line="2374" offset="0"/>
  <Field id="_4484" name="number_of_pdus" type="_10" context="_523" access="public" location="f7:2375" file="f7" line="2375" offset="32"/>
  <Field id="_4485" name="tx_pdu_list" type="_7728" context="_523" access="public" location="f7:2376" file="f7" line="2376" offset="64"/>
  <Field id="_4486" name="header" type="_109" context="_525" access="public" location="f7:2382" file="f7" line="2382" offset="0"/>
  <Field id="_4487" name="t1" type="_11" context="_525" access="public" location="f7:2383" file="f7" line="2383" offset="128"/>
  <Field id="_4488" name="delta_sfn_sf" type="_7" context="_525" access="public" location="f7:2384" file="f7" line="2384" offset="160"/>
  <Field id="_4489" name="vendor_extension" type="_112" context="_525" access="public" location="f7:2385" file="f7" line="2385" offset="192"/>
  <Field id="_4490" name="header" type="_109" context="_527" access="public" location="f7:2389" file="f7" line="2389" offset="0"/>
  <Field id="_4491" name="t1" type="_11" context="_527" access="public" location="f7:2390" file="f7" line="2390" offset="128"/>
  <Field id="_4492" name="t2" type="_11" context="_527" access="public" location="f7:2391" file="f7" line="2391" offset="160"/>
  <Field id="_4493" name="t3" type="_11" context="_527" access="public" location="f7:2392" file="f7" line="2392" offset="192"/>
  <Field id="_4494" name="vendor_extension" type="_112" context="_527" access="public" location="f7:2393" file="f7" line="2393" offset="256"/>
  <Field id="_4495" name="header" type="_109" context="_529" access="public" location="f7:2397" file="f7" line="2397" offset="0"/>
  <Field id="_4496" name="last_sfn_sf" type="_11" context="_529" access="public" location="f7:2398" file="f7" line="2398" offset="128"/>
  <Field id="_4497" name="time_since_last_timing_info" type="_11" context="_529" access="public" location="f7:2399" file="f7" line="2399" offset="160"/>
  <Field id="_4498" name="dl_config_jitter" type="_11" context="_529" access="public" location="f7:2400" file="f7" line="2400" offset="192"/>
  <Field id="_4499" name="tx_request_jitter" type="_11" context="_529" access="public" location="f7:2401" file="f7" line="2401" offset="224"/>
  <Field id="_4500" name="ul_config_jitter" type="_11" context="_529" access="public" location="f7:2402" file="f7" line="2402" offset="256"/>
  <Field id="_4501" name="hi_dci0_jitter" type="_11" context="_529" access="public" location="f7:2403" file="f7" line="2403" offset="288"/>
  <Field id="_4502" name="dl_config_latest_delay" type="_7" context="_529" access="public" location="f7:2404" file="f7" line="2404" offset="320"/>
  <Field id="_4503" name="tx_request_latest_delay" type="_7" context="_529" access="public" location="f7:2405" file="f7" line="2405" offset="352"/>
  <Field id="_4504" name="ul_config_latest_delay" type="_7" context="_529" access="public" location="f7:2406" file="f7" line="2406" offset="384"/>
  <Field id="_4505" name="hi_dci0_latest_delay" type="_7" context="_529" access="public" location="f7:2407" file="f7" line="2407" offset="416"/>
  <Field id="_4506" name="dl_config_earliest_arrival" type="_7" context="_529" access="public" location="f7:2408" file="f7" line="2408" offset="448"/>
  <Field id="_4507" name="tx_request_earliest_arrival" type="_7" context="_529" access="public" location="f7:2409" file="f7" line="2409" offset="480"/>
  <Field id="_4508" name="ul_config_earliest_arrival" type="_7" context="_529" access="public" location="f7:2410" file="f7" line="2410" offset="512"/>
  <Field id="_4509" name="hi_dci0_earliest_arrival" type="_7" context="_529" access="public" location="f7:2411" file="f7" line="2411" offset="544"/>
  <Field id="_4510" name="vendor_extension" type="_112" context="_529" access="public" location="f7:2412" file="f7" line="2412" offset="576"/>
  <Field id="_4511" name="tl" type="_111" context="_531" access="public" location="f7:2416" file="f7" line="2416" offset="0"/>
  <Field id="_4512" name="handle" type="_11" context="_531" access="public" location="f7:2417" file="f7" line="2417" offset="32"/>
  <Field id="_4513" name="rnti" type="_10" context="_531" access="public" location="f7:2418" file="f7" line="2418" offset="64"/>
  <Field id="_4514" name="value_0" type="_9" context="_533" access="public" location="f7:2423" file="f7" line="2423" offset="0"/>
  <Field id="_4515" name="value_1" type="_9" context="_533" access="public" location="f7:2424" file="f7" line="2424" offset="8"/>
  <Field id="_4516" name="value_0" type="_9" context="_535" access="public" location="f7:2428" file="f7" line="2428" offset="0"/>
  <Field id="_4517" name="value_1" type="_9" context="_535" access="public" location="f7:2429" file="f7" line="2429" offset="8"/>
  <Field id="_4518" name="value_2" type="_9" context="_535" access="public" location="f7:2430" file="f7" line="2430" offset="16"/>
  <Field id="_4519" name="value_3" type="_9" context="_535" access="public" location="f7:2431" file="f7" line="2431" offset="24"/>
  <Field id="_4520" name="value_0" type="_9" context="_537" access="public" location="f7:2435" file="f7" line="2435" offset="0"/>
  <Field id="_4521" name="value_0" type="_9" context="_539" access="public" location="f7:2439" file="f7" line="2439" offset="0"/>
  <Field id="_4522" name="tl" type="_111" context="_541" access="public" location="f7:2443" file="f7" line="2443" offset="0"/>
  <Field id="_4523" name="mode" type="_9" context="_541" access="public" location="f7:2444" file="f7" line="2444" offset="32"/>
  <Field id="_4524" name="number_of_ack_nack" type="_9" context="_541" access="public" location="f7:2445" file="f7" line="2445" offset="40"/>
  <Union id="_4525" name="" context="_541" access="public" location="f7:2446" file="f7" line="2446" members="_7729 _7730 _7731" size="32" align="8"/>
  <Field id="_4526" name="harq_data" type="_4525" context="_541" access="public" location="f7:2450" file="f7" line="2450" offset="48"/>
  <Field id="_4527" name="tl" type="_111" context="_543" access="public" location="f7:2455" file="f7" line="2455" offset="0"/>
  <Field id="_4528" name="mode" type="_9" context="_543" access="public" location="f7:2456" file="f7" line="2456" offset="32"/>
  <Field id="_4529" name="number_of_ack_nack" type="_9" context="_543" access="public" location="f7:2457" file="f7" line="2457" offset="40"/>
  <Union id="_4530" name="" context="_543" access="public" location="f7:2458" file="f7" line="2458" members="_7732 _7733 _7734 _7735 _7736" size="8" align="8"/>
  <Field id="_4531" name="harq_data" type="_7737" context="_543" access="public" location="f7:2464" file="f7" line="2464" offset="48"/>
  <Field id="_4532" name="tl" type="_111" context="_545" access="public" location="f7:2469" file="f7" line="2469" offset="0"/>
  <Field id="_4533" name="mode" type="_9" context="_545" access="public" location="f7:2470" file="f7" line="2470" offset="32"/>
  <Field id="_4534" name="number_of_ack_nack" type="_10" context="_545" access="public" location="f7:2471" file="f7" line="2471" offset="48"/>
  <Union id="_4535" name="" context="_545" access="public" location="f7:2472" file="f7" line="2472" members="_7738 _7739 _7740 _7741 _7742 _7743 _7744" size="8" align="8"/>
  <Field id="_4536" name="harq_data" type="_7745" context="_545" access="public" location="f7:2480" file="f7" line="2480" offset="64"/>
  <Field id="_4537" name="tl" type="_111" context="_547" access="public" location="f7:2485" file="f7" line="2485" offset="0"/>
  <Field id="_4538" name="harq_tb1" type="_9" context="_547" access="public" location="f7:2486" file="f7" line="2486" offset="32"/>
  <Field id="_4539" name="harq_tb2" type="_9" context="_547" access="public" location="f7:2487" file="f7" line="2487" offset="40"/>
  <Field id="_4540" name="tl" type="_111" context="_549" access="public" location="f7:2493" file="f7" line="2493" offset="0"/>
  <Field id="_4541" name="mode" type="_9" context="_549" access="public" location="f7:2494" file="f7" line="2494" offset="32"/>
  <Field id="_4542" name="number_of_ack_nack" type="_9" context="_549" access="public" location="f7:2495" file="f7" line="2495" offset="40"/>
  <Field id="_4543" name="harq_tb_n" type="_7746" context="_549" access="public" location="f7:2496" file="f7" line="2496" offset="48"/>
  <Field id="_4544" name="tl" type="_111" context="_551" access="public" location="f7:2502" file="f7" line="2502" offset="0"/>
  <Field id="_4545" name="mode" type="_9" context="_551" access="public" location="f7:2503" file="f7" line="2503" offset="32"/>
  <Field id="_4546" name="number_of_ack_nack" type="_10" context="_551" access="public" location="f7:2504" file="f7" line="2504" offset="48"/>
  <Field id="_4547" name="harq_tb_n" type="_7747" context="_551" access="public" location="f7:2505" file="f7" line="2505" offset="64"/>
  <Field id="_4548" name="tl" type="_111" context="_553" access="public" location="f7:2510" file="f7" line="2510" offset="0"/>
  <Field id="_4549" name="ul_cqi" type="_9" context="_553" access="public" location="f7:2511" file="f7" line="2511" offset="32"/>
  <Field id="_4550" name="channel" type="_9" context="_553" access="public" location="f7:2512" file="f7" line="2512" offset="40"/>
  <Field id="_4551" name="instance_length" type="_10" context="_555" access="public" location="f7:2520" file="f7" line="2520" offset="0"/>
  <Field id="_4552" name="rx_ue_information" type="_532" context="_555" access="public" location="f7:2521" file="f7" line="2521" offset="32"/>
  <Field id="_4553" name="harq_indication_tdd_rel8" type="_542" context="_555" access="public" location="f7:2522" file="f7" line="2522" offset="128"/>
  <Field id="_4554" name="harq_indication_tdd_rel9" type="_544" context="_555" access="public" location="f7:2523" file="f7" line="2523" offset="208"/>
  <Field id="_4555" name="harq_indication_tdd_rel13" type="_546" context="_555" access="public" location="f7:2524" file="f7" line="2524" offset="320"/>
  <Field id="_4556" name="harq_indication_fdd_rel8" type="_548" context="_555" access="public" location="f7:2525" file="f7" line="2525" offset="448"/>
  <Field id="_4557" name="harq_indication_fdd_rel9" type="_550" context="_555" access="public" location="f7:2526" file="f7" line="2526" offset="496"/>
  <Field id="_4558" name="harq_indication_fdd_rel13" type="_552" context="_555" access="public" location="f7:2527" file="f7" line="2527" offset="624"/>
  <Field id="_4559" name="ul_cqi_information" type="_554" context="_555" access="public" location="f7:2528" file="f7" line="2528" offset="864"/>
  <Field id="_4560" name="tl" type="_111" context="_557" access="public" location="f7:2533" file="f7" line="2533" offset="0"/>
  <Field id="_4561" name="number_of_harqs" type="_10" context="_557" access="public" location="f7:2534" file="f7" line="2534" offset="32"/>
  <Field id="_4562" name="harq_pdu_list" type="_7748" context="_557" access="public" location="f7:2535" file="f7" line="2535" offset="64"/>
  <Field id="_4563" name="tl" type="_111" context="_559" access="public" location="f7:2540" file="f7" line="2540" offset="0"/>
  <Field id="_4564" name="crc_flag" type="_9" context="_559" access="public" location="f7:2541" file="f7" line="2541" offset="32"/>
  <Field id="_4565" name="instance_length" type="_10" context="_561" access="public" location="f7:2546" file="f7" line="2546" offset="0"/>
  <Field id="_4566" name="rx_ue_information" type="_532" context="_561" access="public" location="f7:2547" file="f7" line="2547" offset="32"/>
  <Field id="_4567" name="crc_indication_rel8" type="_560" context="_561" access="public" location="f7:2548" file="f7" line="2548" offset="128"/>
  <Field id="_4568" name="tl" type="_111" context="_563" access="public" location="f7:2553" file="f7" line="2553" offset="0"/>
  <Field id="_4569" name="number_of_crcs" type="_10" context="_563" access="public" location="f7:2554" file="f7" line="2554" offset="32"/>
  <Field id="_4570" name="crc_pdu_list" type="_7749" context="_563" access="public" location="f7:2555" file="f7" line="2555" offset="64"/>
  <Field id="_4571" name="instance_length" type="_10" context="_565" access="public" location="f7:2560" file="f7" line="2560" offset="0"/>
  <Field id="_4572" name="rx_ue_information" type="_532" context="_565" access="public" location="f7:2561" file="f7" line="2561" offset="32"/>
  <Field id="_4573" name="ul_cqi_information" type="_554" context="_565" access="public" location="f7:2562" file="f7" line="2562" offset="128"/>
  <Field id="_4574" name="tl" type="_111" context="_567" access="public" location="f7:2567" file="f7" line="2567" offset="0"/>
  <Field id="_4575" name="number_of_srs" type="_10" context="_567" access="public" location="f7:2568" file="f7" line="2568" offset="32"/>
  <Field id="_4576" name="sr_pdu_list" type="_7750" context="_567" access="public" location="f7:2569" file="f7" line="2569" offset="64"/>
  <Field id="_4577" name="tl" type="_111" context="_569" access="public" location="f7:2577" file="f7" line="2577" offset="0"/>
  <Field id="_4578" name="length" type="_10" context="_569" access="public" location="f7:2578" file="f7" line="2578" offset="32"/>
  <Field id="_4579" name="data_offset" type="_10" context="_569" access="public" location="f7:2579" file="f7" line="2579" offset="48"/>
  <Field id="_4580" name="ul_cqi" type="_9" context="_569" access="public" location="f7:2580" file="f7" line="2580" offset="64"/>
  <Field id="_4581" name="ri" type="_9" context="_569" access="public" location="f7:2581" file="f7" line="2581" offset="72"/>
  <Field id="_4582" name="timing_advance" type="_10" context="_569" access="public" location="f7:2582" file="f7" line="2582" offset="80"/>
  <Field id="_4583" name="tl" type="_111" context="_571" access="public" location="f7:2588" file="f7" line="2588" offset="0"/>
  <Field id="_4584" name="length" type="_10" context="_571" access="public" location="f7:2589" file="f7" line="2589" offset="32"/>
  <Field id="_4585" name="data_offset" type="_10" context="_571" access="public" location="f7:2590" file="f7" line="2590" offset="48"/>
  <Field id="_4586" name="ul_cqi" type="_9" context="_571" access="public" location="f7:2591" file="f7" line="2591" offset="64"/>
  <Field id="_4587" name="number_of_cc_reported" type="_9" context="_571" access="public" location="f7:2592" file="f7" line="2592" offset="72"/>
  <Field id="_4588" name="ri" type="_7667" context="_571" access="public" location="f7:2593" file="f7" line="2593" offset="80"/>
  <Field id="_4589" name="timing_advance" type="_10" context="_571" access="public" location="f7:2594" file="f7" line="2594" offset="112"/>
  <Field id="_4590" name="timing_advance_r9" type="_10" context="_571" access="public" location="f7:2595" file="f7" line="2595" offset="128"/>
  <Field id="_4591" name="instance_length" type="_10" context="_573" access="public" location="f7:2600" file="f7" line="2600" offset="0"/>
  <Field id="_4592" name="rx_ue_information" type="_532" context="_573" access="public" location="f7:2601" file="f7" line="2601" offset="32"/>
  <Field id="_4593" name="cqi_indication_rel8" type="_570" context="_573" access="public" location="f7:2602" file="f7" line="2602" offset="128"/>
  <Field id="_4594" name="cqi_indication_rel9" type="_572" context="_573" access="public" location="f7:2603" file="f7" line="2603" offset="224"/>
  <Field id="_4595" name="ul_cqi_information" type="_554" context="_573" access="public" location="f7:2604" file="f7" line="2604" offset="368"/>
  <Field id="_4596" name="pdu" type="_7751" context="_575" access="public" location="f7:2609" file="f7" line="2609" offset="0"/>
  <Field id="_4597" name="tl" type="_111" context="_577" access="public" location="f7:2614" file="f7" line="2614" offset="0"/>
  <Field id="_4598" name="number_of_cqis" type="_10" context="_577" access="public" location="f7:2615" file="f7" line="2615" offset="32"/>
  <Field id="_4599" name="cqi_pdu_list" type="_7752" context="_577" access="public" location="f7:2616" file="f7" line="2616" offset="64"/>
  <Field id="_4600" name="cqi_raw_pdu_list" type="_7753" context="_577" access="public" location="f7:2617" file="f7" line="2617" offset="128"/>
  <Field id="_4601" name="tl" type="_111" context="_579" access="public" location="f7:2622" file="f7" line="2622" offset="0"/>
  <Field id="_4602" name="rnti" type="_10" context="_579" access="public" location="f7:2623" file="f7" line="2623" offset="32"/>
  <Field id="_4603" name="preamble" type="_9" context="_579" access="public" location="f7:2624" file="f7" line="2624" offset="48"/>
  <Field id="_4604" name="timing_advance" type="_10" context="_579" access="public" location="f7:2625" file="f7" line="2625" offset="64"/>
  <Field id="_4605" name="tl" type="_111" context="_581" access="public" location="f7:2630" file="f7" line="2630" offset="0"/>
  <Field id="_4606" name="timing_advance_r9" type="_10" context="_581" access="public" location="f7:2631" file="f7" line="2631" offset="32"/>
  <Field id="_4607" name="tl" type="_111" context="_583" access="public" location="f7:2636" file="f7" line="2636" offset="0"/>
  <Field id="_4608" name="rach_resource_type" type="_9" context="_583" access="public" location="f7:2637" file="f7" line="2637" offset="32"/>
  <Field id="_4609" name="instance_length" type="_10" context="_585" access="public" location="f7:2642" file="f7" line="2642" offset="0"/>
  <Field id="_4610" name="preamble_rel8" type="_580" context="_585" access="public" location="f7:2643" file="f7" line="2643" offset="16"/>
  <Field id="_4611" name="preamble_rel9" type="_582" context="_585" access="public" location="f7:2644" file="f7" line="2644" offset="96"/>
  <Field id="_4612" name="preamble_rel13" type="_584" context="_585" access="public" location="f7:2645" file="f7" line="2645" offset="144"/>
  <Field id="_4613" name="tl" type="_111" context="_587" access="public" location="f7:2650" file="f7" line="2650" offset="0"/>
  <Field id="_4614" name="number_of_preambles" type="_10" context="_587" access="public" location="f7:2651" file="f7" line="2651" offset="32"/>
  <Field id="_4615" name="preamble_list" type="_7754" context="_587" access="public" location="f7:2652" file="f7" line="2652" offset="64"/>
  <Field id="_4616" name="tl" type="_111" context="_589" access="public" location="f7:2658" file="f7" line="2658" offset="0"/>
  <Field id="_4617" name="doppler_estimation" type="_10" context="_589" access="public" location="f7:2659" file="f7" line="2659" offset="32"/>
  <Field id="_4618" name="timing_advance" type="_10" context="_589" access="public" location="f7:2660" file="f7" line="2660" offset="48"/>
  <Field id="_4619" name="number_of_resource_blocks" type="_9" context="_589" access="public" location="f7:2661" file="f7" line="2661" offset="64"/>
  <Field id="_4620" name="rb_start" type="_9" context="_589" access="public" location="f7:2662" file="f7" line="2662" offset="72"/>
  <Field id="_4621" name="snr" type="_7755" context="_589" access="public" location="f7:2663" file="f7" line="2663" offset="80"/>
  <Field id="_4622" name="tl" type="_111" context="_591" access="public" location="f7:2668" file="f7" line="2668" offset="0"/>
  <Field id="_4623" name="timing_advance_r9" type="_10" context="_591" access="public" location="f7:2669" file="f7" line="2669" offset="32"/>
  <Field id="_4624" name="tl" type="_111" context="_593" access="public" location="f7:2674" file="f7" line="2674" offset="0"/>
  <Field id="_4625" name="uppts_symbol" type="_9" context="_593" access="public" location="f7:2675" file="f7" line="2675" offset="32"/>
  <Field id="_4626" name="tl" type="_111" context="_595" access="public" location="f7:2680" file="f7" line="2680" offset="0"/>
  <Field id="_4627" name="ul_rtoa" type="_10" context="_595" access="public" location="f7:2681" file="f7" line="2681" offset="32"/>
  <Field id="_4628" name="tl" type="_111" context="_597" access="public" location="f7:2687" file="f7" line="2687" offset="0"/>
  <Field id="_4629" name="num_prb_per_subband" type="_9" context="_597" access="public" location="f7:2688" file="f7" line="2688" offset="32"/>
  <Field id="_4630" name="number_of_subbands" type="_9" context="_597" access="public" location="f7:2689" file="f7" line="2689" offset="40"/>
  <Field id="_4631" name="num_atennas" type="_9" context="_597" access="public" location="f7:2690" file="f7" line="2690" offset="48"/>
  <Struct id="_4632" name="" context="_597" access="public" location="f7:2691" file="f7" line="2691" members="_7756 _7757" size="144" align="16"/>
  <Field id="_4633" name="subands" type="_7758" context="_597" access="public" location="f7:2694" file="f7" line="2694" offset="64"/>
  <Field id="_4634" name="instance_length" type="_10" context="_599" access="public" location="f7:2699" file="f7" line="2699" offset="0"/>
  <Field id="_4635" name="rx_ue_information" type="_532" context="_599" access="public" location="f7:2700" file="f7" line="2700" offset="32"/>
  <Field id="_4636" name="srs_indication_fdd_rel8" type="_590" context="_599" access="public" location="f7:2701" file="f7" line="2701" offset="128"/>
  <Field id="_4637" name="srs_indication_fdd_rel9" type="_592" context="_599" access="public" location="f7:2702" file="f7" line="2702" offset="8208"/>
  <Field id="_4638" name="srs_indication_tdd_rel10" type="_594" context="_599" access="public" location="f7:2703" file="f7" line="2703" offset="8256"/>
  <Field id="_4639" name="srs_indication_fdd_rel11" type="_596" context="_599" access="public" location="f7:2704" file="f7" line="2704" offset="8304"/>
  <Field id="_4640" name="tdd_channel_measurement" type="_598" context="_599" access="public" location="f7:2705" file="f7" line="2705" offset="8352"/>
  <Field id="_4641" name="tl" type="_111" context="_601" access="public" location="f7:2710" file="f7" line="2710" offset="0"/>
  <Field id="_4642" name="number_of_ues" type="_9" context="_601" access="public" location="f7:2711" file="f7" line="2711" offset="32"/>
  <Field id="_4643" name="srs_pdu_list" type="_7759" context="_601" access="public" location="f7:2712" file="f7" line="2712" offset="64"/>
  <Field id="_4644" name="tl" type="_111" context="_603" access="public" location="f7:2717" file="f7" line="2717" offset="0"/>
  <Field id="_4645" name="length" type="_10" context="_603" access="public" location="f7:2718" file="f7" line="2718" offset="32"/>
  <Field id="_4646" name="offset" type="_10" context="_603" access="public" location="f7:2719" file="f7" line="2719" offset="48"/>
  <Field id="_4647" name="ul_cqi" type="_9" context="_603" access="public" location="f7:2720" file="f7" line="2720" offset="64"/>
  <Field id="_4648" name="timing_advance" type="_10" context="_603" access="public" location="f7:2721" file="f7" line="2721" offset="80"/>
  <Field id="_4649" name="tl" type="_111" context="_605" access="public" location="f7:2726" file="f7" line="2726" offset="0"/>
  <Field id="_4650" name="timing_advance_r9" type="_10" context="_605" access="public" location="f7:2727" file="f7" line="2727" offset="32"/>
  <Field id="_4651" name="rx_ue_information" type="_532" context="_607" access="public" location="f7:2732" file="f7" line="2732" offset="0"/>
  <Field id="_4652" name="rx_indication_rel8" type="_604" context="_607" access="public" location="f7:2733" file="f7" line="2733" offset="96"/>
  <Field id="_4653" name="rx_indication_rel9" type="_606" context="_607" access="public" location="f7:2734" file="f7" line="2734" offset="192"/>
  <Field id="_4654" name="data" type="_5094" context="_607" access="public" location="f7:2735" file="f7" line="2735" offset="256"/>
  <Field id="_4655" name="tl" type="_111" context="_609" access="public" location="f7:2740" file="f7" line="2740" offset="0"/>
  <Field id="_4656" name="number_of_pdus" type="_10" context="_609" access="public" location="f7:2741" file="f7" line="2741" offset="32"/>
  <Field id="_4657" name="rx_pdu_list" type="_7760" context="_609" access="public" location="f7:2742" file="f7" line="2742" offset="64"/>
  <Field id="_4658" name="tl" type="_111" context="_611" access="public" location="f7:2747" file="f7" line="2747" offset="0"/>
  <Field id="_4659" name="harq_tb1" type="_9" context="_611" access="public" location="f7:2748" file="f7" line="2748" offset="32"/>
  <Field id="_4660" name="instance_length" type="_10" context="_613" access="public" location="f7:2753" file="f7" line="2753" offset="0"/>
  <Field id="_4661" name="rx_ue_information" type="_532" context="_613" access="public" location="f7:2754" file="f7" line="2754" offset="32"/>
  <Field id="_4662" name="nb_harq_indication_fdd_rel13" type="_612" context="_613" access="public" location="f7:2755" file="f7" line="2755" offset="128"/>
  <Field id="_4663" name="ul_cqi_information" type="_554" context="_613" access="public" location="f7:2756" file="f7" line="2756" offset="176"/>
  <Field id="_4664" name="tl" type="_111" context="_615" access="public" location="f7:2760" file="f7" line="2760" offset="0"/>
  <Field id="_4665" name="number_of_harqs" type="_10" context="_615" access="public" location="f7:2761" file="f7" line="2761" offset="32"/>
  <Field id="_4666" name="nb_harq_pdu_list" type="_7761" context="_615" access="public" location="f7:2762" file="f7" line="2762" offset="64"/>
  <Field id="_4667" name="tl" type="_111" context="_617" access="public" location="f7:2767" file="f7" line="2767" offset="0"/>
  <Field id="_4668" name="rnti" type="_10" context="_617" access="public" location="f7:2768" file="f7" line="2768" offset="32"/>
  <Field id="_4669" name="initial_sc" type="_9" context="_617" access="public" location="f7:2769" file="f7" line="2769" offset="48"/>
  <Field id="_4670" name="timing_advance" type="_10" context="_617" access="public" location="f7:2770" file="f7" line="2770" offset="64"/>
  <Field id="_4671" name="nrach_ce_level" type="_9" context="_617" access="public" location="f7:2771" file="f7" line="2771" offset="80"/>
  <Field id="_4672" name="nrach_indication_rel13" type="_618" context="_619" access="public" location="f7:2776" file="f7" line="2776" offset="0"/>
  <Field id="_4673" name="tl" type="_111" context="_621" access="public" location="f7:2780" file="f7" line="2780" offset="0"/>
  <Field id="_4674" name="number_of_initial_scs_detected" type="_9" context="_621" access="public" location="f7:2781" file="f7" line="2781" offset="32"/>
  <Field id="_4675" name="nrach_pdu_list" type="_7762" context="_621" access="public" location="f7:2782" file="f7" line="2782" offset="64"/>
  <Field id="_4676" name="tl" type="_111" context="_623" access="public" location="f7:2787" file="f7" line="2787" offset="0"/>
  <Field id="_4677" name="handle" type="_11" context="_623" access="public" location="f7:2788" file="f7" line="2788" offset="32"/>
  <Field id="_4678" name="mp_cca" type="_11" context="_623" access="public" location="f7:2789" file="f7" line="2789" offset="64"/>
  <Field id="_4679" name="n_cca" type="_11" context="_623" access="public" location="f7:2790" file="f7" line="2790" offset="96"/>
  <Field id="_4680" name="offset" type="_11" context="_623" access="public" location="f7:2791" file="f7" line="2791" offset="128"/>
  <Field id="_4681" name="lte_txop_sf" type="_11" context="_623" access="public" location="f7:2792" file="f7" line="2792" offset="160"/>
  <Field id="_4682" name="txop_sfn_sf_end" type="_10" context="_623" access="public" location="f7:2793" file="f7" line="2793" offset="192"/>
  <Field id="_4683" name="lbt_mode" type="_11" context="_623" access="public" location="f7:2794" file="f7" line="2794" offset="224"/>
  <Field id="_4684" name="lbt_pdsch_req_pdu_rel13" type="_624" context="_625" access="public" location="f7:2799" file="f7" line="2799" offset="0"/>
  <Field id="_4685" name="tl" type="_111" context="_627" access="public" location="f7:2803" file="f7" line="2803" offset="0"/>
  <Field id="_4686" name="handle" type="_11" context="_627" access="public" location="f7:2804" file="f7" line="2804" offset="32"/>
  <Field id="_4687" name="offset" type="_11" context="_627" access="public" location="f7:2805" file="f7" line="2805" offset="64"/>
  <Field id="_4688" name="sfn_sf_end" type="_10" context="_627" access="public" location="f7:2806" file="f7" line="2806" offset="96"/>
  <Field id="_4689" name="lbt_mode" type="_11" context="_627" access="public" location="f7:2807" file="f7" line="2807" offset="128"/>
  <Field id="_4690" name="lbt_drs_req_pdu_rel13" type="_628" context="_629" access="public" location="f7:2812" file="f7" line="2812" offset="0"/>
  <Field id="_4691" name="pdu_type" type="_9" context="_631" access="public" location="f7:2816" file="f7" line="2816" offset="0"/>
  <Field id="_4692" name="pdu_size" type="_9" context="_631" access="public" location="f7:2817" file="f7" line="2817" offset="8"/>
  <Union id="_4693" context="_631" access="public" location="f7:2818" file="f7" line="2818" members="_7763 _7764" size="256" align="32"/>
  <Field id="_4694" name="" type="_4693" context="_631" access="public" location="f7:2818" file="f7" line="2818" offset="32"/>
  <Unimplemented id="_4695" kind="IndirectField"/>
  <Unimplemented id="_4696" kind="IndirectField"/>
  <Field id="_4697" name="tl" type="_111" context="_633" access="public" location="f7:2826" file="f7" line="2826" offset="0"/>
  <Field id="_4698" name="number_of_pdus" type="_10" context="_633" access="public" location="f7:2827" file="f7" line="2827" offset="32"/>
  <Field id="_4699" name="lbt_dl_config_req_pdu_list" type="_7765" context="_633" access="public" location="f7:2828" file="f7" line="2828" offset="64"/>
  <Field id="_4700" name="tl" type="_111" context="_635" access="public" location="f7:2834" file="f7" line="2834" offset="0"/>
  <Field id="_4701" name="handle" type="_11" context="_635" access="public" location="f7:2835" file="f7" line="2835" offset="32"/>
  <Field id="_4702" name="result" type="_11" context="_635" access="public" location="f7:2836" file="f7" line="2836" offset="64"/>
  <Field id="_4703" name="lte_txop_symbols" type="_11" context="_635" access="public" location="f7:2837" file="f7" line="2837" offset="96"/>
  <Field id="_4704" name="initial_partial_sf" type="_11" context="_635" access="public" location="f7:2838" file="f7" line="2838" offset="128"/>
  <Field id="_4705" name="lbt_pdsch_rsp_pdu_rel13" type="_636" context="_637" access="public" location="f7:2843" file="f7" line="2843" offset="0"/>
  <Field id="_4706" name="tl" type="_111" context="_639" access="public" location="f7:2847" file="f7" line="2847" offset="0"/>
  <Field id="_4707" name="handle" type="_11" context="_639" access="public" location="f7:2848" file="f7" line="2848" offset="32"/>
  <Field id="_4708" name="result" type="_11" context="_639" access="public" location="f7:2849" file="f7" line="2849" offset="64"/>
  <Field id="_4709" name="lbt_drs_rsp_pdu_rel13" type="_640" context="_641" access="public" location="f7:2854" file="f7" line="2854" offset="0"/>
  <Field id="_4710" name="pdu_type" type="_9" context="_643" access="public" location="f7:2859" file="f7" line="2859" offset="0"/>
  <Field id="_4711" name="pdu_size" type="_9" context="_643" access="public" location="f7:2860" file="f7" line="2860" offset="8"/>
  <Union id="_4712" context="_643" access="public" location="f7:2861" file="f7" line="2861" members="_7766 _7767" size="160" align="32"/>
  <Field id="_4713" name="" type="_4712" context="_643" access="public" location="f7:2861" file="f7" line="2861" offset="32"/>
  <Unimplemented id="_4714" kind="IndirectField"/>
  <Unimplemented id="_4715" kind="IndirectField"/>
  <Field id="_4716" name="tl" type="_111" context="_645" access="public" location="f7:2869" file="f7" line="2869" offset="0"/>
  <Field id="_4717" name="number_of_pdus" type="_10" context="_645" access="public" location="f7:2870" file="f7" line="2870" offset="32"/>
  <Field id="_4718" name="lbt_indication_pdu_list" type="_7768" context="_645" access="public" location="f7:2871" file="f7" line="2871" offset="64"/>
  <Field id="_4719" name="recieved_sfn_sf" type="_10" context="_651" access="public" location="f7:2882" file="f7" line="2882" offset="0"/>
  <Field id="_4720" name="expected_sfn_sf" type="_10" context="_651" access="public" location="f7:2883" file="f7" line="2883" offset="16"/>
  <Field id="_4721" name="sub_error_code" type="_9" context="_653" access="public" location="f7:2887" file="f7" line="2887" offset="0"/>
  <Field id="_4722" name="direction" type="_9" context="_653" access="public" location="f7:2888" file="f7" line="2888" offset="8"/>
  <Field id="_4723" name="rnti" type="_10" context="_653" access="public" location="f7:2889" file="f7" line="2889" offset="16"/>
  <Field id="_4724" name="pdu_type" type="_9" context="_653" access="public" location="f7:2890" file="f7" line="2890" offset="32"/>
  <Field id="_4725" name="recieved_sfn_sf" type="_10" context="_655" access="public" location="f7:2894" file="f7" line="2894" offset="0"/>
  <Field id="_4726" name="expected_sfn_sf" type="_10" context="_655" access="public" location="f7:2895" file="f7" line="2895" offset="16"/>
  <Field id="_4727" name="sub_error_code" type="_9" context="_657" access="public" location="f7:2899" file="f7" line="2899" offset="0"/>
  <Field id="_4728" name="phich_lowest_ul_rb_index" type="_9" context="_657" access="public" location="f7:2900" file="f7" line="2900" offset="8"/>
  <Field id="_4729" name="sub_error_code" type="_9" context="_659" access="public" location="f7:2904" file="f7" line="2904" offset="0"/>
  <Field id="_4730" name="pdu_index" type="_10" context="_659" access="public" location="f7:2905" file="f7" line="2905" offset="16"/>
  <Field id="_4731" name="tl" type="_111" context="_661" access="public" location="f7:2913" file="f7" line="2913" offset="0"/>
  <Field id="_4732" name="frequency_band_indicator" type="_9" context="_661" access="public" location="f7:2914" file="f7" line="2914" offset="32"/>
  <Field id="_4733" name="measurement_period" type="_10" context="_661" access="public" location="f7:2915" file="f7" line="2915" offset="48"/>
  <Field id="_4734" name="bandwidth" type="_9" context="_661" access="public" location="f7:2916" file="f7" line="2916" offset="64"/>
  <Field id="_4735" name="timeout" type="_11" context="_661" access="public" location="f7:2917" file="f7" line="2917" offset="96"/>
  <Field id="_4736" name="number_of_earfcns" type="_9" context="_661" access="public" location="f7:2918" file="f7" line="2918" offset="128"/>
  <Field id="_4737" name="earfcn" type="_7668" context="_661" access="public" location="f7:2919" file="f7" line="2919" offset="144"/>
  <Field id="_4738" name="tl" type="_111" context="_663" access="public" location="f7:2927" file="f7" line="2927" offset="0"/>
  <Field id="_4739" name="frequency_band_indicator" type="_9" context="_663" access="public" location="f7:2928" file="f7" line="2928" offset="32"/>
  <Field id="_4740" name="measurement_period" type="_10" context="_663" access="public" location="f7:2929" file="f7" line="2929" offset="48"/>
  <Field id="_4741" name="timeout" type="_11" context="_663" access="public" location="f7:2930" file="f7" line="2930" offset="64"/>
  <Field id="_4742" name="number_of_uarfcns" type="_9" context="_663" access="public" location="f7:2931" file="f7" line="2931" offset="96"/>
  <Field id="_4743" name="uarfcn" type="_7668" context="_663" access="public" location="f7:2932" file="f7" line="2932" offset="112"/>
  <Field id="_4744" name="arfcn" type="_10" context="_665" access="public" location="f7:2938" file="f7" line="2938" offset="0"/>
  <Field id="_4745" name="direction" type="_9" context="_665" access="public" location="f7:2939" file="f7" line="2939" offset="16"/>
  <Field id="_4746" name="tl" type="_111" context="_667" access="public" location="f7:2943" file="f7" line="2943" offset="0"/>
  <Field id="_4747" name="frequency_band_indicator" type="_9" context="_667" access="public" location="f7:2944" file="f7" line="2944" offset="32"/>
  <Field id="_4748" name="measurement_period" type="_10" context="_667" access="public" location="f7:2945" file="f7" line="2945" offset="48"/>
  <Field id="_4749" name="timeout" type="_11" context="_667" access="public" location="f7:2946" file="f7" line="2946" offset="64"/>
  <Field id="_4750" name="number_of_arfcns" type="_9" context="_667" access="public" location="f7:2947" file="f7" line="2947" offset="96"/>
  <Field id="_4751" name="arfcn" type="_7769" context="_667" access="public" location="f7:2948" file="f7" line="2948" offset="112"/>
  <Field id="_4752" name="earfcn" type="_10" context="_669" access="public" location="f7:2956" file="f7" line="2956" offset="0"/>
  <Field id="_4753" name="number_of_ro_dl" type="_9" context="_669" access="public" location="f7:2957" file="f7" line="2957" offset="16"/>
  <Field id="_4754" name="ro_dl" type="_7679" context="_669" access="public" location="f7:2958" file="f7" line="2958" offset="24"/>
  <Field id="_4755" name="tl" type="_111" context="_671" access="public" location="f7:2962" file="f7" line="2962" offset="0"/>
  <Field id="_4756" name="frequency_band_indicator" type="_9" context="_671" access="public" location="f7:2963" file="f7" line="2963" offset="32"/>
  <Field id="_4757" name="measurement_period" type="_10" context="_671" access="public" location="f7:2964" file="f7" line="2964" offset="48"/>
  <Field id="_4758" name="timeout" type="_11" context="_671" access="public" location="f7:2965" file="f7" line="2965" offset="64"/>
  <Field id="_4759" name="number_of_earfcns" type="_9" context="_671" access="public" location="f7:2966" file="f7" line="2966" offset="96"/>
  <Field id="_4760" name="earfcn" type="_7770" context="_671" access="public" location="f7:2967" file="f7" line="2967" offset="112"/>
  <Field id="_4761" name="tl" type="_111" context="_673" access="public" location="f7:2973" file="f7" line="2973" offset="0"/>
  <Field id="_4762" name="number_of_rssi" type="_10" context="_673" access="public" location="f7:2974" file="f7" line="2974" offset="32"/>
  <Field id="_4763" name="rssi" type="_7771" context="_673" access="public" location="f7:2975" file="f7" line="2975" offset="48"/>
  <Field id="_4764" name="tl" type="_111" context="_675" access="public" location="f7:2981" file="f7" line="2981" offset="0"/>
  <Field id="_4765" name="earfcn" type="_10" context="_675" access="public" location="f7:2982" file="f7" line="2982" offset="32"/>
  <Field id="_4766" name="measurement_bandwidth" type="_9" context="_675" access="public" location="f7:2983" file="f7" line="2983" offset="48"/>
  <Field id="_4767" name="exhaustive_search" type="_9" context="_675" access="public" location="f7:2984" file="f7" line="2984" offset="56"/>
  <Field id="_4768" name="timeout" type="_11" context="_675" access="public" location="f7:2985" file="f7" line="2985" offset="64"/>
  <Field id="_4769" name="number_of_pci" type="_9" context="_675" access="public" location="f7:2986" file="f7" line="2986" offset="96"/>
  <Field id="_4770" name="pci" type="_7668" context="_675" access="public" location="f7:2987" file="f7" line="2987" offset="112"/>
  <Field id="_4771" name="tl" type="_111" context="_677" access="public" location="f7:2993" file="f7" line="2993" offset="0"/>
  <Field id="_4772" name="uarfcn" type="_10" context="_677" access="public" location="f7:2994" file="f7" line="2994" offset="32"/>
  <Field id="_4773" name="exhaustive_search" type="_9" context="_677" access="public" location="f7:2995" file="f7" line="2995" offset="48"/>
  <Field id="_4774" name="timeout" type="_11" context="_677" access="public" location="f7:2996" file="f7" line="2996" offset="64"/>
  <Field id="_4775" name="number_of_psc" type="_9" context="_677" access="public" location="f7:2997" file="f7" line="2997" offset="96"/>
  <Field id="_4776" name="psc" type="_7668" context="_677" access="public" location="f7:2998" file="f7" line="2998" offset="112"/>
  <Field id="_4777" name="tl" type="_111" context="_679" access="public" location="f7:3004" file="f7" line="3004" offset="0"/>
  <Field id="_4778" name="timeout" type="_11" context="_679" access="public" location="f7:3005" file="f7" line="3005" offset="32"/>
  <Field id="_4779" name="number_of_arfcn" type="_9" context="_679" access="public" location="f7:3006" file="f7" line="3006" offset="64"/>
  <Field id="_4780" name="arfcn" type="_7772" context="_679" access="public" location="f7:3007" file="f7" line="3007" offset="80"/>
  <Field id="_4781" name="tl" type="_111" context="_681" access="public" location="f7:3013" file="f7" line="3013" offset="0"/>
  <Field id="_4782" name="earfcn" type="_10" context="_681" access="public" location="f7:3014" file="f7" line="3014" offset="32"/>
  <Field id="_4783" name="ro_dl" type="_9" context="_681" access="public" location="f7:3015" file="f7" line="3015" offset="48"/>
  <Field id="_4784" name="exhaustive_search" type="_9" context="_681" access="public" location="f7:3016" file="f7" line="3016" offset="56"/>
  <Field id="_4785" name="timeout" type="_11" context="_681" access="public" location="f7:3017" file="f7" line="3017" offset="64"/>
  <Field id="_4786" name="number_of_pci" type="_9" context="_681" access="public" location="f7:3018" file="f7" line="3018" offset="96"/>
  <Field id="_4787" name="pci" type="_7668" context="_681" access="public" location="f7:3019" file="f7" line="3019" offset="112"/>
  <Field id="_4788" name="pci" type="_10" context="_683" access="public" location="f7:3025" file="f7" line="3025" offset="0"/>
  <Field id="_4789" name="rsrp" type="_9" context="_683" access="public" location="f7:3026" file="f7" line="3026" offset="16"/>
  <Field id="_4790" name="rsrq" type="_9" context="_683" access="public" location="f7:3027" file="f7" line="3027" offset="24"/>
  <Field id="_4791" name="frequency_offset" type="_6" context="_683" access="public" location="f7:3028" file="f7" line="3028" offset="32"/>
  <Field id="_4792" name="tl" type="_111" context="_685" access="public" location="f7:3032" file="f7" line="3032" offset="0"/>
  <Field id="_4793" name="number_of_lte_cells_found" type="_10" context="_685" access="public" location="f7:3033" file="f7" line="3033" offset="32"/>
  <Field id="_4794" name="lte_found_cells" type="_7773" context="_685" access="public" location="f7:3034" file="f7" line="3034" offset="48"/>
  <Field id="_4795" name="psc" type="_10" context="_687" access="public" location="f7:3040" file="f7" line="3040" offset="0"/>
  <Field id="_4796" name="rscp" type="_9" context="_687" access="public" location="f7:3041" file="f7" line="3041" offset="16"/>
  <Field id="_4797" name="ecno" type="_9" context="_687" access="public" location="f7:3042" file="f7" line="3042" offset="24"/>
  <Field id="_4798" name="frequency_offset" type="_6" context="_687" access="public" location="f7:3043" file="f7" line="3043" offset="32"/>
  <Field id="_4799" name="tl" type="_111" context="_689" access="public" location="f7:3047" file="f7" line="3047" offset="0"/>
  <Field id="_4800" name="number_of_utran_cells_found" type="_10" context="_689" access="public" location="f7:3048" file="f7" line="3048" offset="32"/>
  <Field id="_4801" name="utran_found_cells" type="_7774" context="_689" access="public" location="f7:3049" file="f7" line="3049" offset="48"/>
  <Field id="_4802" name="arfcn" type="_10" context="_691" access="public" location="f7:3055" file="f7" line="3055" offset="0"/>
  <Field id="_4803" name="bsic" type="_9" context="_691" access="public" location="f7:3056" file="f7" line="3056" offset="16"/>
  <Field id="_4804" name="rxlev" type="_9" context="_691" access="public" location="f7:3057" file="f7" line="3057" offset="24"/>
  <Field id="_4805" name="rxqual" type="_9" context="_691" access="public" location="f7:3058" file="f7" line="3058" offset="32"/>
  <Field id="_4806" name="frequency_offset" type="_6" context="_691" access="public" location="f7:3059" file="f7" line="3059" offset="48"/>
  <Field id="_4807" name="sfn_offset" type="_11" context="_691" access="public" location="f7:3060" file="f7" line="3060" offset="64"/>
  <Field id="_4808" name="tl" type="_111" context="_693" access="public" location="f7:3064" file="f7" line="3064" offset="0"/>
  <Field id="_4809" name="number_of_gsm_cells_found" type="_10" context="_693" access="public" location="f7:3065" file="f7" line="3065" offset="32"/>
  <Field id="_4810" name="gsm_found_cells" type="_7775" context="_693" access="public" location="f7:3066" file="f7" line="3066" offset="64"/>
  <Field id="_4811" name="pci" type="_10" context="_695" access="public" location="f7:3072" file="f7" line="3072" offset="0"/>
  <Field id="_4812" name="rsrp" type="_9" context="_695" access="public" location="f7:3073" file="f7" line="3073" offset="16"/>
  <Field id="_4813" name="rsrq" type="_9" context="_695" access="public" location="f7:3074" file="f7" line="3074" offset="24"/>
  <Field id="_4814" name="frequency_offset" type="_6" context="_695" access="public" location="f7:3075" file="f7" line="3075" offset="32"/>
  <Field id="_4815" name="tl" type="_111" context="_697" access="public" location="f7:3079" file="f7" line="3079" offset="0"/>
  <Field id="_4816" name="number_of_nb_iot_cells_found" type="_10" context="_697" access="public" location="f7:3080" file="f7" line="3080" offset="32"/>
  <Field id="_4817" name="nb_iot_found_cells" type="_7776" context="_697" access="public" location="f7:3081" file="f7" line="3081" offset="48"/>
  <Field id="_4818" name="tl" type="_111" context="_700" access="public" location="f7:3091" file="f7" line="3091" offset="0"/>
  <Field id="_4819" name="earfcn" type="_10" context="_700" access="public" location="f7:3092" file="f7" line="3092" offset="32"/>
  <Field id="_4820" name="pci" type="_10" context="_700" access="public" location="f7:3093" file="f7" line="3093" offset="48"/>
  <Field id="_4821" name="timeout" type="_11" context="_700" access="public" location="f7:3094" file="f7" line="3094" offset="64"/>
  <Field id="_4822" name="tl" type="_111" context="_702" access="public" location="f7:3100" file="f7" line="3100" offset="0"/>
  <Field id="_4823" name="uarfcn" type="_10" context="_702" access="public" location="f7:3101" file="f7" line="3101" offset="32"/>
  <Field id="_4824" name="psc" type="_10" context="_702" access="public" location="f7:3102" file="f7" line="3102" offset="48"/>
  <Field id="_4825" name="timeout" type="_11" context="_702" access="public" location="f7:3103" file="f7" line="3103" offset="64"/>
  <Field id="_4826" name="tl" type="_111" context="_704" access="public" location="f7:3109" file="f7" line="3109" offset="0"/>
  <Field id="_4827" name="earfcn" type="_10" context="_704" access="public" location="f7:3110" file="f7" line="3110" offset="32"/>
  <Field id="_4828" name="ro_dl" type="_9" context="_704" access="public" location="f7:3111" file="f7" line="3111" offset="48"/>
  <Field id="_4829" name="pci" type="_10" context="_704" access="public" location="f7:3112" file="f7" line="3112" offset="64"/>
  <Field id="_4830" name="timeout" type="_11" context="_704" access="public" location="f7:3113" file="f7" line="3113" offset="96"/>
  <Field id="_4831" name="tl" type="_111" context="_706" access="public" location="f7:3119" file="f7" line="3119" offset="0"/>
  <Field id="_4832" name="number_of_tx_antenna" type="_9" context="_706" access="public" location="f7:3120" file="f7" line="3120" offset="32"/>
  <Field id="_4833" name="mib_length" type="_10" context="_706" access="public" location="f7:3121" file="f7" line="3121" offset="48"/>
  <Field id="_4834" name="mib" type="_7777" context="_706" access="public" location="f7:3122" file="f7" line="3122" offset="64"/>
  <Field id="_4835" name="sfn_offset" type="_11" context="_706" access="public" location="f7:3123" file="f7" line="3123" offset="320"/>
  <Field id="_4836" name="tl" type="_111" context="_708" access="public" location="f7:3129" file="f7" line="3129" offset="0"/>
  <Field id="_4837" name="mib_length" type="_10" context="_708" access="public" location="f7:3130" file="f7" line="3130" offset="32"/>
  <Field id="_4838" name="mib" type="_7777" context="_708" access="public" location="f7:3131" file="f7" line="3131" offset="48"/>
  <Field id="_4839" name="sfn_offset" type="_11" context="_708" access="public" location="f7:3132" file="f7" line="3132" offset="320"/>
  <Field id="_4840" name="tl" type="_111" context="_710" access="public" location="f7:3139" file="f7" line="3139" offset="0"/>
  <Field id="_4841" name="number_of_tx_antenna" type="_9" context="_710" access="public" location="f7:3140" file="f7" line="3140" offset="32"/>
  <Field id="_4842" name="mib_length" type="_10" context="_710" access="public" location="f7:3141" file="f7" line="3141" offset="48"/>
  <Field id="_4843" name="mib" type="_7777" context="_710" access="public" location="f7:3142" file="f7" line="3142" offset="64"/>
  <Field id="_4844" name="sfn_offset" type="_11" context="_710" access="public" location="f7:3143" file="f7" line="3143" offset="320"/>
  <Field id="_4845" name="tl" type="_111" context="_712" access="public" location="f7:3151" file="f7" line="3151" offset="0"/>
  <Field id="_4846" name="earfcn" type="_10" context="_712" access="public" location="f7:3152" file="f7" line="3152" offset="32"/>
  <Field id="_4847" name="pci" type="_10" context="_712" access="public" location="f7:3153" file="f7" line="3153" offset="48"/>
  <Field id="_4848" name="downlink_channel_bandwidth" type="_10" context="_712" access="public" location="f7:3154" file="f7" line="3154" offset="64"/>
  <Field id="_4849" name="phich_configuration" type="_9" context="_712" access="public" location="f7:3155" file="f7" line="3155" offset="80"/>
  <Field id="_4850" name="number_of_tx_antenna" type="_9" context="_712" access="public" location="f7:3156" file="f7" line="3156" offset="88"/>
  <Field id="_4851" name="retry_count" type="_9" context="_712" access="public" location="f7:3157" file="f7" line="3157" offset="96"/>
  <Field id="_4852" name="timeout" type="_11" context="_712" access="public" location="f7:3158" file="f7" line="3158" offset="128"/>
  <Field id="_4853" name="tl" type="_111" context="_714" access="public" location="f7:3165" file="f7" line="3165" offset="0"/>
  <Field id="_4854" name="earfcn" type="_10" context="_714" access="public" location="f7:3166" file="f7" line="3166" offset="32"/>
  <Field id="_4855" name="ro_dl" type="_9" context="_714" access="public" location="f7:3167" file="f7" line="3167" offset="48"/>
  <Field id="_4856" name="pci" type="_10" context="_714" access="public" location="f7:3168" file="f7" line="3168" offset="64"/>
  <Field id="_4857" name="scheduling_info_sib1_nb" type="_9" context="_714" access="public" location="f7:3169" file="f7" line="3169" offset="80"/>
  <Field id="_4858" name="timeout" type="_11" context="_714" access="public" location="f7:3170" file="f7" line="3170" offset="96"/>
  <Field id="_4859" name="si_periodicity" type="_9" context="_717" access="public" location="f7:3178" file="f7" line="3178" offset="0"/>
  <Field id="_4860" name="si_index" type="_9" context="_717" access="public" location="f7:3179" file="f7" line="3179" offset="8"/>
  <Field id="_4861" name="tl" type="_111" context="_719" access="public" location="f7:3183" file="f7" line="3183" offset="0"/>
  <Field id="_4862" name="earfcn" type="_10" context="_719" access="public" location="f7:3184" file="f7" line="3184" offset="32"/>
  <Field id="_4863" name="pci" type="_10" context="_719" access="public" location="f7:3185" file="f7" line="3185" offset="48"/>
  <Field id="_4864" name="downlink_channel_bandwidth" type="_10" context="_719" access="public" location="f7:3186" file="f7" line="3186" offset="64"/>
  <Field id="_4865" name="phich_configuration" type="_9" context="_719" access="public" location="f7:3187" file="f7" line="3187" offset="80"/>
  <Field id="_4866" name="number_of_tx_antenna" type="_9" context="_719" access="public" location="f7:3188" file="f7" line="3188" offset="88"/>
  <Field id="_4867" name="number_of_si_periodicity" type="_9" context="_719" access="public" location="f7:3189" file="f7" line="3189" offset="96"/>
  <Field id="_4868" name="si_periodicity" type="_7778" context="_719" access="public" location="f7:3190" file="f7" line="3190" offset="104"/>
  <Field id="_4869" name="si_window_length" type="_9" context="_719" access="public" location="f7:3191" file="f7" line="3191" offset="232"/>
  <Field id="_4870" name="timeout" type="_11" context="_719" access="public" location="f7:3192" file="f7" line="3192" offset="256"/>
  <Field id="_4871" name="tl" type="_111" context="_721" access="public" location="f7:3198" file="f7" line="3198" offset="0"/>
  <Field id="_4872" name="uarfcn" type="_10" context="_721" access="public" location="f7:3199" file="f7" line="3199" offset="32"/>
  <Field id="_4873" name="psc" type="_10" context="_721" access="public" location="f7:3200" file="f7" line="3200" offset="48"/>
  <Field id="_4874" name="timeout" type="_11" context="_721" access="public" location="f7:3201" file="f7" line="3201" offset="64"/>
  <Field id="_4875" name="tl" type="_111" context="_723" access="public" location="f7:3207" file="f7" line="3207" offset="0"/>
  <Field id="_4876" name="arfcn" type="_10" context="_723" access="public" location="f7:3208" file="f7" line="3208" offset="32"/>
  <Field id="_4877" name="bsic" type="_9" context="_723" access="public" location="f7:3209" file="f7" line="3209" offset="48"/>
  <Field id="_4878" name="timeout" type="_11" context="_723" access="public" location="f7:3210" file="f7" line="3210" offset="64"/>
  <Field id="_4879" name="si_periodicity" type="_9" context="_725" access="public" location="f7:3216" file="f7" line="3216" offset="0"/>
  <Field id="_4880" name="si_repetition_pattern" type="_9" context="_725" access="public" location="f7:3217" file="f7" line="3217" offset="8"/>
  <Field id="_4881" name="si_tb_size" type="_9" context="_725" access="public" location="f7:3218" file="f7" line="3218" offset="16"/>
  <Field id="_4882" name="number_of_si_index" type="_9" context="_725" access="public" location="f7:3219" file="f7" line="3219" offset="24"/>
  <Field id="_4883" name="si_index" type="_7679" context="_725" access="public" location="f7:3220" file="f7" line="3220" offset="32"/>
  <Field id="_4884" name="tl" type="_111" context="_727" access="public" location="f7:3224" file="f7" line="3224" offset="0"/>
  <Field id="_4885" name="earfcn" type="_10" context="_727" access="public" location="f7:3225" file="f7" line="3225" offset="32"/>
  <Field id="_4886" name="ro_dl" type="_9" context="_727" access="public" location="f7:3226" file="f7" line="3226" offset="48"/>
  <Field id="_4887" name="pci" type="_10" context="_727" access="public" location="f7:3227" file="f7" line="3227" offset="64"/>
  <Field id="_4888" name="number_of_si_periodicity" type="_9" context="_727" access="public" location="f7:3228" file="f7" line="3228" offset="80"/>
  <Field id="_4889" name="si_periodicity" type="_7779" context="_727" access="public" location="f7:3229" file="f7" line="3229" offset="88"/>
  <Field id="_4890" name="si_window_length" type="_9" context="_727" access="public" location="f7:3230" file="f7" line="3230" offset="856"/>
  <Field id="_4891" name="timeout" type="_11" context="_727" access="public" location="f7:3231" file="f7" line="3231" offset="864"/>
  <Field id="_4892" name="tl" type="_111" context="_729" access="public" location="f7:3237" file="f7" line="3237" offset="0"/>
  <Field id="_4893" name="sib_type" type="_9" context="_729" access="public" location="f7:3238" file="f7" line="3238" offset="32"/>
  <Field id="_4894" name="sib_length" type="_10" context="_729" access="public" location="f7:3239" file="f7" line="3239" offset="48"/>
  <Field id="_4895" name="sib" type="_7780" context="_729" access="public" location="f7:3240" file="f7" line="3240" offset="64"/>
  <Field id="_4896" name="tl" type="_111" context="_731" access="public" location="f7:3246" file="f7" line="3246" offset="0"/>
  <Field id="_4897" name="sib_length" type="_10" context="_731" access="public" location="f7:3247" file="f7" line="3247" offset="32"/>
  <Field id="_4898" name="sib" type="_7780" context="_731" access="public" location="f7:3248" file="f7" line="3248" offset="48"/>
  <Field id="_4899" name="tl" type="_111" context="_733" access="public" location="f7:3254" file="f7" line="3254" offset="0"/>
  <Field id="_4900" name="si_length" type="_10" context="_733" access="public" location="f7:3255" file="f7" line="3255" offset="32"/>
  <Field id="_4901" name="si" type="_7780" context="_733" access="public" location="f7:3256" file="f7" line="3256" offset="48"/>
  <Field id="_4902" name="tl" type="_111" context="_735" access="public" location="f7:3262" file="f7" line="3262" offset="0"/>
  <Field id="_4903" name="sib_type" type="_9" context="_735" access="public" location="f7:3263" file="f7" line="3263" offset="32"/>
  <Field id="_4904" name="sib_length" type="_10" context="_735" access="public" location="f7:3264" file="f7" line="3264" offset="48"/>
  <Field id="_4905" name="sib" type="_7780" context="_735" access="public" location="f7:3265" file="f7" line="3265" offset="64"/>
  <Field id="_4906" name="header" type="_109" context="_737" access="public" location="f7:3280" file="f7" line="3280" offset="0"/>
  <Field id="_4907" name="sfn_sf" type="_10" context="_737" access="public" location="f7:3281" file="f7" line="3281" offset="128"/>
  <Field id="_4908" name="dl_config_request_body" type="_367" context="_737" access="public" location="f7:3282" file="f7" line="3282" offset="192"/>
  <Field id="_4909" name="vendor_extension" type="_112" context="_737" access="public" location="f7:3283" file="f7" line="3283" offset="384"/>
  <Field id="_4910" name="header" type="_109" context="_739" access="public" location="f7:3287" file="f7" line="3287" offset="0"/>
  <Field id="_4911" name="sfn_sf" type="_10" context="_739" access="public" location="f7:3288" file="f7" line="3288" offset="128"/>
  <Field id="_4912" name="ul_config_request_body" type="_489" context="_739" access="public" location="f7:3289" file="f7" line="3289" offset="192"/>
  <Field id="_4913" name="vendor_extension" type="_112" context="_739" access="public" location="f7:3290" file="f7" line="3290" offset="320"/>
  <Field id="_4914" name="header" type="_109" context="_741" access="public" location="f7:3294" file="f7" line="3294" offset="0"/>
  <Field id="_4915" name="sfn_sf" type="_10" context="_741" access="public" location="f7:3295" file="f7" line="3295" offset="128"/>
  <Field id="_4916" name="hi_dci0_request_body" type="_520" context="_741" access="public" location="f7:3296" file="f7" line="3296" offset="192"/>
  <Field id="_4917" name="vendor_extension" type="_112" context="_741" access="public" location="f7:3297" file="f7" line="3297" offset="320"/>
  <Field id="_4918" name="header" type="_109" context="_743" access="public" location="f7:3301" file="f7" line="3301" offset="0"/>
  <Field id="_4919" name="sfn_sf" type="_10" context="_743" access="public" location="f7:3302" file="f7" line="3302" offset="128"/>
  <Field id="_4920" name="tx_request_body" type="_524" context="_743" access="public" location="f7:3303" file="f7" line="3303" offset="192"/>
  <Field id="_4921" name="vendor_extension" type="_112" context="_743" access="public" location="f7:3304" file="f7" line="3304" offset="320"/>
  <Field id="_4922" name="header" type="_109" context="_745" access="public" location="f7:3308" file="f7" line="3308" offset="0"/>
  <Field id="_4923" name="sfn_sf" type="_10" context="_745" access="public" location="f7:3309" file="f7" line="3309" offset="128"/>
  <Field id="_4924" name="header" type="_109" context="_747" access="public" location="f7:3313" file="f7" line="3313" offset="0"/>
  <Field id="_4925" name="sfn_sf" type="_10" context="_747" access="public" location="f7:3314" file="f7" line="3314" offset="128"/>
  <Field id="_4926" name="harq_indication_body" type="_558" context="_747" access="public" location="f7:3315" file="f7" line="3315" offset="192"/>
  <Field id="_4927" name="vendor_extension" type="_112" context="_747" access="public" location="f7:3316" file="f7" line="3316" offset="320"/>
  <Field id="_4928" name="header" type="_109" context="_749" access="public" location="f7:3320" file="f7" line="3320" offset="0"/>
  <Field id="_4929" name="sfn_sf" type="_10" context="_749" access="public" location="f7:3321" file="f7" line="3321" offset="128"/>
  <Field id="_4930" name="crc_indication_body" type="_564" context="_749" access="public" location="f7:3322" file="f7" line="3322" offset="192"/>
  <Field id="_4931" name="vendor_extension" type="_112" context="_749" access="public" location="f7:3323" file="f7" line="3323" offset="320"/>
  <Field id="_4932" name="header" type="_109" context="_751" access="public" location="f7:3327" file="f7" line="3327" offset="0"/>
  <Field id="_4933" name="sfn_sf" type="_10" context="_751" access="public" location="f7:3328" file="f7" line="3328" offset="128"/>
  <Field id="_4934" name="sr_indication_body" type="_568" context="_751" access="public" location="f7:3329" file="f7" line="3329" offset="192"/>
  <Field id="_4935" name="vendor_extension" type="_112" context="_751" access="public" location="f7:3330" file="f7" line="3330" offset="320"/>
  <Field id="_4936" name="header" type="_109" context="_753" access="public" location="f7:3334" file="f7" line="3334" offset="0"/>
  <Field id="_4937" name="sfn_sf" type="_10" context="_753" access="public" location="f7:3335" file="f7" line="3335" offset="128"/>
  <Field id="_4938" name="cqi_indication_body" type="_578" context="_753" access="public" location="f7:3336" file="f7" line="3336" offset="192"/>
  <Field id="_4939" name="vendor_extension" type="_112" context="_753" access="public" location="f7:3337" file="f7" line="3337" offset="384"/>
  <Field id="_4940" name="header" type="_109" context="_755" access="public" location="f7:3341" file="f7" line="3341" offset="0"/>
  <Field id="_4941" name="sfn_sf" type="_10" context="_755" access="public" location="f7:3342" file="f7" line="3342" offset="128"/>
  <Field id="_4942" name="rach_indication_body" type="_588" context="_755" access="public" location="f7:3343" file="f7" line="3343" offset="192"/>
  <Field id="_4943" name="vendor_extension" type="_112" context="_755" access="public" location="f7:3344" file="f7" line="3344" offset="320"/>
  <Field id="_4944" name="header" type="_109" context="_757" access="public" location="f7:3348" file="f7" line="3348" offset="0"/>
  <Field id="_4945" name="sfn_sf" type="_10" context="_757" access="public" location="f7:3349" file="f7" line="3349" offset="128"/>
  <Field id="_4946" name="srs_indication_body" type="_602" context="_757" access="public" location="f7:3350" file="f7" line="3350" offset="192"/>
  <Field id="_4947" name="vendor_extension" type="_112" context="_757" access="public" location="f7:3351" file="f7" line="3351" offset="320"/>
  <Field id="_4948" name="header" type="_109" context="_759" access="public" location="f7:3355" file="f7" line="3355" offset="0"/>
  <Field id="_4949" name="sfn_sf" type="_10" context="_759" access="public" location="f7:3356" file="f7" line="3356" offset="128"/>
  <Field id="_4950" name="rx_indication_body" type="_610" context="_759" access="public" location="f7:3357" file="f7" line="3357" offset="192"/>
  <Field id="_4951" name="vendor_extension" type="_112" context="_759" access="public" location="f7:3358" file="f7" line="3358" offset="320"/>
  <Field id="_4952" name="header" type="_109" context="_761" access="public" location="f7:3362" file="f7" line="3362" offset="0"/>
  <Field id="_4953" name="sfn_sf" type="_10" context="_761" access="public" location="f7:3363" file="f7" line="3363" offset="128"/>
  <Field id="_4954" name="nb_harq_indication_body" type="_616" context="_761" access="public" location="f7:3364" file="f7" line="3364" offset="192"/>
  <Field id="_4955" name="vendor_extension" type="_112" context="_761" access="public" location="f7:3365" file="f7" line="3365" offset="320"/>
  <Field id="_4956" name="header" type="_109" context="_763" access="public" location="f7:3369" file="f7" line="3369" offset="0"/>
  <Field id="_4957" name="sfn_sf" type="_10" context="_763" access="public" location="f7:3370" file="f7" line="3370" offset="128"/>
  <Field id="_4958" name="nrach_indication_body" type="_622" context="_763" access="public" location="f7:3371" file="f7" line="3371" offset="192"/>
  <Field id="_4959" name="vendor_extension" type="_112" context="_763" access="public" location="f7:3372" file="f7" line="3372" offset="320"/>
  <Field id="_4960" name="header" type="_109" context="_765" access="public" location="f7:3376" file="f7" line="3376" offset="0"/>
  <Field id="_4961" name="sfn_sf" type="_10" context="_765" access="public" location="f7:3377" file="f7" line="3377" offset="128"/>
  <Field id="_4962" name="lbt_dl_config_request_body" type="_634" context="_765" access="public" location="f7:3378" file="f7" line="3378" offset="192"/>
  <Field id="_4963" name="vendor_extension" type="_112" context="_765" access="public" location="f7:3379" file="f7" line="3379" offset="320"/>
  <Field id="_4964" name="header" type="_109" context="_767" access="public" location="f7:3383" file="f7" line="3383" offset="0"/>
  <Field id="_4965" name="sfn_sf" type="_10" context="_767" access="public" location="f7:3384" file="f7" line="3384" offset="128"/>
  <Field id="_4966" name="lbt_dl_indication_body" type="_646" context="_767" access="public" location="f7:3385" file="f7" line="3385" offset="192"/>
  <Field id="_4967" name="vendor_extension" type="_112" context="_767" access="public" location="f7:3386" file="f7" line="3386" offset="320"/>
  <Field id="_4968" name="header" type="_109" context="_769" access="public" location="f7:3391" file="f7" line="3391" offset="0"/>
  <Field id="_4969" name="message_id" type="_9" context="_769" access="public" location="f7:3392" file="f7" line="3392" offset="128"/>
  <Field id="_4970" name="error_code" type="_9" context="_769" access="public" location="f7:3393" file="f7" line="3393" offset="136"/>
  <Union id="_4971" context="_769" access="public" location="f7:3394" file="f7" line="3394" members="_7781 _7782 _7783 _7784 _7785 _7786 _7787" size="48" align="16"/>
  <Field id="_4972" name="" type="_4971" context="_769" access="public" location="f7:3394" file="f7" line="3394" offset="144"/>
  <Unimplemented id="_4973" kind="IndirectField"/>
  <Unimplemented id="_4974" kind="IndirectField"/>
  <Unimplemented id="_4975" kind="IndirectField"/>
  <Unimplemented id="_4976" kind="IndirectField"/>
  <Unimplemented id="_4977" kind="IndirectField"/>
  <Unimplemented id="_4978" kind="IndirectField"/>
  <Unimplemented id="_4979" kind="IndirectField"/>
  <Field id="_4980" name="vendor_extension" type="_112" context="_769" access="public" location="f7:3403" file="f7" line="3403" offset="192"/>
  <Field id="_4981" name="header" type="_107" context="_771" access="public" location="f7:3411" file="f7" line="3411" offset="0"/>
  <Field id="_4982" name="rat_type" type="_9" context="_771" access="public" location="f7:3412" file="f7" line="3412" offset="64"/>
  <Union id="_4983" context="_771" access="public" location="f7:3413" file="f7" line="3413" members="_7788 _7789 _7790 _7791" size="3200" align="32"/>
  <Field id="_4984" name="" type="_4983" context="_771" access="public" location="f7:3413" file="f7" line="3413" offset="96"/>
  <Unimplemented id="_4985" kind="IndirectField"/>
  <Unimplemented id="_4986" kind="IndirectField"/>
  <Unimplemented id="_4987" kind="IndirectField"/>
  <Unimplemented id="_4988" kind="IndirectField"/>
  <Field id="_4989" name="vendor_extension" type="_112" context="_771" access="public" location="f7:3419" file="f7" line="3419" offset="3328"/>
  <Field id="_4990" name="header" type="_107" context="_773" access="public" location="f7:3423" file="f7" line="3423" offset="0"/>
  <Field id="_4991" name="error_code" type="_11" context="_773" access="public" location="f7:3424" file="f7" line="3424" offset="64"/>
  <Field id="_4992" name="vendor_extension" type="_112" context="_773" access="public" location="f7:3425" file="f7" line="3425" offset="128"/>
  <Field id="_4993" name="header" type="_107" context="_775" access="public" location="f7:3429" file="f7" line="3429" offset="0"/>
  <Field id="_4994" name="error_code" type="_11" context="_775" access="public" location="f7:3430" file="f7" line="3430" offset="64"/>
  <Field id="_4995" name="rssi_indication_body" type="_674" context="_775" access="public" location="f7:3431" file="f7" line="3431" offset="96"/>
  <Field id="_4996" name="vendor_extension" type="_112" context="_775" access="public" location="f7:3432" file="f7" line="3432" offset="320"/>
  <Field id="_4997" name="header" type="_107" context="_777" access="public" location="f7:3436" file="f7" line="3436" offset="0"/>
  <Field id="_4998" name="rat_type" type="_9" context="_777" access="public" location="f7:3437" file="f7" line="3437" offset="64"/>
  <Union id="_4999" context="_777" access="public" location="f7:3438" file="f7" line="3438" members="_7792 _7793 _7794 _7795" size="2144" align="32"/>
  <Field id="_5000" name="" type="_4999" context="_777" access="public" location="f7:3438" file="f7" line="3438" offset="96"/>
  <Unimplemented id="_5001" kind="IndirectField"/>
  <Unimplemented id="_5002" kind="IndirectField"/>
  <Unimplemented id="_5003" kind="IndirectField"/>
  <Unimplemented id="_5004" kind="IndirectField"/>
  <Field id="_5005" name="vendor_extension" type="_112" context="_777" access="public" location="f7:3444" file="f7" line="3444" offset="2240"/>
  <Field id="_5006" name="header" type="_107" context="_779" access="public" location="f7:3448" file="f7" line="3448" offset="0"/>
  <Field id="_5007" name="error_code" type="_11" context="_779" access="public" location="f7:3449" file="f7" line="3449" offset="64"/>
  <Field id="_5008" name="vendor_extension" type="_112" context="_779" access="public" location="f7:3450" file="f7" line="3450" offset="128"/>
  <Field id="_5009" name="header" type="_107" context="_781" access="public" location="f7:3454" file="f7" line="3454" offset="0"/>
  <Field id="_5010" name="error_code" type="_11" context="_781" access="public" location="f7:3455" file="f7" line="3455" offset="64"/>
  <Field id="_5011" name="lte_cell_search_indication" type="_686" context="_781" access="public" location="f7:3456" file="f7" line="3456" offset="96"/>
  <Field id="_5012" name="utran_cell_search_indication" type="_690" context="_781" access="public" location="f7:3457" file="f7" line="3457" offset="528"/>
  <Field id="_5013" name="geran_cell_search_indication" type="_694" context="_781" access="public" location="f7:3458" file="f7" line="3458" offset="960"/>
  <Field id="_5014" name="pnf_cell_search_state" type="_699" context="_781" access="public" location="f7:3459" file="f7" line="3459" offset="1792"/>
  <Field id="_5015" name="nb_iot_cell_search_indication" type="_698" context="_781" access="public" location="f7:3460" file="f7" line="3460" offset="2368"/>
  <Field id="_5016" name="vendor_extension" type="_112" context="_781" access="public" location="f7:3461" file="f7" line="3461" offset="2816"/>
  <Field id="_5017" name="header" type="_107" context="_783" access="public" location="f7:3466" file="f7" line="3466" offset="0"/>
  <Field id="_5018" name="rat_type" type="_9" context="_783" access="public" location="f7:3467" file="f7" line="3467" offset="64"/>
  <Union id="_5019" context="_783" access="public" location="f7:3468" file="f7" line="3468" members="_7796 _7797 _7798" size="128" align="32"/>
  <Field id="_5020" name="" type="_5019" context="_783" access="public" location="f7:3468" file="f7" line="3468" offset="96"/>
  <Unimplemented id="_5021" kind="IndirectField"/>
  <Unimplemented id="_5022" kind="IndirectField"/>
  <Unimplemented id="_5023" kind="IndirectField"/>
  <Field id="_5024" name="pnf_cell_search_state" type="_699" context="_783" access="public" location="f7:3473" file="f7" line="3473" offset="224"/>
  <Field id="_5025" name="vendor_extension" type="_112" context="_783" access="public" location="f7:3474" file="f7" line="3474" offset="832"/>
  <Field id="_5026" name="header" type="_107" context="_785" access="public" location="f7:3478" file="f7" line="3478" offset="0"/>
  <Field id="_5027" name="error_code" type="_11" context="_785" access="public" location="f7:3479" file="f7" line="3479" offset="64"/>
  <Field id="_5028" name="vendor_extension" type="_112" context="_785" access="public" location="f7:3480" file="f7" line="3480" offset="128"/>
  <Field id="_5029" name="header" type="_107" context="_787" access="public" location="f7:3484" file="f7" line="3484" offset="0"/>
  <Field id="_5030" name="error_code" type="_11" context="_787" access="public" location="f7:3485" file="f7" line="3485" offset="64"/>
  <Field id="_5031" name="lte_broadcast_detect_indication" type="_707" context="_787" access="public" location="f7:3486" file="f7" line="3486" offset="96"/>
  <Field id="_5032" name="utran_broadcast_detect_indication" type="_709" context="_787" access="public" location="f7:3487" file="f7" line="3487" offset="448"/>
  <Field id="_5033" name="nb_iot_broadcast_detect_indication" type="_711" context="_787" access="public" location="f7:3488" file="f7" line="3488" offset="800"/>
  <Field id="_5034" name="pnf_cell_broadcast_state" type="_716" context="_787" access="public" location="f7:3489" file="f7" line="3489" offset="1152"/>
  <Field id="_5035" name="vendor_extension" type="_112" context="_787" access="public" location="f7:3490" file="f7" line="3490" offset="1728"/>
  <Field id="_5036" name="header" type="_107" context="_789" access="public" location="f7:3494" file="f7" line="3494" offset="0"/>
  <Field id="_5037" name="rat_type" type="_9" context="_789" access="public" location="f7:3495" file="f7" line="3495" offset="64"/>
  <Union id="_5038" context="_789" access="public" location="f7:3496" file="f7" line="3496" members="_7799 _7800" size="160" align="32"/>
  <Field id="_5039" name="" type="_5038" context="_789" access="public" location="f7:3496" file="f7" line="3496" offset="96"/>
  <Unimplemented id="_5040" kind="IndirectField"/>
  <Unimplemented id="_5041" kind="IndirectField"/>
  <Field id="_5042" name="pnf_cell_broadcast_state" type="_716" context="_789" access="public" location="f7:3500" file="f7" line="3500" offset="256"/>
  <Field id="_5043" name="vendor_extension" type="_112" context="_789" access="public" location="f7:3501" file="f7" line="3501" offset="832"/>
  <Field id="_5044" name="header" type="_107" context="_791" access="public" location="f7:3505" file="f7" line="3505" offset="0"/>
  <Field id="_5045" name="error_code" type="_11" context="_791" access="public" location="f7:3506" file="f7" line="3506" offset="64"/>
  <Field id="_5046" name="vendor_extension" type="_112" context="_791" access="public" location="f7:3507" file="f7" line="3507" offset="128"/>
  <Field id="_5047" name="header" type="_107" context="_793" access="public" location="f7:3511" file="f7" line="3511" offset="0"/>
  <Field id="_5048" name="error_code" type="_11" context="_793" access="public" location="f7:3512" file="f7" line="3512" offset="64"/>
  <Field id="_5049" name="lte_system_information_indication" type="_730" context="_793" access="public" location="f7:3513" file="f7" line="3513" offset="96"/>
  <Field id="_5050" name="nb_iot_system_information_indication" type="_736" context="_793" access="public" location="f7:3514" file="f7" line="3514" offset="2208"/>
  <Field id="_5051" name="vendor_extension" type="_112" context="_793" access="public" location="f7:3515" file="f7" line="3515" offset="4352"/>
  <Field id="_5052" name="header" type="_107" context="_795" access="public" location="f7:3519" file="f7" line="3519" offset="0"/>
  <Field id="_5053" name="rat_type" type="_9" context="_795" access="public" location="f7:3520" file="f7" line="3520" offset="64"/>
  <Union id="_5054" context="_795" access="public" location="f7:3521" file="f7" line="3521" members="_7801 _7802 _7803 _7804" size="896" align="32"/>
  <Field id="_5055" name="" type="_5054" context="_795" access="public" location="f7:3521" file="f7" line="3521" offset="96"/>
  <Unimplemented id="_5056" kind="IndirectField"/>
  <Unimplemented id="_5057" kind="IndirectField"/>
  <Unimplemented id="_5058" kind="IndirectField"/>
  <Unimplemented id="_5059" kind="IndirectField"/>
  <Field id="_5060" name="pnf_cell_broadcast_state" type="_716" context="_795" access="public" location="f7:3527" file="f7" line="3527" offset="992"/>
  <Field id="_5061" name="vendor_extension" type="_112" context="_795" access="public" location="f7:3528" file="f7" line="3528" offset="1600"/>
  <Field id="_5062" name="header" type="_107" context="_797" access="public" location="f7:3532" file="f7" line="3532" offset="0"/>
  <Field id="_5063" name="error_code" type="_11" context="_797" access="public" location="f7:3533" file="f7" line="3533" offset="64"/>
  <Field id="_5064" name="vendor_extension" type="_112" context="_797" access="public" location="f7:3534" file="f7" line="3534" offset="128"/>
  <Field id="_5065" name="header" type="_107" context="_799" access="public" location="f7:3538" file="f7" line="3538" offset="0"/>
  <Field id="_5066" name="error_code" type="_11" context="_799" access="public" location="f7:3539" file="f7" line="3539" offset="64"/>
  <Field id="_5067" name="lte_system_information_indication" type="_730" context="_799" access="public" location="f7:3540" file="f7" line="3540" offset="96"/>
  <Field id="_5068" name="utran_system_information_indication" type="_732" context="_799" access="public" location="f7:3541" file="f7" line="3541" offset="2208"/>
  <Field id="_5069" name="geran_system_information_indication" type="_734" context="_799" access="public" location="f7:3542" file="f7" line="3542" offset="4304"/>
  <Field id="_5070" name="nb_iot_system_information_indication" type="_736" context="_799" access="public" location="f7:3543" file="f7" line="3543" offset="6400"/>
  <Field id="_5071" name="vendor_extension" type="_112" context="_799" access="public" location="f7:3544" file="f7" line="3544" offset="8512"/>
  <Field id="_5072" name="header" type="_107" context="_801" access="public" location="f7:3548" file="f7" line="3548" offset="0"/>
  <Field id="_5073" name="vendor_extension" type="_112" context="_801" access="public" location="f7:3549" file="f7" line="3549" offset="64"/>
  <Field id="_5074" name="header" type="_107" context="_803" access="public" location="f7:3553" file="f7" line="3553" offset="0"/>
  <Field id="_5075" name="error_code" type="_11" context="_803" access="public" location="f7:3554" file="f7" line="3554" offset="64"/>
  <Field id="_5076" name="vendor_extension" type="_112" context="_803" access="public" location="f7:3555" file="f7" line="3555" offset="128"/>
  <Field id="_5077" name="allocate" type="_7805" context="_805" access="public" location="f7:3573" file="f7" line="3573" offset="0"/>
  <Field id="_5078" name="deallocate" type="_7806" context="_805" access="public" location="f7:3580" file="f7" line="3580" offset="64"/>
  <Field id="_5079" name="unpack_vendor_extension_tlv" type="_7807" context="_805" access="public" location="f7:3596" file="f7" line="3596" offset="128"/>
  <Field id="_5080" name="pack_vendor_extension_tlv" type="_7808" context="_805" access="public" location="f7:3611" file="f7" line="3611" offset="192"/>
  <Field id="_5081" name="unpack_p7_vendor_extension" type="_7809" context="_805" access="public" location="f7:3624" file="f7" line="3624" offset="256"/>
  <Field id="_5082" name="pack_p7_vendor_extension" type="_7809" context="_805" access="public" location="f7:3637" file="f7" line="3637" offset="320"/>
  <Field id="_5083" name="user_data" type="_5091" context="_805" access="public" location="f7:3641" file="f7" line="3641" offset="384"/>
  <Field id="_5084" name="allocate" type="_7805" context="_807" access="public" location="f7:3656" file="f7" line="3656" offset="0"/>
  <Field id="_5085" name="deallocate" type="_7806" context="_807" access="public" location="f7:3663" file="f7" line="3663" offset="64"/>
  <Field id="_5086" name="unpack_vendor_extension_tlv" type="_7810" context="_807" access="public" location="f7:3675" file="f7" line="3675" offset="128"/>
  <Field id="_5087" name="pack_vendor_extension_tlv" type="_7811" context="_807" access="public" location="f7:3686" file="f7" line="3686" offset="192"/>
  <Field id="_5088" name="unpack_p4_p5_vendor_extension" type="_7812" context="_807" access="public" location="f7:3697" file="f7" line="3697" offset="256"/>
  <Field id="_5089" name="pack_p4_p5_vendor_extension" type="_7812" context="_807" access="public" location="f7:3708" file="f7" line="3708" offset="320"/>
  <Field id="_5090" name="user_data" type="_5091" context="_807" access="public" location="f7:3712" file="f7" line="3712" offset="384"/>
  <PointerType id="_5091" type="_5809"/>
  <CvQualifiedType id="_5091r" type="_5091" restrict="1"/>
  <PointerType id="_5092" type="_808"/>
  <PointerType id="_5093" type="_806"/>
  <PointerType id="_5094" type="_9"/>
  <Field id="_5095" name="phich_duration" type="_828" context="_831" access="public" location="f8:92" file="f8" line="92" offset="0"/>
  <Field id="_5096" name="phich_resource" type="_830" context="_831" access="public" location="f8:94" file="f8" line="94" offset="32"/>
  <Field id="_5097" name="prach_ConfigIndex" type="_9" context="_833" access="public" location="f8:100" file="f8" line="100" offset="0"/>
  <Field id="_5098" name="highSpeedFlag" type="_9" context="_833" access="public" location="f8:102" file="f8" line="102" offset="8"/>
  <Field id="_5099" name="zeroCorrelationZoneConfig" type="_9" context="_833" access="public" location="f8:104" file="f8" line="104" offset="16"/>
  <Field id="_5100" name="prach_FreqOffset" type="_9" context="_833" access="public" location="f8:106" file="f8" line="106" offset="24"/>
  <Field id="_5101" name="rootSequenceIndex" type="_10" context="_835" access="public" location="f8:114" file="f8" line="114" offset="0"/>
  <Field id="_5102" name="prach_Config_enabled" type="_9" context="_835" access="public" location="f8:116" file="f8" line="116" offset="16"/>
  <Field id="_5103" name="prach_ConfigInfo" type="_834" context="_835" access="public" location="f8:118" file="f8" line="118" offset="24"/>
  <Field id="_5104" name="highSpeedFlag" type="_9" context="_837" access="public" location="f8:126" file="f8" line="126" offset="0"/>
  <Field id="_5105" name="zeroCorrelationZoneConfig" type="_9" context="_837" access="public" location="f8:128" file="f8" line="128" offset="8"/>
  <Field id="_5106" name="prach_starting_subframe_periodicity" type="_7667" context="_837" access="public" location="f8:132" file="f8" line="132" offset="16"/>
  <Field id="_5107" name="prach_numRepetitionPerPreambleAttempt" type="_7667" context="_837" access="public" location="f8:134" file="f8" line="134" offset="48"/>
  <Field id="_5108" name="prach_ConfigIndex" type="_7667" context="_837" access="public" location="f8:136" file="f8" line="136" offset="80"/>
  <Field id="_5109" name="prach_CElevel_enable" type="_7667" context="_837" access="public" location="f8:138" file="f8" line="138" offset="112"/>
  <Field id="_5110" name="prach_FreqOffset" type="_7667" context="_837" access="public" location="f8:140" file="f8" line="140" offset="144"/>
  <Field id="_5111" name="prach_hopping_enable" type="_7667" context="_837" access="public" location="f8:142" file="f8" line="142" offset="176"/>
  <Field id="_5112" name="prach_hopping_offset" type="_7667" context="_837" access="public" location="f8:144" file="f8" line="144" offset="208"/>
  <Field id="_5113" name="rootSequenceIndex" type="_10" context="_839" access="public" location="f8:150" file="f8" line="150" offset="0"/>
  <Field id="_5114" name="prach_Config_enabled" type="_9" context="_839" access="public" location="f8:152" file="f8" line="152" offset="16"/>
  <Field id="_5115" name="prach_ConfigInfo" type="_838" context="_839" access="public" location="f8:155" file="f8" line="155" offset="24"/>
  <Field id="_5116" name="ackNackRepetition" type="_9" context="_845" access="public" location="f8:177" file="f8" line="177" offset="0"/>
  <Field id="_5117" name="repetitionFactor" type="_842" context="_845" access="public" location="f8:179" file="f8" line="179" offset="32"/>
  <Field id="_5118" name="n1PUCCH_AN_Rep" type="_10" context="_845" access="public" location="f8:181" file="f8" line="181" offset="64"/>
  <Field id="_5119" name="tdd_AckNackFeedbackMode" type="_844" context="_845" access="public" location="f8:183" file="f8" line="183" offset="96"/>
  <Field id="_5120" name="deltaPUCCH_Shift" type="_9" context="_847" access="public" location="f8:189" file="f8" line="189" offset="0"/>
  <Field id="_5121" name="nRB_CQI" type="_9" context="_847" access="public" location="f8:191" file="f8" line="191" offset="8"/>
  <Field id="_5122" name="nCS_AN" type="_9" context="_847" access="public" location="f8:193" file="f8" line="193" offset="16"/>
  <Field id="_5123" name="n1PUCCH_AN" type="_10" context="_847" access="public" location="f8:195" file="f8" line="195" offset="32"/>
  <Field id="_5124" name="grouphop" type="_7813" context="_847" access="public" location="f8:198" file="f8" line="198" offset="48"/>
  <Field id="_5125" name="seqhop" type="_7813" context="_847" access="public" location="f8:200" file="f8" line="200" offset="208"/>
  <Field id="_5126" name="groupHoppingEnabled" type="_9" context="_849" access="public" location="f8:206" file="f8" line="206" offset="0"/>
  <Field id="_5127" name="groupAssignmentPUSCH" type="_9" context="_849" access="public" location="f8:208" file="f8" line="208" offset="8"/>
  <Field id="_5128" name="sequenceHoppingEnabled" type="_9" context="_849" access="public" location="f8:210" file="f8" line="210" offset="16"/>
  <Field id="_5129" name="cyclicShift" type="_9" context="_849" access="public" location="f8:212" file="f8" line="212" offset="24"/>
  <Field id="_5130" name="nPRS" type="_7813" context="_849" access="public" location="f8:214" file="f8" line="214" offset="32"/>
  <Field id="_5131" name="grouphop" type="_7813" context="_849" access="public" location="f8:216" file="f8" line="216" offset="192"/>
  <Field id="_5132" name="seqhop" type="_7813" context="_849" access="public" location="f8:218" file="f8" line="218" offset="352"/>
  <Field id="_5133" name="n_SB" type="_9" context="_853" access="public" location="f8:232" file="f8" line="232" offset="0"/>
  <Field id="_5134" name="hoppingMode" type="_852" context="_853" access="public" location="f8:234" file="f8" line="234" offset="32"/>
  <Field id="_5135" name="pusch_HoppingOffset" type="_9" context="_853" access="public" location="f8:236" file="f8" line="236" offset="64"/>
  <Field id="_5136" name="enable64QAM" type="_9" context="_853" access="public" location="f8:238" file="f8" line="238" offset="72"/>
  <Field id="_5137" name="ul_ReferenceSignalsPUSCH" type="_850" context="_853" access="public" location="f8:240" file="f8" line="240" offset="80"/>
  <Field id="_5138" name="betaOffset_ACK_Index" type="_10" context="_855" access="public" location="f8:246" file="f8" line="246" offset="0"/>
  <Field id="_5139" name="betaOffset_RI_Index" type="_10" context="_855" access="public" location="f8:248" file="f8" line="248" offset="16"/>
  <Field id="_5140" name="betaOffset_CQI_Index" type="_10" context="_855" access="public" location="f8:250" file="f8" line="250" offset="32"/>
  <Field id="_5141" name="betaOffset_CA_Index" type="_10" context="_857" access="public" location="f8:256" file="f8" line="256" offset="0"/>
  <Field id="_5142" name="cShift" type="_10" context="_857" access="public" location="f8:258" file="f8" line="258" offset="16"/>
  <Field id="_5143" name="referenceSignalPower" type="_5" context="_859" access="public" location="f8:264" file="f8" line="264" offset="0"/>
  <Field id="_5144" name="p_b" type="_9" context="_859" access="public" location="f8:266" file="f8" line="266" offset="8"/>
  <Field id="_5145" name="p_a" type="_862" context="_863" access="public" location="f8:284" file="f8" line="284" offset="0"/>
  <Field id="_5146" name="enabled_flag" type="_9" context="_865" access="public" location="f8:290" file="f8" line="290" offset="0"/>
  <Field id="_5147" name="srs_BandwidthConfig" type="_9" context="_865" access="public" location="f8:292" file="f8" line="292" offset="8"/>
  <Field id="_5148" name="srs_SubframeConfig" type="_9" context="_865" access="public" location="f8:294" file="f8" line="294" offset="16"/>
  <Field id="_5149" name="ackNackSRS_SimultaneousTransmission" type="_9" context="_865" access="public" location="f8:296" file="f8" line="296" offset="24"/>
  <Field id="_5150" name="srs_MaxUpPts" type="_9" context="_865" access="public" location="f8:298" file="f8" line="298" offset="32"/>
  <Field id="_5151" name="deltaF_PUCCH_Format1" type="_870" context="_879" access="public" location="f8:351" file="f8" line="351" offset="0"/>
  <Field id="_5152" name="deltaF_PUCCH_Format1b" type="_872" context="_879" access="public" location="f8:352" file="f8" line="352" offset="32"/>
  <Field id="_5153" name="deltaF_PUCCH_Format2" type="_874" context="_879" access="public" location="f8:353" file="f8" line="353" offset="64"/>
  <Field id="_5154" name="deltaF_PUCCH_Format2a" type="_876" context="_879" access="public" location="f8:354" file="f8" line="354" offset="96"/>
  <Field id="_5155" name="deltaF_PUCCH_Format2b" type="_878" context="_879" access="public" location="f8:355" file="f8" line="355" offset="128"/>
  <Field id="_5156" name="active" type="_9" context="_881" access="public" location="f8:361" file="f8" line="361" offset="0"/>
  <Field id="_5157" name="frame" type="_10" context="_881" access="public" location="f8:363" file="f8" line="363" offset="16"/>
  <Field id="_5158" name="subframe" type="_9" context="_881" access="public" location="f8:365" file="f8" line="365" offset="32"/>
  <Field id="_5159" name="rnti" type="_10" context="_881" access="public" location="f8:367" file="f8" line="367" offset="48"/>
  <Field id="_5160" name="srs_Bandwidth" type="_9" context="_881" access="public" location="f8:369" file="f8" line="369" offset="64"/>
  <Field id="_5161" name="srs_HoppingBandwidth" type="_9" context="_881" access="public" location="f8:371" file="f8" line="371" offset="72"/>
  <Field id="_5162" name="freqDomainPosition" type="_9" context="_881" access="public" location="f8:373" file="f8" line="373" offset="80"/>
  <Field id="_5163" name="duration" type="_9" context="_881" access="public" location="f8:375" file="f8" line="375" offset="88"/>
  <Field id="_5164" name="transmissionComb" type="_9" context="_881" access="public" location="f8:377" file="f8" line="377" offset="96"/>
  <Field id="_5165" name="srs_ConfigIndex" type="_10" context="_881" access="public" location="f8:379" file="f8" line="379" offset="112"/>
  <Field id="_5166" name="cyclicShift" type="_9" context="_881" access="public" location="f8:381" file="f8" line="381" offset="128"/>
  <Field id="_5167" name="srsConfigDedicatedSetup" type="_9" context="_881" access="public" location="f8:383" file="f8" line="383" offset="136"/>
  <Field id="_5168" name="srsCellSubframe" type="_9" context="_881" access="public" location="f8:385" file="f8" line="385" offset="144"/>
  <Field id="_5169" name="srsUeSubframe" type="_9" context="_881" access="public" location="f8:387" file="f8" line="387" offset="152"/>
  <Field id="_5170" name="p0_UE_PUSCH" type="_5" context="_883" access="public" location="f8:393" file="f8" line="393" offset="0"/>
  <Field id="_5171" name="deltaMCS_Enabled" type="_9" context="_883" access="public" location="f8:395" file="f8" line="395" offset="8"/>
  <Field id="_5172" name="accumulationEnabled" type="_9" context="_883" access="public" location="f8:397" file="f8" line="397" offset="16"/>
  <Field id="_5173" name="p0_UE_PUCCH" type="_5" context="_883" access="public" location="f8:399" file="f8" line="399" offset="24"/>
  <Field id="_5174" name="pSRS_Offset" type="_5" context="_883" access="public" location="f8:401" file="f8" line="401" offset="32"/>
  <Field id="_5175" name="filterCoefficient" type="_9" context="_883" access="public" location="f8:403" file="f8" line="403" offset="40"/>
  <Field id="_5176" name="p0_NominalPUSCH" type="_5" context="_889" access="public" location="f8:433" file="f8" line="433" offset="0"/>
  <Field id="_5177" name="alpha" type="_886" context="_889" access="public" location="f8:435" file="f8" line="435" offset="32"/>
  <Field id="_5178" name="p0_NominalPUCCH" type="_5" context="_889" access="public" location="f8:437" file="f8" line="437" offset="64"/>
  <Field id="_5179" name="deltaPreambleMsg3" type="_5" context="_889" access="public" location="f8:439" file="f8" line="439" offset="72"/>
  <Field id="_5180" name="deltaF_PUCCH_Format1" type="_3371" context="_889" access="public" location="f8:441" file="f8" line="441" offset="128"/>
  <Field id="_5181" name="deltaF_PUCCH_Format1a" type="_3371" context="_889" access="public" location="f8:443" file="f8" line="443" offset="192"/>
  <Field id="_5182" name="deltaF_PUCCH_Format1b" type="_3371" context="_889" access="public" location="f8:445" file="f8" line="445" offset="256"/>
  <Field id="_5183" name="deltaF_PUCCH_Format2" type="_3371" context="_889" access="public" location="f8:447" file="f8" line="447" offset="320"/>
  <Field id="_5184" name="deltaF_PUCCH_Format2a" type="_3371" context="_889" access="public" location="f8:449" file="f8" line="449" offset="384"/>
  <Field id="_5185" name="deltaF_PUCCH_Format2b" type="_3371" context="_889" access="public" location="f8:451" file="f8" line="451" offset="448"/>
  <Field id="_5186" name="indexOfFormat3" type="_9" context="_891" access="public" location="f8:457" file="f8" line="457" offset="0"/>
  <Field id="_5187" name="indexOfFormat3A" type="_9" context="_891" access="public" location="f8:459" file="f8" line="459" offset="0"/>
  <Field id="_5188" name="rnti" type="_10" context="_893" access="public" location="f8:465" file="f8" line="465" offset="0"/>
  <Field id="_5189" name="tpc_Index" type="_892" context="_893" access="public" location="f8:467" file="f8" line="467" offset="16"/>
  <Field id="_5190" name="sr_PUCCH_ResourceIndex" type="_10" context="_897" access="public" location="f8:482" file="f8" line="482" offset="0"/>
  <Field id="_5191" name="sr_ConfigIndex" type="_9" context="_897" access="public" location="f8:484" file="f8" line="484" offset="16"/>
  <Field id="_5192" name="dsr_TransMax" type="_896" context="_897" access="public" location="f8:486" file="f8" line="486" offset="32"/>
  <Field id="_5193" name="cqi_PUCCH_ResourceIndex" type="_6" context="_899" access="public" location="f8:492" file="f8" line="492" offset="0"/>
  <Field id="_5194" name="cqi_PMI_ConfigIndex" type="_6" context="_899" access="public" location="f8:494" file="f8" line="494" offset="16"/>
  <Field id="_5195" name="K" type="_9" context="_899" access="public" location="f8:496" file="f8" line="496" offset="32"/>
  <Field id="_5196" name="ri_ConfigIndex" type="_6" context="_899" access="public" location="f8:498" file="f8" line="498" offset="48"/>
  <Field id="_5197" name="simultaneousAckNackAndCQI" type="_9" context="_899" access="public" location="f8:500" file="f8" line="500" offset="64"/>
  <Field id="_5198" name="Npd" type="_10" context="_899" access="public" location="f8:502" file="f8" line="502" offset="80"/>
  <Field id="_5199" name="N_OFFSET_CQI" type="_10" context="_899" access="public" location="f8:504" file="f8" line="504" offset="96"/>
  <Field id="_5200" name="cqi_ReportModeAperiodic" type="_902" context="_903" access="public" location="f8:519" file="f8" line="519" offset="0"/>
  <Field id="_5201" name="nomPDSCH_RS_EPRE_Offset" type="_5" context="_903" access="public" location="f8:521" file="f8" line="521" offset="32"/>
  <Field id="_5202" name="CQI_ReportPeriodic" type="_900" context="_903" access="public" location="f8:522" file="f8" line="522" offset="48"/>
  <Field id="_5203" name="radioframeAllocationPeriod" type="_3370" context="_905" access="public" location="f8:528" file="f8" line="528" offset="0"/>
  <Field id="_5204" name="radioframeAllocationOffset" type="_3370" context="_905" access="public" location="f8:530" file="f8" line="530" offset="32"/>
  <Field id="_5205" name="fourFrames_flag" type="_3370" context="_905" access="public" location="f8:532" file="f8" line="532" offset="64"/>
  <Field id="_5206" name="mbsfn_SubframeConfig" type="_3370" context="_905" access="public" location="f8:538" file="f8" line="538" offset="96"/>
  <Field id="_5207" name="N_RB_DL" type="_9" context="_907" access="public" location="f8:543" file="f8" line="543" offset="0"/>
  <Field id="_5208" name="N_RB_UL" type="_9" context="_907" access="public" location="f8:545" file="f8" line="545" offset="8"/>
  <Field id="_5209" name="eutra_band" type="_9" context="_907" access="public" location="f8:547" file="f8" line="547" offset="16"/>
  <Field id="_5210" name="dl_CarrierFreq" type="_11" context="_907" access="public" location="f8:549" file="f8" line="549" offset="32"/>
  <Field id="_5211" name="ul_CarrierFreq" type="_11" context="_907" access="public" location="f8:551" file="f8" line="551" offset="64"/>
  <Field id="_5212" name="att_tx" type="_11" context="_907" access="public" location="f8:553" file="f8" line="553" offset="96"/>
  <Field id="_5213" name="att_rx" type="_11" context="_907" access="public" location="f8:555" file="f8" line="555" offset="128"/>
  <Field id="_5214" name="N_RBG" type="_9" context="_907" access="public" location="f8:557" file="f8" line="557" offset="160"/>
  <Field id="_5215" name="N_RBGS" type="_9" context="_907" access="public" location="f8:559" file="f8" line="559" offset="168"/>
  <Field id="_5216" name="Nid_cell" type="_10" context="_907" access="public" location="f8:561" file="f8" line="561" offset="176"/>
  <Field id="_5217" name="Nid_cell_mbsfn" type="_10" context="_907" access="public" location="f8:563" file="f8" line="563" offset="192"/>
  <Field id="_5218" name="Ncp" type="_824" context="_907" access="public" location="f8:565" file="f8" line="565" offset="224"/>
  <Field id="_5219" name="Ncp_UL" type="_824" context="_907" access="public" location="f8:567" file="f8" line="567" offset="256"/>
  <Field id="_5220" name="nushift" type="_9" context="_907" access="public" location="f8:569" file="f8" line="569" offset="288"/>
  <Field id="_5221" name="frame_type" type="_822" context="_907" access="public" location="f8:571" file="f8" line="571" offset="320"/>
  <Field id="_5222" name="tdd_config" type="_9" context="_907" access="public" location="f8:573" file="f8" line="573" offset="352"/>
  <Field id="_5223" name="tdd_config_S" type="_9" context="_907" access="public" location="f8:575" file="f8" line="575" offset="360"/>
  <Field id="_5224" name="srsX" type="_9" context="_907" access="public" location="f8:577" file="f8" line="577" offset="368"/>
  <Field id="_5225" name="node_id" type="_9" context="_907" access="public" location="f8:579" file="f8" line="579" offset="376"/>
  <Field id="_5226" name="threequarter_fs" type="_9" context="_907" access="public" location="f8:581" file="f8" line="581" offset="384"/>
  <Field id="_5227" name="ofdm_symbol_size" type="_10" context="_907" access="public" location="f8:583" file="f8" line="583" offset="400"/>
  <Field id="_5228" name="nb_prefix_samples" type="_10" context="_907" access="public" location="f8:585" file="f8" line="585" offset="416"/>
  <Field id="_5229" name="nb_prefix_samples0" type="_10" context="_907" access="public" location="f8:587" file="f8" line="587" offset="432"/>
  <Field id="_5230" name="first_carrier_offset" type="_10" context="_907" access="public" location="f8:589" file="f8" line="589" offset="448"/>
  <Field id="_5231" name="samples_per_tti" type="_11" context="_907" access="public" location="f8:591" file="f8" line="591" offset="480"/>
  <Field id="_5232" name="symbols_per_tti" type="_10" context="_907" access="public" location="f8:593" file="f8" line="593" offset="512"/>
  <Field id="_5233" name="dl_symbols_in_S_subframe" type="_10" context="_907" access="public" location="f8:595" file="f8" line="595" offset="528"/>
  <Field id="_5234" name="ul_symbols_in_S_subframe" type="_10" context="_907" access="public" location="f8:597" file="f8" line="597" offset="544"/>
  <Field id="_5235" name="nb_antennas_tx" type="_9" context="_907" access="public" location="f8:599" file="f8" line="599" offset="560"/>
  <Field id="_5236" name="nb_antennas_rx" type="_9" context="_907" access="public" location="f8:601" file="f8" line="601" offset="568"/>
  <Field id="_5237" name="nb_antenna_ports_eNB" type="_9" context="_907" access="public" location="f8:603" file="f8" line="603" offset="576"/>
  <Field id="_5238" name="prach_config_common" type="_836" context="_907" access="public" location="f8:605" file="f8" line="605" offset="592"/>
  <Field id="_5239" name="prach_emtc_config_common" type="_840" context="_907" access="public" location="f8:608" file="f8" line="608" offset="656"/>
  <Field id="_5240" name="pucch_config_common" type="_848" context="_907" access="public" location="f8:611" file="f8" line="611" offset="928"/>
  <Field id="_5241" name="pdsch_config_common" type="_860" context="_907" access="public" location="f8:613" file="f8" line="613" offset="1296"/>
  <Field id="_5242" name="pusch_config_common" type="_854" context="_907" access="public" location="f8:615" file="f8" line="615" offset="1312"/>
  <Field id="_5243" name="phich_config_common" type="_832" context="_907" access="public" location="f8:617" file="f8" line="617" offset="1920"/>
  <Field id="_5244" name="soundingrs_ul_config_common" type="_866" context="_907" access="public" location="f8:619" file="f8" line="619" offset="1984"/>
  <Field id="_5245" name="ul_power_control_config_common" type="_890" context="_907" access="public" location="f8:621" file="f8" line="621" offset="2048"/>
  <Field id="_5246" name="num_MBSFN_config" type="_3370" context="_907" access="public" location="f8:623" file="f8" line="623" offset="2560"/>
  <Field id="_5247" name="MBSFN_config" type="_7814" context="_907" access="public" location="f8:625" file="f8" line="625" offset="2592"/>
  <Field id="_5248" name="maxHARQ_Msg3Tx" type="_9" context="_907" access="public" location="f8:627" file="f8" line="627" offset="3616"/>
  <Field id="_5249" name="SIwindowsize" type="_9" context="_907" access="public" location="f8:629" file="f8" line="629" offset="3624"/>
  <Field id="_5250" name="SIPeriod" type="_10" context="_907" access="public" location="f8:631" file="f8" line="631" offset="3632"/>
  <Field id="_5251" name="pcfich_reg" type="_7815" context="_907" access="public" location="f8:633" file="f8" line="633" offset="3648"/>
  <Field id="_5252" name="pcfich_first_reg_idx" type="_9" context="_907" access="public" location="f8:635" file="f8" line="635" offset="3712"/>
  <Field id="_5253" name="phich_reg" type="_7816" context="_907" access="public" location="f8:637" file="f8" line="637" offset="3728"/>
  <Field id="_5254" name="mbsfn_SubframeConfig" type="_7817" context="_907" access="public" location="f8:639" file="f8" line="639" offset="6464"/>
  <Field id="_5255" name="rxdata" type="_7818" context="_913" access="public" location="f8:680" file="f8" line="680" offset="0"/>
  <Field id="_5256" name="rxdataF" type="_7818" context="_913" access="public" location="f8:684" file="f8" line="684" offset="64"/>
  <Field id="_5257" name="txdataF" type="_7818" context="_913" access="public" location="f8:690" file="f8" line="690" offset="128"/>
  <Field id="_5258" name="txdata" type="_7818" context="_915" access="public" location="f8:697" file="f8" line="697" offset="0"/>
  <Field id="_5259" name="txdataF_BF" type="_7818" context="_915" access="public" location="f8:701" file="f8" line="701" offset="64"/>
  <Field id="_5260" name="txdataF_epdcch" type="_7818" context="_915" access="public" location="f8:705" file="f8" line="705" offset="128"/>
  <Field id="_5261" name="rxdata" type="_7818" context="_915" access="public" location="f8:709" file="f8" line="709" offset="192"/>
  <Field id="_5262" name="rxdata_7_5kHz" type="_7818" context="_915" access="public" location="f8:713" file="f8" line="713" offset="256"/>
  <Field id="_5263" name="rxdataF" type="_7818" context="_915" access="public" location="f8:717" file="f8" line="717" offset="320"/>
  <Field id="_5264" name="sync_corr" type="_7819" context="_915" access="public" location="f8:720" file="f8" line="720" offset="384"/>
  <Field id="_5265" name="tdd_calib_coeffs" type="_7818" context="_915" access="public" location="f8:725" file="f8" line="725" offset="448"/>
  <Field id="_5266" name="dci_length" type="_9" context="_919" access="public" location="f8:753" file="f8" line="753" offset="0"/>
  <Field id="_5267" name="L" type="_9" context="_919" access="public" location="f8:755" file="f8" line="755" offset="8"/>
  <Field id="_5268" name="firstCCE" type="_3370" context="_919" access="public" location="f8:757" file="f8" line="757" offset="32"/>
  <Field id="_5269" name="ra_flag" type="_39" context="_919" access="public" location="f8:759" file="f8" line="759" offset="64"/>
  <Field id="_5270" name="rnti" type="_86" context="_919" access="public" location="f8:761" file="f8" line="761" offset="80"/>
  <Field id="_5271" name="harq_pid" type="_86" context="_919" access="public" location="f8:763" file="f8" line="763" offset="96"/>
  <Field id="_5272" name="format" type="_918" context="_919" access="public" location="f8:765" file="f8" line="765" offset="128"/>
  <Field id="_5273" name="dci_pdu" type="_7679" context="_919" access="public" location="f8:767" file="f8" line="767" offset="160"/>
  <Field id="_5274" name="dci_length" type="_9" context="_921" access="public" location="f8:774" file="f8" line="774" offset="0"/>
  <Field id="_5275" name="L" type="_9" context="_921" access="public" location="f8:776" file="f8" line="776" offset="8"/>
  <Field id="_5276" name="firstCCE" type="_3370" context="_921" access="public" location="f8:778" file="f8" line="778" offset="32"/>
  <Field id="_5277" name="ra_flag" type="_39" context="_921" access="public" location="f8:780" file="f8" line="780" offset="64"/>
  <Field id="_5278" name="rnti" type="_86" context="_921" access="public" location="f8:782" file="f8" line="782" offset="80"/>
  <Field id="_5279" name="format" type="_918" context="_921" access="public" location="f8:784" file="f8" line="784" offset="96"/>
  <Field id="_5280" name="epdcch_resource_assignment_flag" type="_9" context="_921" access="public" location="f8:786" file="f8" line="786" offset="128"/>
  <Field id="_5281" name="epdcch_id" type="_10" context="_921" access="public" location="f8:788" file="f8" line="788" offset="144"/>
  <Field id="_5282" name="epdcch_start_symbol" type="_9" context="_921" access="public" location="f8:790" file="f8" line="790" offset="160"/>
  <Field id="_5283" name="epdcch_num_prb" type="_9" context="_921" access="public" location="f8:792" file="f8" line="792" offset="168"/>
  <Field id="_5284" name="epdcch_prb_index" type="_7679" context="_921" access="public" location="f8:794" file="f8" line="794" offset="176"/>
  <Field id="_5285" name="dwpts_symbols" type="_9" context="_921" access="public" location="f8:796" file="f8" line="796" offset="240"/>
  <Field id="_5286" name="initial_lbt_sf" type="_9" context="_921" access="public" location="f8:798" file="f8" line="798" offset="248"/>
  <Field id="_5287" name="dci_pdu" type="_7679" context="_921" access="public" location="f8:800" file="f8" line="800" offset="256"/>
  <Field id="_5288" name="dci_length" type="_9" context="_923" access="public" location="f8:805" file="f8" line="805" offset="0"/>
  <Field id="_5289" name="L" type="_9" context="_923" access="public" location="f8:807" file="f8" line="807" offset="8"/>
  <Field id="_5290" name="firstCCE" type="_3370" context="_923" access="public" location="f8:809" file="f8" line="809" offset="32"/>
  <Field id="_5291" name="ra_flag" type="_39" context="_923" access="public" location="f8:811" file="f8" line="811" offset="64"/>
  <Field id="_5292" name="rnti" type="_86" context="_923" access="public" location="f8:813" file="f8" line="813" offset="80"/>
  <Field id="_5293" name="format" type="_918" context="_923" access="public" location="f8:815" file="f8" line="815" offset="96"/>
  <Field id="_5294" name="harq_pid" type="_9" context="_923" access="public" location="f8:817" file="f8" line="817" offset="128"/>
  <Field id="_5295" name="narrowband" type="_9" context="_923" access="public" location="f8:819" file="f8" line="819" offset="136"/>
  <Field id="_5296" name="number_of_prb_pairs" type="_9" context="_923" access="public" location="f8:821" file="f8" line="821" offset="144"/>
  <Field id="_5297" name="resource_block_assignment" type="_9" context="_923" access="public" location="f8:823" file="f8" line="823" offset="152"/>
  <Field id="_5298" name="transmission_type" type="_9" context="_923" access="public" location="f8:825" file="f8" line="825" offset="160"/>
  <Field id="_5299" name="start_symbol" type="_9" context="_923" access="public" location="f8:827" file="f8" line="827" offset="168"/>
  <Field id="_5300" name="ce_mode" type="_9" context="_923" access="public" location="f8:829" file="f8" line="829" offset="176"/>
  <Field id="_5301" name="dmrs_scrambling_init" type="_10" context="_923" access="public" location="f8:831" file="f8" line="831" offset="192"/>
  <Field id="_5302" name="i0" type="_10" context="_923" access="public" location="f8:833" file="f8" line="833" offset="208"/>
  <Field id="_5303" name="reps" type="_10" context="_923" access="public" location="f8:835" file="f8" line="835" offset="224"/>
  <Field id="_5304" name="absSF" type="_10" context="_923" access="public" location="f8:837" file="f8" line="837" offset="240"/>
  <Field id="_5305" name="dci_pdu" type="_7679" context="_923" access="public" location="f8:839" file="f8" line="839" offset="256"/>
  <Field id="_5306" name="num_dci" type="_9" context="_925" access="public" location="f8:844" file="f8" line="844" offset="0"/>
  <Field id="_5307" name="num_pdcch_symbols" type="_9" context="_925" access="public" location="f8:845" file="f8" line="845" offset="8"/>
  <Field id="_5308" name="dci_alloc" type="_7820" context="_925" access="public" location="f8:846" file="f8" line="846" offset="32"/>
  <Field id="_5309" name="hi" type="_9" context="_927" access="public" location="f8:850" file="f8" line="850" offset="0"/>
  <Field id="_5310" name="first_rb" type="_9" context="_927" access="public" location="f8:851" file="f8" line="851" offset="8"/>
  <Field id="_5311" name="n_DMRS" type="_9" context="_927" access="public" location="f8:852" file="f8" line="852" offset="16"/>
  <Field id="_5312" name="num_hi" type="_9" context="_929" access="public" location="f8:856" file="f8" line="856" offset="0"/>
  <Field id="_5313" name="config" type="_7821" context="_929" access="public" location="f8:857" file="f8" line="857" offset="8"/>
  <Field id="_5314" name="num_dci" type="_9" context="_931" access="public" location="f8:861" file="f8" line="861" offset="0"/>
  <Field id="_5315" name="edci_alloc" type="_7822" context="_931" access="public" location="f8:862" file="f8" line="862" offset="32"/>
  <Field id="_5316" name="num_dci" type="_9" context="_933" access="public" location="f8:867" file="f8" line="867" offset="0"/>
  <Field id="_5317" name="mdci_alloc" type="_7823" context="_933" access="public" location="f8:869" file="f8" line="869" offset="32"/>
  <Field id="_5318" name="e" type="_7824" context="_933" access="public" location="f8:871" file="f8" line="871" offset="10272"/>
  <Field id="_5319" name="srs_ch_estimates" type="_7818" context="_935" access="public" location="f8:879" file="f8" line="879" offset="0"/>
  <Field id="_5320" name="srs_ch_estimates_time" type="_7818" context="_935" access="public" location="f8:883" file="f8" line="883" offset="64"/>
  <Field id="_5321" name="srs" type="_5889" context="_935" access="public" location="f8:887" file="f8" line="887" offset="128"/>
  <Field id="_5322" name="rxdataF_ext" type="_7818" context="_937" access="public" location="f8:894" file="f8" line="894" offset="0"/>
  <Field id="_5323" name="rxdataF_ext2" type="_7818" context="_937" access="public" location="f8:898" file="f8" line="898" offset="64"/>
  <Field id="_5324" name="drs_ch_estimates_time" type="_7818" context="_937" access="public" location="f8:902" file="f8" line="902" offset="128"/>
  <Field id="_5325" name="drs_ch_estimates" type="_7818" context="_937" access="public" location="f8:906" file="f8" line="906" offset="192"/>
  <Field id="_5326" name="rxdataF_comp" type="_7818" context="_937" access="public" location="f8:910" file="f8" line="910" offset="256"/>
  <Field id="_5327" name="ul_ch_mag" type="_7818" context="_937" access="public" location="f8:914" file="f8" line="914" offset="320"/>
  <Field id="_5328" name="ul_ch_magb" type="_7818" context="_937" access="public" location="f8:918" file="f8" line="918" offset="384"/>
  <Field id="_5329" name="ulsch_power" type="_7825" context="_937" access="public" location="f8:920" file="f8" line="920" offset="448"/>
  <Field id="_5330" name="llr" type="_7826" context="_937" access="public" location="f8:923" file="f8" line="923" offset="512"/>
  <Field id="_5331" name="rxdataF" type="_7818" context="_939" access="public" location="f8:931" file="f8" line="931" offset="0"/>
  <Field id="_5332" name="dl_ch_estimates" type="_7827" context="_939" access="public" location="f8:937" file="f8" line="937" offset="64"/>
  <Field id="_5333" name="dl_ch_estimates_time" type="_7827" context="_939" access="public" location="f8:943" file="f8" line="943" offset="512"/>
  <Field id="_5334" name="txdata" type="_7818" context="_941" access="public" location="f8:951" file="f8" line="951" offset="0"/>
  <Field id="_5335" name="txdataF" type="_7818" context="_941" access="public" location="f8:956" file="f8" line="956" offset="64"/>
  <Field id="_5336" name="rxdata" type="_7818" context="_941" access="public" location="f8:962" file="f8" line="962" offset="128"/>
  <Field id="_5337" name="common_vars_rx_data_per_thread" type="_7828" context="_941" access="public" location="f8:964" file="f8" line="964" offset="192"/>
  <Field id="_5338" name="sync_corr" type="_5889" context="_941" access="public" location="f8:967" file="f8" line="967" offset="2112"/>
  <Field id="_5339" name="freq_offset" type="_7" context="_941" access="public" location="f8:969" file="f8" line="969" offset="2176"/>
  <Field id="_5340" name="eNb_id" type="_7" context="_941" access="public" location="f8:971" file="f8" line="971" offset="2208"/>
  <Field id="_5341" name="rxdataF_ext" type="_7818" context="_943" access="public" location="f8:978" file="f8" line="978" offset="0"/>
  <Field id="_5342" name="rxdataF_uespec_pilots" type="_7818" context="_943" access="public" location="f8:982" file="f8" line="982" offset="64"/>
  <Field id="_5343" name="rxdataF_comp0" type="_7818" context="_943" access="public" location="f8:986" file="f8" line="986" offset="128"/>
  <Field id="_5344" name="rxdataF_comp1" type="_7829" context="_943" access="public" location="f8:992" file="f8" line="992" offset="192"/>
  <Field id="_5345" name="dl_ch_estimates_ext" type="_7818" context="_943" access="public" location="f8:996" file="f8" line="996" offset="4288"/>
  <Field id="_5346" name="dl_ch_rho_ext" type="_7829" context="_943" access="public" location="f8:1002" file="f8" line="1002" offset="4352"/>
  <Field id="_5347" name="dl_bf_ch_estimates" type="_7818" context="_943" access="public" location="f8:1006" file="f8" line="1006" offset="8448"/>
  <Field id="_5348" name="dl_bf_ch_estimates_ext" type="_7818" context="_943" access="public" location="f8:1010" file="f8" line="1010" offset="8512"/>
  <Field id="_5349" name="dl_ch_rho2_ext" type="_7818" context="_943" access="public" location="f8:1014" file="f8" line="1014" offset="8576"/>
  <Field id="_5350" name="pmi_ext" type="_5094" context="_943" access="public" location="f8:1017" file="f8" line="1017" offset="8640"/>
  <Field id="_5351" name="dl_ch_mag0" type="_7818" context="_943" access="public" location="f8:1021" file="f8" line="1021" offset="8704"/>
  <Field id="_5352" name="dl_ch_mag1" type="_7829" context="_943" access="public" location="f8:1025" file="f8" line="1025" offset="8768"/>
  <Field id="_5353" name="dl_ch_magb0" type="_7818" context="_943" access="public" location="f8:1029" file="f8" line="1029" offset="12864"/>
  <Field id="_5354" name="dl_ch_magb1" type="_7829" context="_943" access="public" location="f8:1033" file="f8" line="1033" offset="12928"/>
  <Field id="_5355" name="rho" type="_7818" context="_943" access="public" location="f8:1037" file="f8" line="1037" offset="17024"/>
  <Field id="_5356" name="rho_i" type="_7818" context="_943" access="public" location="f8:1039" file="f8" line="1039" offset="17088"/>
  <Field id="_5357" name="llr" type="_7830" context="_943" access="public" location="f8:1043" file="f8" line="1043" offset="17152"/>
  <Field id="_5358" name="log2_maxh" type="_6" context="_943" access="public" location="f8:1045" file="f8" line="1045" offset="17280"/>
  <Field id="_5359" name="log2_maxh0" type="_6" context="_943" access="public" location="f8:1047" file="f8" line="1047" offset="17296"/>
  <Field id="_5360" name="log2_maxh1" type="_6" context="_943" access="public" location="f8:1049" file="f8" line="1049" offset="17312"/>
  <Field id="_5361" name="llr_shifts" type="_5094" context="_943" access="public" location="f8:1052" file="f8" line="1052" offset="17344"/>
  <Field id="_5362" name="llr_shifts_p" type="_5094" context="_943" access="public" location="f8:1055" file="f8" line="1055" offset="17408"/>
  <Field id="_5363" name="llr128" type="_7831" context="_943" access="public" location="f8:1059" file="f8" line="1059" offset="17472"/>
  <Field id="_5364" name="llr128_2ndstream" type="_7831" context="_943" access="public" location="f8:1063" file="f8" line="1063" offset="17536"/>
  <Field id="_5365" name="llr_offset" type="_7832" context="_943" access="public" location="f8:1068" file="f8" line="1068" offset="17600"/>
  <Field id="_5366" name="llr_length" type="_7832" context="_943" access="public" location="f8:1070" file="f8" line="1070" offset="18048"/>
  <Field id="_5367" name="rxdataF_ext" type="_7818" context="_945" access="public" location="f8:1077" file="f8" line="1077" offset="0"/>
  <Field id="_5368" name="rxdataF_comp" type="_7833" context="_945" access="public" location="f8:1081" file="f8" line="1081" offset="64"/>
  <Field id="_5369" name="dl_ch_estimates_ext" type="_7818" context="_945" access="public" location="f8:1085" file="f8" line="1085" offset="128"/>
  <Field id="_5370" name="dl_ch_rho_ext" type="_7833" context="_945" access="public" location="f8:1089" file="f8" line="1089" offset="192"/>
  <Field id="_5371" name="pmi_ext" type="_5094" context="_945" access="public" location="f8:1092" file="f8" line="1092" offset="256"/>
  <Field id="_5372" name="dl_ch_mag" type="_7833" context="_945" access="public" location="f8:1096" file="f8" line="1096" offset="320"/>
  <Field id="_5373" name="dl_ch_magb" type="_7833" context="_945" access="public" location="f8:1100" file="f8" line="1100" offset="384"/>
  <Field id="_5374" name="rho" type="_7833" context="_945" access="public" location="f8:1104" file="f8" line="1104" offset="448"/>
  <Field id="_5375" name="rho_i" type="_7833" context="_945" access="public" location="f8:1106" file="f8" line="1106" offset="512"/>
  <Field id="_5376" name="llr" type="_7830" context="_945" access="public" location="f8:1110" file="f8" line="1110" offset="576"/>
  <Field id="_5377" name="log2_maxh" type="_9" context="_945" access="public" location="f8:1112" file="f8" line="1112" offset="704"/>
  <Field id="_5378" name="llr128" type="_7831" context="_945" access="public" location="f8:1116" file="f8" line="1116" offset="768"/>
  <Field id="_5379" name="rxdataF_ext" type="_7818" context="_947" access="public" location="f8:1126" file="f8" line="1126" offset="0"/>
  <Field id="_5380" name="rxdataF_comp" type="_7818" context="_947" access="public" location="f8:1130" file="f8" line="1130" offset="64"/>
  <Field id="_5381" name="dl_ch_estimates_ext" type="_7818" context="_947" access="public" location="f8:1134" file="f8" line="1134" offset="128"/>
  <Field id="_5382" name="dl_ch_rho_ext" type="_7818" context="_947" access="public" location="f8:1138" file="f8" line="1138" offset="192"/>
  <Field id="_5383" name="rho" type="_7818" context="_947" access="public" location="f8:1142" file="f8" line="1142" offset="256"/>
  <Field id="_5384" name="llr" type="_7834" context="_947" access="public" location="f8:1145" file="f8" line="1145" offset="320"/>
  <Field id="_5385" name="llr16" type="_7834" context="_947" access="public" location="f8:1148" file="f8" line="1148" offset="384"/>
  <Field id="_5386" name="wbar" type="_7834" context="_947" access="public" location="f8:1151" file="f8" line="1151" offset="448"/>
  <Field id="_5387" name="e_rx" type="_7835" context="_947" access="public" location="f8:1154" file="f8" line="1154" offset="512"/>
  <Field id="_5388" name="num_pdcch_symbols" type="_9" context="_947" access="public" location="f8:1156" file="f8" line="1156" offset="576"/>
  <Field id="_5389" name="crnti" type="_10" context="_947" access="public" location="f8:1158" file="f8" line="1158" offset="592"/>
  <Field id="_5390" name="crnti_is_temporary" type="_9" context="_947" access="public" location="f8:1160" file="f8" line="1160" offset="608"/>
  <Field id="_5391" name="dci_errors" type="_11" context="_947" access="public" location="f8:1162" file="f8" line="1162" offset="640"/>
  <Field id="_5392" name="dci_received" type="_11" context="_947" access="public" location="f8:1164" file="f8" line="1164" offset="672"/>
  <Field id="_5393" name="dci_false" type="_11" context="_947" access="public" location="f8:1166" file="f8" line="1166" offset="704"/>
  <Field id="_5394" name="dci_missed" type="_11" context="_947" access="public" location="f8:1168" file="f8" line="1168" offset="736"/>
  <Field id="_5395" name="nCCE" type="_7746" context="_947" access="public" location="f8:1170" file="f8" line="1170" offset="768"/>
  <Field id="_5396" name="dciFormat" type="_9" context="_947" access="public" location="f8:1172" file="f8" line="1172" offset="848"/>
  <Field id="_5397" name="agregationLevel" type="_9" context="_947" access="public" location="f8:1173" file="f8" line="1173" offset="856"/>
  <Field id="_5398" name="pbch_d" type="_7836" context="_949" access="public" location="f8:1178" file="f8" line="1178" offset="0"/>
  <Field id="_5399" name="pbch_w" type="_7837" context="_949" access="public" location="f8:1179" file="f8" line="1179" offset="1728"/>
  <Field id="_5400" name="pbch_e" type="_7838" context="_949" access="public" location="f8:1180" file="f8" line="1180" offset="4608"/>
  <Field id="_5401" name="rxdataF_ext" type="_7818" context="_951" access="public" location="f8:1187" file="f8" line="1187" offset="0"/>
  <Field id="_5402" name="rxdataF_comp" type="_7818" context="_951" access="public" location="f8:1191" file="f8" line="1191" offset="64"/>
  <Field id="_5403" name="dl_ch_estimates_ext" type="_7818" context="_951" access="public" location="f8:1195" file="f8" line="1195" offset="128"/>
  <Field id="_5404" name="llr" type="_7835" context="_951" access="public" location="f8:1198" file="f8" line="1198" offset="192"/>
  <Field id="_5405" name="decoded_output" type="_5094" context="_951" access="public" location="f8:1201" file="f8" line="1201" offset="256"/>
  <Field id="_5406" name="pdu_errors" type="_11" context="_951" access="public" location="f8:1203" file="f8" line="1203" offset="320"/>
  <Field id="_5407" name="pdu_errors_last" type="_11" context="_951" access="public" location="f8:1205" file="f8" line="1205" offset="352"/>
  <Field id="_5408" name="pdu_errors_conseq" type="_11" context="_951" access="public" location="f8:1207" file="f8" line="1207" offset="384"/>
  <Field id="_5409" name="pdu_fer" type="_11" context="_951" access="public" location="f8:1209" file="f8" line="1209" offset="416"/>
  <Field id="_5410" name="amp" type="_6" context="_953" access="public" location="f8:1213" file="f8" line="1213" offset="0"/>
  <Field id="_5411" name="prachF" type="_7826" context="_953" access="public" location="f8:1214" file="f8" line="1214" offset="64"/>
  <Field id="_5412" name="prach" type="_7826" context="_953" access="public" location="f8:1215" file="f8" line="1215" offset="128"/>
  <Field id="_5413" name="prachF" type="_7826" context="_955" access="public" location="f8:1223" file="f8" line="1223" offset="0"/>
  <Field id="_5414" name="rxsigF" type="_7839" context="_955" access="public" location="f8:1228" file="f8" line="1228" offset="64"/>
  <Field id="_5415" name="prach_ifft" type="_7840" context="_955" access="public" location="f8:1233" file="f8" line="1233" offset="320"/>
  <Field id="_5416" name="first_frame" type="_7841" context="_955" access="public" location="f8:1238" file="f8" line="1238" offset="576"/>
  <Field id="_5417" name="repetition_number" type="_7841" context="_955" access="public" location="f8:1240" file="f8" line="1240" offset="704"/>
  <Field id="_5418" name="ra_PreambleIndex" type="_9" context="_957" access="public" location="f8:1246" file="f8" line="1246" offset="0"/>
  <Field id="_5419" name="ra_RACH_MaskIndex" type="_9" context="_957" access="public" location="f8:1248" file="f8" line="1248" offset="8"/>
  <Field id="_5420" name="ra_PREAMBLE_RECEIVED_TARGET_POWER" type="_5" context="_957" access="public" location="f8:1250" file="f8" line="1250" offset="16"/>
  <Field id="_5421" name="ra_TDD_map_index" type="_9" context="_957" access="public" location="f8:1252" file="f8" line="1252" offset="24"/>
  <Field id="_5422" name="ra_RNTI" type="_10" context="_957" access="public" location="f8:1254" file="f8" line="1254" offset="32"/>
  <Field id="_5423" name="Msg3" type="_5094" context="_957" access="public" location="f8:1256" file="f8" line="1256" offset="64"/>
  <Field id="_5424" name="dl_pow_off" type="_9" context="_959" access="public" location="f8:1262" file="f8" line="1262" offset="0"/>
  <Field id="_5425" name="rballoc_sub" type="_7842" context="_959" access="public" location="f8:1264" file="f8" line="1264" offset="8"/>
  <Field id="_5426" name="pre_nb_available_rbs" type="_9" context="_959" access="public" location="f8:1266" file="f8" line="1266" offset="408"/>
  <Field id="_5427" name="earfcn" type="_967" context="_971" access="public" location="f9:66" file="f9" line="66" offset="0"/>
  <Field id="_5428" name="cell_id" type="_968" context="_971" access="public" location="f9:67" file="f9" line="67" offset="16"/>
  <Field id="_5429" name="rsrp" type="_969" context="_971" access="public" location="f9:68" file="f9" line="68" offset="32"/>
  <Field id="_5430" name="rsrq" type="_970" context="_971" access="public" location="f9:69" file="f9" line="69" offset="40"/>
  <Field id="_5431" name="frame_type" type="_7843" context="_973" access="public" location="f9:75" file="f9" line="75" offset="0"/>
  <Field id="_5432" name="prefix_type" type="_7844" context="_973" access="public" location="f9:76" file="f9" line="76" offset="32"/>
  <Field id="_5433" name="downlink_frequency" type="_7845" context="_973" access="public" location="f9:77" file="f9" line="77" offset="64"/>
  <Field id="_5434" name="uplink_frequency_offset" type="_7846" context="_973" access="public" location="f9:78" file="f9" line="78" offset="96"/>
  <Field id="_5435" name="nb_antennas_tx" type="_7846" context="_973" access="public" location="f9:79" file="f9" line="79" offset="128"/>
  <Field id="_5436" name="nb_antennas_rx" type="_7846" context="_973" access="public" location="f9:80" file="f9" line="80" offset="160"/>
  <Field id="_5437" name="tx_gain" type="_7846" context="_973" access="public" location="f9:81" file="f9" line="81" offset="192"/>
  <Field id="_5438" name="rx_gain" type="_7846" context="_973" access="public" location="f9:82" file="f9" line="82" offset="224"/>
  <Field id="_5439" name="earfcn_start" type="_967" context="_977" access="public" location="f9:93" file="f9" line="93" offset="0"/>
  <Field id="_5440" name="earfcn_end" type="_967" context="_977" access="public" location="f9:94" file="f9" line="94" offset="16"/>
  <Field id="_5441" name="cell_nb" type="_9" context="_985" access="public" location="f9:119" file="f9" line="119" offset="0"/>
  <Field id="_5442" name="cells" type="_7847" context="_985" access="public" location="f9:120" file="f9" line="120" offset="16"/>
  <Field id="_5443" name="frame" type="_11" context="_989" access="public" location="f10:57" file="f10" line="57" offset="0"/>
  <Field id="_5444" name="sub_frame" type="_9" context="_989" access="public" location="f10:58" file="f10" line="58" offset="32"/>
  <Field id="_5445" name="enb_index" type="_10" context="_989" access="public" location="f10:59" file="f10" line="59" offset="48"/>
  <Field id="_5446" name="frame" type="_11" context="_992" access="public" location="f10:65" file="f10" line="65" offset="0"/>
  <Field id="_5447" name="sdu_size" type="_11" context="_992" access="public" location="f10:66" file="f10" line="66" offset="32"/>
  <Field id="_5448" name="sdu" type="_7848" context="_992" access="public" location="f10:67" file="f10" line="67" offset="64"/>
  <Field id="_5449" name="enb_index" type="_9" context="_992" access="public" location="f10:68" file="f10" line="68" offset="4160"/>
  <Field id="_5450" name="frame" type="_11" context="_994" access="public" location="f10:72" file="f10" line="72" offset="0"/>
  <Field id="_5451" name="sub_frame" type="_9" context="_994" access="public" location="f10:73" file="f10" line="73" offset="32"/>
  <Field id="_5452" name="sdu_size" type="_11" context="_994" access="public" location="f10:74" file="f10" line="74" offset="64"/>
  <Field id="_5453" name="sdu" type="_7848" context="_994" access="public" location="f10:75" file="f10" line="75" offset="96"/>
  <Field id="_5454" name="enb_index" type="_9" context="_994" access="public" location="f10:76" file="f10" line="76" offset="4192"/>
  <Field id="_5455" name="rsrq" type="_9" context="_994" access="public" location="f10:77" file="f10" line="77" offset="4200"/>
  <Field id="_5456" name="rsrp" type="_9" context="_994" access="public" location="f10:78" file="f10" line="78" offset="4208"/>
  <Field id="_5457" name="frame" type="_11" context="_996" access="public" location="f10:82" file="f10" line="82" offset="0"/>
  <Field id="_5458" name="sdu_size" type="_11" context="_996" access="public" location="f10:83" file="f10" line="83" offset="32"/>
  <Field id="_5459" name="sdu" type="_7848" context="_996" access="public" location="f10:84" file="f10" line="84" offset="64"/>
  <Field id="_5460" name="enb_index" type="_9" context="_996" access="public" location="f10:85" file="f10" line="85" offset="4160"/>
  <Field id="_5461" name="enb_index" type="_9" context="_998" access="public" location="f10:89" file="f10" line="89" offset="0"/>
  <Field id="_5462" name="frame" type="_11" context="_1000" access="public" location="f10:93" file="f10" line="93" offset="0"/>
  <Field id="_5463" name="sub_frame" type="_9" context="_1000" access="public" location="f10:94" file="f10" line="94" offset="32"/>
  <Field id="_5464" name="rnti" type="_10" context="_1000" access="public" location="f10:95" file="f10" line="95" offset="48"/>
  <Field id="_5465" name="sdu_size" type="_11" context="_1000" access="public" location="f10:96" file="f10" line="96" offset="64"/>
  <Field id="_5466" name="sdu" type="_7848" context="_1000" access="public" location="f10:97" file="f10" line="97" offset="96"/>
  <Field id="_5467" name="enb_index" type="_9" context="_1000" access="public" location="f10:98" file="f10" line="98" offset="4192"/>
  <Field id="_5468" name="CC_id" type="_3370" context="_1000" access="public" location="f10:99" file="f10" line="99" offset="4224"/>
  <Field id="_5469" name="frame" type="_11" context="_1002" access="public" location="f10:103" file="f10" line="103" offset="0"/>
  <Field id="_5470" name="sdu_size" type="_11" context="_1002" access="public" location="f10:104" file="f10" line="104" offset="32"/>
  <Field id="_5471" name="sdu" type="_7848" context="_1002" access="public" location="f10:105" file="f10" line="105" offset="64"/>
  <Field id="_5472" name="enb_index" type="_9" context="_1002" access="public" location="f10:106" file="f10" line="106" offset="4160"/>
  <Field id="_5473" name="mbsfn_sync_area" type="_9" context="_1002" access="public" location="f10:107" file="f10" line="107" offset="4168"/>
  <Field id="_5474" name="frame" type="_11" context="_1004" access="public" location="f10:111" file="f10" line="111" offset="0"/>
  <Field id="_5475" name="sub_frame" type="_9" context="_1004" access="public" location="f10:112" file="f10" line="112" offset="32"/>
  <Field id="_5476" name="sdu_size" type="_11" context="_1004" access="public" location="f10:113" file="f10" line="113" offset="64"/>
  <Field id="_5477" name="sdu" type="_7848" context="_1004" access="public" location="f10:114" file="f10" line="114" offset="96"/>
  <Field id="_5478" name="enb_index" type="_9" context="_1004" access="public" location="f10:115" file="f10" line="115" offset="4192"/>
  <Field id="_5479" name="mbsfn_sync_area" type="_9" context="_1004" access="public" location="f10:116" file="f10" line="116" offset="4200"/>
  <Field id="_5480" name="frame" type="_11" context="_1006" access="public" location="f10:120" file="f10" line="120" offset="0"/>
  <Field id="_5481" name="sdu_size" type="_11" context="_1006" access="public" location="f10:121" file="f10" line="121" offset="32"/>
  <Field id="_5482" name="sdu" type="_7848" context="_1006" access="public" location="f10:122" file="f10" line="122" offset="64"/>
  <Field id="_5483" name="enb_index" type="_9" context="_1006" access="public" location="f10:123" file="f10" line="123" offset="4160"/>
  <Field id="_5484" name="frame" type="_11" context="_1008" access="public" location="f11:41" file="f11" line="41" offset="0"/>
  <Field id="_5485" name="enb_flag" type="_9" context="_1008" access="public" location="f11:42" file="f11" line="42" offset="32"/>
  <Field id="_5486" name="rb_id" type="_11" context="_1008" access="public" location="f11:43" file="f11" line="43" offset="64"/>
  <Field id="_5487" name="muip" type="_11" context="_1008" access="public" location="f11:44" file="f11" line="44" offset="96"/>
  <Field id="_5488" name="confirmp" type="_11" context="_1008" access="public" location="f11:45" file="f11" line="45" offset="128"/>
  <Field id="_5489" name="sdu_size" type="_11" context="_1008" access="public" location="f11:46" file="f11" line="46" offset="160"/>
  <Field id="_5490" name="sdu_p" type="_5094" context="_1008" access="public" location="f11:47" file="f11" line="47" offset="192"/>
  <Field id="_5491" name="mode" type="_9" context="_1008" access="public" location="f11:48" file="f11" line="48" offset="256"/>
  <Field id="_5492" name="rnti" type="_10" context="_1008" access="public" location="f11:49" file="f11" line="49" offset="272"/>
  <Field id="_5493" name="module_id" type="_9" context="_1008" access="public" location="f11:50" file="f11" line="50" offset="288"/>
  <Field id="_5494" name="eNB_index" type="_9" context="_1008" access="public" location="f11:51" file="f11" line="51" offset="296"/>
  <Field id="_5495" name="frame" type="_11" context="_1010" access="public" location="f11:55" file="f11" line="55" offset="0"/>
  <Field id="_5496" name="dcch_index" type="_9" context="_1010" access="public" location="f11:56" file="f11" line="56" offset="32"/>
  <Field id="_5497" name="sdu_size" type="_11" context="_1010" access="public" location="f11:57" file="f11" line="57" offset="64"/>
  <Field id="_5498" name="sdu_p" type="_5094" context="_1010" access="public" location="f11:58" file="f11" line="58" offset="128"/>
  <Field id="_5499" name="rnti" type="_10" context="_1010" access="public" location="f11:59" file="f11" line="59" offset="192"/>
  <Field id="_5500" name="module_id" type="_9" context="_1010" access="public" location="f11:60" file="f11" line="60" offset="208"/>
  <Field id="_5501" name="eNB_index" type="_9" context="_1010" access="public" location="f11:61" file="f11" line="61" offset="216"/>
  <Field id="_5502" name="sdu_size" type="_11" context="_1012" access="public" location="f11:65" file="f11" line="65" offset="0"/>
  <Field id="_5503" name="sdu_p" type="_5094" context="_1012" access="public" location="f11:66" file="f11" line="66" offset="64"/>
  <Field id="_5504" name="mode" type="_9" context="_1012" access="public" location="f11:67" file="f11" line="67" offset="128"/>
  <Field id="_5505" name="rnti" type="_10" context="_1012" access="public" location="f11:68" file="f11" line="68" offset="144"/>
  <Field id="_5506" name="ue_index" type="_9" context="_1012" access="public" location="f11:69" file="f11" line="69" offset="160"/>
  <Field id="_5507" name="CC_id" type="_9" context="_1012" access="public" location="f11:70" file="f11" line="70" offset="168"/>
  <Field id="_5508" name="length" type="_1015" context="_1022" access="public" location="f12:113" file="f12" line="113" offset="0"/>
  <Union id="_5509" name="" context="_1022" access="public" location="f12:114" file="f12" line="114" members="_7849 _7850 _7851" size="64" align="8"/>
  <Field id="_5510" name="u" type="_5509" context="_1022" access="public" location="f12:137" file="f12" line="137" offset="8"/>
  <Field id="_5511" name="ext" type="_1015" bits="1" context="_1024" access="public" location="f12:170" file="f12" line="170" offset="0"/>
  <Field id="_5512" name="ton" type="_1015" bits="3" context="_1024" access="public" location="f12:179" file="f12" line="179" offset="1"/>
  <Field id="_5513" name="npi" type="_1015" bits="4" context="_1024" access="public" location="f12:191" file="f12" line="191" offset="4"/>
  <Struct id="_5514" name="" context="_1024" access="public" location="f12:193" file="f12" line="193" members="_7852 _7853" size="8" align="8"/>
  <Field id="_5515" name="digit" type="_7854" context="_1024" access="public" location="f12:197" file="f12" line="197" offset="8"/>
  <Field id="_5516" name="MCCdigit2" type="_1015" bits="4" context="_1027" access="public" location="f12:210" file="f12" line="210" offset="0"/>
  <Field id="_5517" name="MCCdigit1" type="_1015" bits="4" context="_1027" access="public" location="f12:211" file="f12" line="211" offset="4"/>
  <Field id="_5518" name="MNCdigit3" type="_1015" bits="4" context="_1027" access="public" location="f12:212" file="f12" line="212" offset="8"/>
  <Field id="_5519" name="MCCdigit3" type="_1015" bits="4" context="_1027" access="public" location="f12:213" file="f12" line="213" offset="12"/>
  <Field id="_5520" name="MNCdigit2" type="_1015" bits="4" context="_1027" access="public" location="f12:214" file="f12" line="214" offset="16"/>
  <Field id="_5521" name="MNCdigit1" type="_1015" bits="4" context="_1027" access="public" location="f12:215" file="f12" line="215" offset="20"/>
  <Field id="_5522" name="plmn" type="_1028" context="_1029" access="public" location="f12:222" file="f12" line="222" offset="0"/>
  <Field id="_5523" name="lac" type="_1017" context="_1029" access="public" location="f12:223" file="f12" line="223" offset="32"/>
  <Field id="_5524" name="plmn" type="_1028" context="_1031" access="public" location="f12:230" file="f12" line="230" offset="0"/>
  <Field id="_5525" name="lac" type="_1017" context="_1031" access="public" location="f12:231" file="f12" line="231" offset="32"/>
  <Field id="_5526" name="rac" type="_1018" context="_1031" access="public" location="f12:232" file="f12" line="232" offset="48"/>
  <Field id="_5527" name="plmn" type="_1028" context="_1033" access="public" location="f12:239" file="f12" line="239" offset="0"/>
  <Field id="_5528" name="tac" type="_1019" context="_1033" access="public" location="f12:240" file="f12" line="240" offset="32"/>
  <Field id="_5529" name="plmn" type="_1028" context="_1035" access="public" location="f12:247" file="f12" line="247" offset="0"/>
  <Field id="_5530" name="MMEgid" type="_10" context="_1035" access="public" location="f12:248" file="f12" line="248" offset="32"/>
  <Field id="_5531" name="MMEcode" type="_9" context="_1035" access="public" location="f12:249" file="f12" line="249" offset="48"/>
  <Field id="_5532" name="gummei" type="_1036" context="_1037" access="public" location="f12:256" file="f12" line="256" offset="0"/>
  <Field id="_5533" name="m_tmsi" type="_11" context="_1037" access="public" location="f12:257" file="f12" line="257" offset="64"/>
  <Union id="_5534" name="" context="_1043" access="public" location="f13:176" file="f13" line="176" members="_7855 _7856 _7857" size="136" align="8"/>
  <Field id="_5535" name="id" type="_5534" context="_1043" access="public" location="f13:180" file="f13" line="180" offset="0"/>
  <Field id="_5536" name="gbrUL" type="_3370" context="_1045" access="public" location="f13:189" file="f13" line="189" offset="0"/>
  <Field id="_5537" name="gbrDL" type="_3370" context="_1045" access="public" location="f13:190" file="f13" line="190" offset="32"/>
  <Field id="_5538" name="mbrUL" type="_3370" context="_1045" access="public" location="f13:191" file="f13" line="191" offset="64"/>
